[
  {
    "title": "Google API Keys Weren't Secrets. But then Gemini Changed the Rules.",
    "link": "https://simonwillison.net/2026/Feb/26/google-api-keys/#atom-everything",
    "content": "\n    \n<p><strong><a href=\"https://trufflesecurity.com/blog/google-api-keys-werent-secrets-but-then-gemini-changed-the-rules\">Google API Keys Weren&#x27;t Secrets. But then Gemini Changed the Rules.</a></strong></p>\nYikes! It turns out Gemini and Google Maps (and other services) share the same API keys... but Google Maps API keys are designed to be public, since they are embedded directly in web pages. Gemini API keys can be used to access private files and make billable API requests, so they absolutely should not be shared.</p>\n<p>If you don't understand this it's very easy to accidentally enable Gemini billing on a previously public API key that exists in the wild already.</p>\n<blockquote>\n<p>What makes this a privilege escalation rather than a misconfiguration is the sequence of events. </p>\n<ol>\n<li>A developer creates an API key and embeds it in a website for Maps. (At that point, the key is harmless.) </li>\n<li>The Gemini API gets enabled on the same project. (Now that same key can access sensitive Gemini endpoints.) </li>\n<li>The developer is never warned that the keys' privileges changed underneath it. (The key went from public identifier to secret credential).</li>\n</ol>\n</blockquote>\n<p>Truffle Security found 2,863 API keys in the November 2025 Common Crawl that could access Gemini, verified by hitting the <code>/models</code> listing endpoint. This included several keys belonging to Google themselves, one of which had been deployed since February 2023 (according to the Internet Archive) hence predating the Gemini API that it could now access.</p>\n<p>Google are working to revoke affected keys but it's still a good idea to check that none of yours are affected by this.\n\n    <p><small></small>Via <a href=\"https://news.ycombinator.com/item?id=47156925\">Hacker News</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/api-keys\">api-keys</a>, <a href=\"https://simonwillison.net/tags/google\">google</a>, <a href=\"https://simonwillison.net/tags/security\">security</a>, <a href=\"https://simonwillison.net/tags/gemini\">gemini</a></p>\n\n\n\n",
    "description": "Google API Keys Weren&#x27;t Secrets. But then Gemini Changed the Rules. Yikes! It turns out Gemini and Google Maps (and other services) share the same API keys... but Google Maps API keys are designed to be public, since they are embedded directly in web pages. Gemini API keys can be used to access private files and make billable API requests, so they absolutely should not be shared. If you don't understand this it's very easy to accidentally enable Gemini billing on a previously public API key",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-26T04:28:55+00:00",
    "fetched_at": "2026-02-26T12:22:41.135227",
    "url_hash": "1d9836cf627c3ebfd076bbec3a4b3cf5"
  },
  {
    "title": "Pluralistic: If you build it (and it works), Trump will come (and take it) (26 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/26/hanged-for-a-sheep/",
    "content": "<p><!--\nTags:\ndisenshittification nation, adversarial interoperability, post-american internet, disenshittification, trump, tiktok, data sovereignty, digital sovereignty\n\nSummary:\nIf you build it (and it works), Trump will come (and take it); Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/26/hanged-for-a-sheep/\n\nTitle:\nPluralistic: If you build it (and it works), Trump will come (and take it) (26 Feb 2026) hanged-for-a-sheep\n\nBullet:\n&#x1fab0;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/26Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#as-for-a-lamb\">If you build it (and it works), Trump will come (and take it)</a>: Trump wants Big Tech to win, not to play fair.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#retro\">Object permanence</a>: Harpercollins v libraries; Rothfuss x Firefly; Bookseller seethings; If magazine; HBR v executive pay; Apple caves on encryption.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12472\"></span></p>\n<hr/>\n<p><a name=\"as-for-a-lamb\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"Uncle Sam, peering through a magnifying glass at the planet Earth, which is in the palm of his other hand. His hair has been replaced with a Trump wig and his skin has been tinted Cheeto orange. The background is the Great Seal of the USA, and the arrows in the eagle's claw have been replaced with a bundle of glowing fiber optics.\" src=\"https://i0.wp.com/craphound.com/images/trump-data-sovereignty.jpg?w=840&#038;ssl=1\"/></p>\n<h1>If you build it (and it works), Trump will come (and take it) (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#as-for-a-lamb\">permalink</a>)</h1>\n<p>Crises precipitate change: Trump's incontinent belligerence spurred the world to long-overdue action on \"digital sovereignty,\" as people woke up to the stark realization that a handful of Trump-aligned giant tech firms could shut down their governments, companies and households at the click of a mouse.</p>\n<p>This has been a long, long time coming. Long before Trump, the Snowden revelations made it clear that the US government had weaponized its position as the world's IT export powerhouse <em>and</em> the interchange hub for the world's transoceanic fiber links, and was actively spying on everyone &#8211; allies and foes, presidents and plebs &#8211; to attain geopolitical and commercial advantages for America. Even after that stark reminder, the world continued to putter along, knowing that the US had planted demolition charges in its digital infrastructure, but praying that the \"rules-based international order\" would stop America from pushing the button.</p>\n<p>Now, more than a decade into the Trump era, the world is <em>finally</em> confronting the reality that they need to get the hell off of American IT, and transition to open, transparent and verifiable alternatives for their administrative tools, telecoms infrastructure and embedded systems for agriculture, industry and transportation. And not a moment too soon:</p>\n<p><a href=\"https://pluralistic.net/2026/01/01/39c3/#the-new-coalition\">https://pluralistic.net/2026/01/01/39c3/#the-new-coalition</a></p>\n<p>But building the post-American internet is easier said than done. There remain huge, unresolved questions about the best way to proceed.</p>\n<p>One thing is clear: we will need new systems: the aforementioned open, transparent, verifiable code and hardware. That's a huge project, but the good news is that it benefits tremendously from scale, which means that as countries, businesses and households switch to the post-American internet, there will be ever more resources to devote to building, maintaining and improving this project. That's how scientific endeavors work: they're global collaborations that allow multiple parties to simultaneously attack the problems from many angles at once. Think of the global effort to sequence, understand, and produce vaccines for Covid 19.</p>\n<p>Developing the code and hardware for the post-American internet scales beautifully, making it unique among the many tasks posed by the post-American world. Other untrustworthy US platforms &#8211; such as the dollar, or the fiber links that make interconnection in the USA &#8211; are <em>hampered</em> by scale. The fact that hundreds of countries use the dollar and rely on US fiber connections makes replacing them harder, not easier:</p>\n<p><a href=\"https://pluralistic.net/2025/11/26/difficult-multipolarism/#eurostack\">https://pluralistic.net/2025/11/26/difficult-multipolarism/#eurostack</a></p>\n<p>Building the post-American internet isn't easy, but there's a clear set of construction plans. What's far less clear is how we <em>transition</em> to the post-American internet. How do people, organizations and governments that currently have their data locked up in US Big Tech silos get it off their platforms and onto new, open, transparent, verifiable successors? Literally: how do you move the data from the old system to the new one, preserving things like edit/view permissions, edit histories, and other complex data-structures that often have high-stakes attached to them (for example, many organizations and governments are legally required to maintain strict view/edit permissions for sensitive data, and must preserve the histories of their documents).</p>\n<p>On top of that, there's all the <em>systems</em> that we use to talk to one another: media services from Instagram to Tiktok to Youtube; chat services from iMessage to Discord. It's easy enough to build alternatives to these services &#8211; indeed, they already exist, though they may require additional engineering to scale them up for hundreds of millions or billions of users &#8211; but that's only half the battle. What do we do about the literal billions of people who are already using the American systems?</p>\n<p>This is where the big divisions appear. In one camp, you have the \"if you build it, they will come\" school, who say that all we need to do is make our services so obviously superior to the legacy services that America has exported around the world and people will just switch. This is a very seductive argument. After all, the American systems are visibly, painfully defective: riddled with surveillance and ads, powered by terrible algorithms, plagued by moderation failures.</p>\n<p>But waiting for people to recognize the superiority of your alternatives and jumping ship is a dead end. It completely misapprehends the reason that users are <em>still</em> on legacy social media and other platforms. People don't use Instagram because they love Mark Zuckerberg; they use it because they love their friends more than they hate Mark Zuckerberg:</p>\n<p><a href=\"https://pluralistic.net/2026/01/30/zucksauce/#gandersauce\">https://pluralistic.net/2026/01/30/zucksauce/#gandersauce</a></p>\n<p>What's more, Zuckerberg knows this. He knows that users of his service are hamstrung by the \"collective action problem\" of getting the people who matter to you to agree on when it's time to leave a service, and on which service is a safe haven to flee to:</p>\n<p><a href=\"https://pluralistic.net/2022/10/29/how-to-leave-dying-social-media-platforms/\">https://pluralistic.net/2022/10/29/how-to-leave-dying-social-media-platforms/</a></p>\n<p>The reason Zuckerberg knows this is that he had to contend with it at the dawn of Facebook, when the majority of social media users were locked into an obviously inferior legacy platform called Myspace. Zuckerberg promised Myspace users a superior social media experience where they wouldn't be spied on or bombarded with ads:</p>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3247362\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3247362</a></p>\n<p>Zuckerberg knew that wouldn't be enough. No one was going to leave Myspace for Facebook and hang out in splendid isolation, smugly re-reading Facebook's world-beating privacy policy while waiting for their dopey friends to wise up and leave Myspace to come and join them.</p>\n<p>No: Zuckerberg gave the Myspace refugees a bot, which would accept your Myspace login and password and then impersonate you to Myspace's servers several times per day, scraping all the content waiting for you in your Myspace feed and flowing it into your Facebook feed. You could reply to it there and the bot would push it out to Myspace. You could eat your cake and have it too: use Facebook, but communicate with the people who were still on Myspace.</p>\n<p>This is called \"adversarial interoperability\" and it was once the norm, but the companies that rose to power by \"moving fast and breaking things\" went on to secure legal protections to prevent anyone from doing unto them as they had done unto their own predecessors:</p>\n<p><a href=\"https://www.eff.org/deeplinks/2019/10/adversarial-interoperability\">https://www.eff.org/deeplinks/2019/10/adversarial-interoperability</a></p>\n<p>The harder it is for people to leave a platform, the worse the platform can treat them without paying the penalty of losing users. This is the source of enshittification: when a company can move value from its users and customers to itself without risking their departure, it <em>does</em>.</p>\n<p>People stay on bad platforms because the value they provide to one another is greater than the costs the platform extracts from them. That means that when you see people stuck on a <em>very</em> bad platform &#8211; like Twitter, Instagram or Facebook &#8211; you should infer that what they get there from the people that matter to them is <em>really</em> important to them. They stick to platforms because that's where they meet with people who share their rare disease, because that's where they find the customers or audiences that they rely on to make rent; because that's the only place they can find the people they left behind when they emigrated.</p>\n<p>Now, it's entirely possible &#8211; likely, even &#8211; that legacy social media platforms will grow <em>so</em> terrible that people will leave and jettison those social connections that mean so much to them. <em>This is not a good outcome</em>. Those communities, once shattered, will likely never re-form. There will be <em>permanent</em>, <em>irretrievable</em> losses incurred by their members:</p>\n<p><a href=\"https://pluralistic.net/2023/07/23/when-the-town-square-shatters/\">https://pluralistic.net/2023/07/23/when-the-town-square-shatters/</a></p>\n<p>The platforms are sinking ships. We need to evacuate them:</p>\n<p><a href=\"https://pluralistic.net/2024/03/23/evacuate-the-platforms/#let-the-platforms-burn\">https://pluralistic.net/2024/03/23/evacuate-the-platforms/#let-the-platforms-burn</a></p>\n<p>\"If you build it, they will come\" is a trap. Technologists and their users who don't understand the pernicious nature of the collective active problem trap <em>themselves</em>. They build obviously superior technical platforms and then gnash their teeth as the rest of the world fails to make the leap.</p>\n<p>All too often, users' frustration at the failure of new services to slay the inferior legacy services curdles, and users and designers of new technologies decide that the people who won't join them are somehow <em>themselves</em> defective. It doesn't take long to find a corner of the Fediverse or Bluesky where Facebook and Twitter <em>users</em> are being condemned as morally suspect for staying on zuckermuskian media. They are damned for loving Zuckerberg and Musk, rather than empathized with for loving each other more than they hate the oligarchs who've trapped them. They're condemned as emotionally stunted \"attention whores\" who hang out on big platforms to get \"dopamine\" (or some other pseudoscientific reward), which is easier than grappling with the fact that legacy social media pays their bills, and tolerating Zuckerberg or Musk is preferable to getting evicted.</p>\n<p>Worst of all, condemning users of legacy technology as moral failures leads you to oppose efforts to get those users out of harm's way and onto modern platforms. Think of the outcry at Meta's Threads taking steps to federate with Mastodon. There are good reasons to worry about this &#8211; the best one being that it might allow Meta to (illegally) suck up Mastodon users' data and store and process it. But the majority of the opposition to Threads integration with Mastodon wasn't about Threads' <em>management</em> &#8211; it was about Threads' <em>users</em>. It posited a certain kind of moral defective who would use a Zuckerberg-controlled platform in the 2020s and insisted that those people would ruin Mastodon by bringing over their illegitimate social practices.</p>\n<p>I've made no secret of where I come down in this debate: the <em>owners</em> of legacy social media are my enemy, but the <em>users</em> of those platforms are my comrades, and I want to help them get shut of legacy social media as quickly and painlessly as possible.</p>\n<p>What's more, there's a way to make this happen! The same adversarial interoperability that served Zuckerberg so well when he was draining users off of Myspace could be used today to evacuate all of Meta's platforms. We could use a combination of on-device bridging, scraping and other guerrilla tactics to create \"alt clients\" that let you interact with people on Mastodon <em>and</em> the legacy platforms in one context, so that you can leave the bad services but keep the good people in your life.</p>\n<p>The major barrier to this isn't technological. Despite the boasts of these companies to world-beating engineering prowess, the reality that people (often teenagers) keep successfully finding and exploiting vulnerabilities in the \"impregnable\" platforms, in order to build successful alt clients:</p>\n<p><a href=\"https://pluralistic.net/2023/12/07/blue-bubbles-for-all/#never-underestimate-the-determination-of-a-kid-who-is-time-rich-and-cash-poor\">https://pluralistic.net/2023/12/07/blue-bubbles-for-all/#never-underestimate-the-determination-of-a-kid-who-is-time-rich-and-cash-poor</a></p>\n<p>The thing that eventually sees off these alt clients isn't Big Tech's technical countermeasures &#8211; it's legal risk. A global system of \"anticircumvention\" laws makes the kinds of basic reverse-engineering associated with building and maintaining using adversarial interoperability <em>radioactively</em> illegal. These laws didn't appear out of thin air, either: the US Trade Representative pressured all of America's trading partners into passing them:</p>\n<p><a href=\"https://pluralistic.net/2024/11/15/radical-extremists/#sex-pest\">https://pluralistic.net/2024/11/15/radical-extremists/#sex-pest</a></p>\n<p>Which brings me back to crises precipitating change. Trump has staged an unscheduled, sudden, midair disassembly of the global system of trade, whacking tariffs on every country in the world, even in defiance of the Supreme Court:</p>\n<p><a href=\"https://www.bbc.co.uk/news/articles/cd6zn3ly22yo\">https://www.bbc.co.uk/news/articles/cd6zn3ly22yo</a></p>\n<p>Ironically, this has only helped make the case for adversarial interoperability. Trump is using tech companies to attack his geopolitical rivals, ordering Microsoft to shut down both the International Criminal Court and a Brazilian high court in retaliation for their pursuit of the criminal dictators Benjamin Netanyahu and Jair Bolsonaro. This means that Trump has violated the <em>quid pro quo</em> deal for keeping anticircumvention law on your statute books, and he has made the case for killing anticircumvention as quickly as possible in order to escape American tech platforms before they are weaponized against you:</p>\n<p><a href=\"https://pluralistic.net/2026/01/29/post-american-canada/#ottawa\">https://pluralistic.net/2026/01/29/post-american-canada/#ottawa</a></p>\n<p>I've been talking about this for more than a year now, and I must say, the reception has been better than I dared dream. I think that &#8211; for the first time in my adult life &#8211; we are on the verge of creating a new, good, billionaire-proof internet:</p>\n<p><a href=\"https://pluralistic.net/2026/01/15/how-the-light-gets-in/\">https://pluralistic.net/2026/01/15/how-the-light-gets-in/</a></p>\n<p>But there's one objection that keeps coming up: \"What if this makes Trump mad?\" Or, more specifically, \"What if this makes Trump <em>more</em> mad, so instead of hitting us with a 10% tariff, it's a 1,000% tariff?</p>\n<p>This came up earlier this week, when I gave a remote keynote for the Fedimtl conference, and an audience member said that he thought we should just focus on building good new platforms, rather than risking Trump's ire. In my response, I recited the arguments I've raised in this piece.</p>\n<p>But yesterday, I saw a news item that made me realize there was one more argument I should have made, but missed. It was a Reuters story about Trump ordering American diplomats to fight against \"data sovereignty\" policies around the world:</p>\n<p><a href=\"https://www.reuters.com/sustainability/boards-policy-regulation/us-orders-diplomats-fight-data-sovereignty-initiatives-2026-02-25/\">https://www.reuters.com/sustainability/boards-policy-regulation/us-orders-diplomats-fight-data-sovereignty-initiatives-2026-02-25/</a></p>\n<p>The news comes from a leaked diplomatic cable, and it's a reminder that Trump's goal is to maintain American dominance of the world's technology and to prevent the formation of a post-American internet altogether. Worrying that Trump will hit you with more tariffs if you legalize jailbreaking assumes that the thing that would upset Trump is that you <em>broke the rules</em>.</p>\n<p>That's not what makes Trump angry.</p>\n<p>What makes Trump angry is <em>losing</em>.</p>\n<p>Say you focus exclusively on building superior platforms. Say by some miracle that everyone you care about somehow overcomes the collective action problems and high switching costs and leaves behind US Big Tech services and comes to your new, federated, cleantech, post-American alternative.</p>\n<p>Do you think that Trump will observe this collapse in the fortunes of the most important corporations in his coalition and shrug and say, \"Well, I guess I lost fair and square; better luck next time?\"</p>\n<p><em>Hell, no</em>. We already know what Trump does when his corporate allies lose to a superior foreign rival &#8211; <em>Trump steals the rival's service and gives it to one of his cronies</em>. That's literally what he <em>last month</em>, to Tiktok:</p>\n<p><a href=\"https://www.democracynow.org/2026/1/23/headlines/larry_ellisons_oracle_part_of_new_deal_to_own_us_version_of_tiktok\">https://www.democracynow.org/2026/1/23/headlines/larry_ellisons_oracle_part_of_new_deal_to_own_us_version_of_tiktok</a></p>\n<p>The fear of harsh retaliation for any country that dares to be a Disenshittification Nation is based on the premise that Trump is motivated by a commitment to <em>fairness</em>. He's not: Trump is motivated by a desire to <em>dominate</em>. Anything that threatens the dominance of the companies that take his orders is fair game, and he will retaliate in any way he can.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Organized Labor Took a Huge Step Forward When GM Workers Sat Down in Unison in 1937 <a href=\"https://www.smithsonianmag.com/history/organized-labor-took-huge-step-forward-when-GM-workers-sat-down-unison-1937-180988089/\">https://www.smithsonianmag.com/history/organized-labor-took-huge-step-forward-when-GM-workers-sat-down-unison-1937-180988089/</a></p>\n</li>\n<li>\n<p>How to Tax Billionaires <a href=\"https://prospect.org/2026/02/24/tax-billionaires-california-income-inequality-trump-billionaires-trillionaires/\">https://prospect.org/2026/02/24/tax-billionaires-california-income-inequality-trump-billionaires-trillionaires/</a></p>\n</li>\n<li>\n<p>“Battered, bedraggled, inexplicably enthusiastic about a bargain flight to Bermuda” <a href=\"https://unsung.aresluna.org/battered-bedraggled-inexplicably-enthusiastic-about-a-bargain-flight-to-bermuda/\">https://unsung.aresluna.org/battered-bedraggled-inexplicably-enthusiastic-about-a-bargain-flight-to-bermuda/</a></p>\n</li>\n<li>\n<p>Understanding the L L M Bubble <a href=\"https://img1.wsimg.com/blobby/go/76c5f9c0-d1a4-4493-b204-bbbdd68fd910/downloads/89583079-d8c1-483f-8988-3c9f5d813d89/HoranAAJ2026LLMbubble.pdf?ver=1771954468213\">https://img1.wsimg.com/blobby/go/76c5f9c0-d1a4-4493-b204-bbbdd68fd910/downloads/89583079-d8c1-483f-8988-3c9f5d813d89/HoranAAJ2026LLMbubble.pdf?ver=1771954468213</a></p>\n</li>\n<li>\n<p>Actually, the left is winning the AI debate <a href=\"https://www.bloodinthemachine.com/p/actually-the-left-is-winning-the\">https://www.bloodinthemachine.com/p/actually-the-left-is-winning-the</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#retro\">permalink</a>)</h1>\n<p>#20yrsago Florida cops threaten people who ask for complaint forms <a href=\"https://web.archive.org/web/20060218125443/http://cbs4.com/topstories/local_story_033170755.html\">https://web.archive.org/web/20060218125443/http://cbs4.com/topstories/local_story_033170755.html</a></p>\n<p>#20yrsago SF editor: watermarks hurt artists and reward megacorps <a href=\"https://web.archive.org/web/20060307172130/http://www.kathryncramer.com/kathryn_cramer/2006/02/watermarking_as.html\">https://web.archive.org/web/20060307172130/http://www.kathryncramer.com/kathryn_cramer/2006/02/watermarking_as.html</a></p>\n<p>#15yrsago HarperCollins to libraries: we will nuke your ebooks after 26 checkouts <a href=\"https://memex.craphound.com/2011/02/25/harpercollins-to-libraries-we-will-nuke-your-ebooks-after-26-checkouts/\">https://memex.craphound.com/2011/02/25/harpercollins-to-libraries-we-will-nuke-your-ebooks-after-26-checkouts/</a></p>\n<p>#15yrsago Slowly fuming used bookstore clerk seethings <a href=\"https://web.archive.org/web/20110224180817/http://blogs.sfweekly.com/exhibitionist/2011/02/this_is_why_your_used_bookstor.php\">https://web.archive.org/web/20110224180817/http://blogs.sfweekly.com/exhibitionist/2011/02/this_is_why_your_used_bookstor.php</a></p>\n<p>#15yrsago Rothfuss pledges to buy Firefly from Fox and give it away <a href=\"https://blog.patrickrothfuss.com/2011/02/an-open-letter-to-nathan-fillion/\">https://blog.patrickrothfuss.com/2011/02/an-open-letter-to-nathan-fillion/</a></p>\n<p>#10yrsago Disney offers to deduct contributions to its PAC from employees’ paychecks, to lobby for TPP <a href=\"https://arstechnica.com/tech-policy/2016/02/disney-ceo-asks-employees-to-chip-in-to-pay-copyright-lobbyists/\">https://arstechnica.com/tech-policy/2016/02/disney-ceo-asks-employees-to-chip-in-to-pay-copyright-lobbyists/</a></p>\n<p>#10yrsago Read: The full run of If magazine, scanned at the Internet Archive <a href=\"https://archive.org/details/ifmagazine\">https://archive.org/details/ifmagazine</a></p>\n<p>#10yrsago Rosa Parks’s papers and photos online at the Library of Congress <a href=\"https://www.youtube.com/watch?v=266gn07TUYw\">https://www.youtube.com/watch?v=266gn07TUYw</a></p>\n<p>#10yrsago Harvard Business Review: Stop paying executives for performance <a href=\"https://hbr.org/2016/02/stop-paying-executives-for-performance\">https://hbr.org/2016/02/stop-paying-executives-for-performance</a></p>\n<p>#5yrsago Saving the planet is illegal <a href=\"https://pluralistic.net/2021/02/25/ring-down-the-curtain/#ect\">https://pluralistic.net/2021/02/25/ring-down-the-curtain/#ect</a></p>\n<p>#5yrsago Against hygiene theater <a href=\"https://pluralistic.net/2021/02/25/ring-down-the-curtain/#hygiene-theater\">https://pluralistic.net/2021/02/25/ring-down-the-curtain/#hygiene-theater</a></p>\n<p>#1yrago Apple's encryption capitulation <a href=\"https://pluralistic.net/2025/02/25/sneak-and-peek/#pavel-chekov\">https://pluralistic.net/2025/02/25/sneak-and-peek/#pavel-chekov</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Oslo (remote): Seminar og lansering av rapport om «enshittification», Feb 27<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Montreal: Bronfman Lecture (McGill) Apr 10<br />\n<a href=\"https://www.eventbrite.ca/e/artificial-intelligence-the-ultimate-disrupter-tickets-1982706623885\">https://www.eventbrite.ca/e/artificial-intelligence-the-ultimate-disrupter-tickets-1982706623885</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#recent\">permalink</a>)</h1>\n<ul>\n<li>Making The Internet Suck Less (Thinking With Mitch Joel)<br />\n<a href=\"https://www.sixpixels.com/podcast/archives/making-the-internet-suck-less-with-cory-doctorow-twmj-1024/\">https://www.sixpixels.com/podcast/archives/making-the-internet-suck-less-with-cory-doctorow-twmj-1024/</a></p>\n</li>\n<li>\n<p>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/26/hanged-for-a-sheep/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1055 words today, 38245 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links If you build it (and it works), Trump will come (and take it): Trump wants Big Tech to win, not to play fair. Hey look at this: Delights to delectate. Object permanence: Harpercollins v libraries; Rothfuss x Firefly; Bookseller seethings; If magazine; HBR v executive pay; Apple caves on encryption. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em.",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Thu, 26 Feb 2026 10:51:25 +0000",
    "fetched_at": "2026-02-26T12:22:49.107974",
    "url_hash": "aca8282e74934cc8b5d3524618a72f46"
  },
  {
    "title": "Hyperbolic versions of latest posts",
    "link": "https://www.johndcook.com/blog/2026/02/25/hyperbolic-versions-of-latest-posts/",
    "content": "<p>The post <a href=\"https://www.johndcook.com/blog/2026/02/24/a-curious-trig-identity/\">A curious trig identity</a> contained the theorem that for real <em>x</em> and <em>y</em>,</p>\n<p><img decoding=\"async\" class=\"aligncenter\" src=\"https://www.johndcook.com/robinson1.svg\" alt=\"|\\sin(x + iy)| = |\\sin x + \\sin iy|\" width=\"237\" height=\"18\" /></p>\n<p>This theorem also holds when sine is replaced with hyperbolic sine.</p>\n<p>The post <a href=\"https://www.johndcook.com/blog/2026/02/25/trig-of-inverse-trig/\">Trig of inverse trig</a> contained a table summarizing trig functions applied to inverse trig functions. You can make a very similar table for the hyperbolic counterparts.</p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/hyp_mult_table.svg\" width=\"348\" height=\"220\" /></p>\n<p>The following Python code doesn&#8217;t prove that the entries in the table are correct, but it likely would catch typos.</p>\n<pre>    from math import *\n\n    def compare(x, y):\n        print(abs(x - y) &lt; 1e-12)\n\n    for x in [2, 3]:\n        compare(sinh(acosh(x)), sqrt(x**2 - 1))\n        compare(cosh(asinh(x)), sqrt(x**2 + 1))\n        compare(tanh(asinh(x)), x/sqrt(x**2 + 1))\n        compare(tanh(acosh(x)), sqrt(x**2 - 1)/x)                \n    for x in [0.1, -0.2]:\n        compare(sinh(atanh(x)), x/sqrt(1 - x**2))\n        compare(cosh(atanh(x)), 1/sqrt(1 - x**2)) \n</pre>\n<p><strong>Related post</strong>: <a href=\"https://www.johndcook.com/blog/2024/08/20/osborn-rule/\">Rule for converting trig identities into hyperbolic identities</a></p>The post <a href=\"https://www.johndcook.com/blog/2026/02/25/hyperbolic-versions-of-latest-posts/\">Hyperbolic versions of latest posts</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "The post A curious trig identity contained the theorem that for real x and y, This theorem also holds when sine is replaced with hyperbolic sine. The post Trig of inverse trig contained a table summarizing trig functions applied to inverse trig functions. You can make a very similar table for the hyperbolic counterparts. The following Python [&#8230;] The post Hyperbolic versions of latest posts first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Thu, 26 Feb 2026 01:10:37 +0000",
    "fetched_at": "2026-02-26T12:23:08.802181",
    "url_hash": "d3fd9c68c371f6d4d65c27ce90df5f9e"
  },
  {
    "title": "Against Query Based Compilers",
    "link": "https://matklad.github.io/2026/02/25/against-query-based-compilers.html",
    "content": "\n<header>\n  <h1>Against Query Based Compilers</h1>\n  <time class=\"meta\" datetime=\"2026-02-25\">Feb 25, 2026</time>\n</header>\n<p><a href=\"https://thunderseethe.dev/posts/compiler-education-deserves-a-revoluation/\">Query based compilers are all the rage</a>\nthese days, so it feels only appropriate to chart some treacherous shoals in those waters.</p>\n<p>A query-based compiler is a straightforward application of the idea of incremental computations to,\nyou guessed it, compiling. A compiler is just a simple text transformation program, implemented as a\nlot of functions. You could visualize a <em>run</em> of a compiler on a particular input source code as a\ngraph of function calls:</p>\n\n<figure>\n\n<img alt=\"\" src=\"/assets/2026-02-25-against-query-based-compilers/1.svg\">\n</figure>\n<p>Here, schematically, squares are inputs like file text or compiler’s command line arguments, <code>g</code> is\nan intermediate function (e.g, type checking), which is called twice, with different arguments, and\n<code>f</code> and <code>h</code> are top-level functions (compile executable, or compute completions for LSP).</p>\n<p>Looking at this picture, it’s obvious how to make our compiler “incremental” — if an input changes,\nit’s enough to re-compute only the results on path from the changed input to the root “query”:</p>\n\n<figure>\n\n<img alt=\"\" src=\"/assets/2026-02-25-against-query-based-compilers/2.svg\">\n</figure>\n<p>A little more thinking, and you can derive “early cutoff” optimization:</p>\n\n<figure>\n\n<img alt=\"\" src=\"/assets/2026-02-25-against-query-based-compilers/3.svg\">\n</figure>\n<p>If an input to the function changes, but its result doesn’t (e.g, function type is not affected by\nwhitespace change), you can stop change propagation early.</p>\n<p>And that’s … basically it. The beauty of the scheme is its silvery-bullety hue — it can be\napplied without thinking to any computation, and, with a touch of meta programming, you won’t even\nhave to change code of the compiler significantly.</p>\n<p><a href=\"https://simon.peytonjones.org/assets/pdfs/build-systems-jfp.pdf\"><em>Build Systems à la Carte</em></a> is the\ncanonical paper to read here. In a build system, a query is an opaque process whose inputs and\noutputs are file. In a query-based compiler, queries are just functions.</p>\n<hr>\n<p>The reason why we want this in the first place is incremental compilation — in IDE context\nspecifically, the compiler needs to react to a stream of tiny edits, and its time budget is about\n100ms. Big-O thinking is useful here: the time to react to the change should be proportional to the\nsize of the change, and not the overall size of the codebase. O(1) change leads to O(1) update\nof the O(N) codebase.</p>\n<p>Similar big-O thinking also demonstrates the principal limitation of the scheme — the update work\ncan’t be smaller than the change in the result.</p>\n<p>An example. Suppose our “compiler” makes a phrase upper-case:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">compile(&quot;hello world&quot;) == &quot;HELLO WORLD&quot;</span></code></pre>\n\n</figure>\n<p>This is easy to incrementalize, as changing a few letters in the input changes only a few letters in\nthe output:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">compile(&quot;hallo world&quot;) == &quot;HALLO WORLD&quot;</span></code></pre>\n\n</figure>\n<p>But suppose now our “compiler” is a hashing or encryption function:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">compile(&quot;hello world&quot;) == &quot;a948904f2f0&quot;</span>\n<span class=\"line\">compile(&quot;hallo world&quot;) == &quot;a7336983eca&quot;</span></code></pre>\n\n</figure>\n<p>This is provably impossible to make usefully incremental. The encryption <em>can</em> be implemented\nas a graph of function calls, and you <em>can</em> apply the general incremental recipe to it. It just\nwon’t be very fast.</p>\n<p>The reason for that is the avalanche property — for good encryption, a change in any bit of input\nshould flip roughly half of the bits of the output. So just the work of changing the output\n(completely ignoring the work to compute what needs to be changed) is O(N), not O(1).</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>The effectiveness of query-based compiler is limited by\nthe dependency structure of the source language.</p>\n</blockquote>\n\n</figure>\n<p>A particularly nasty effect here is that even if you have only <em>potential</em> avalanche, where a\ncertain kind of change <em>could</em> affect large fraction of the output, even if it usually doesn’t, your\nincremental engine likely will spend some CPU time or memory to confirm the absence of dependency.</p>\n<hr>\n<p>In my</p>\n<p><span class=\"display\"><a href=\"https://rust-analyzer.github.io/blog/2020/07/20/three-architectures-for-responsive-ide.html\"><em>Three Architectures For Responsive IDE</em></a>,</span>\nquery-based compilation is presented as a third, fall-back option. I still think that that’s\nbasically true: as a language designer, I think it’s worth listening to your inner\n<a href=\"https://grugbrain.dev\">Grug</a> and push the need for queries as far down the compilation pipeline as\npossible, sticking to more direct approaches. <em>Not</em> doing queries is simpler, faster, and simpler to\nmake faster (profiling a query-based compiler is a special genre of hurdle racing).</p>\n<p>Zig and Rust provide for a nice comparison. In Zig, every file can be parsed completely in\nisolation, so compilation starts by parsing all files independently and in parallel. Because in Zig\nevery name needs to be explicitly declared (there’s no <code>use *</code>), name resolution also can run on a\nper-file basis, without queries. Zig goes even further, and directly converts untyped AST into IR,\nemitting a whole bunch of errors in the process (e.g, “<code>var</code> doesn’t need to be mutable”). See\n<span class=\"display\"><a href=\"https://mitchellh.com/zig/astgen\"><em>Zig AstGen: AST =&gt; ZIR</em></a></span>\nfor details. By the time compiler gets to tracked queries, the data it has to work with is already\npretty far from the raw source code, but only because Zig <em>language</em> is carefully designed to allow\nthis.</p>\n<p>In contrast, you can’t really parse a file in Rust. Rust macros generate new source code, so parsing\ncan’t be finished until all the macros are expanded. Expanding macros requires name resolution,\nwhich, in Rust, is a crate-wide, rather than a file-wide operation. Its a fundamental property of\nthe language that typing something in <code>a.rs</code> can change parsing results for <code>b.rs</code>, and that forces\nfine-grained dependency tracking and invalidation to the very beginning of the front-end.</p>\n<p>Similarly, the nature of the trait system is such that <code>impl</code> blocks relevant to a particular method\ncall can be found almost anywhere. For every trait method call, you get a dependency on the <code>impl</code>\nblock that supplies the implementation, but you <em>also</em> get a dependency on non-existence of\nconflicting <code>impl</code>s in every other file!</p>\n<p>Again, refer to the\n<a href=\"https://rust-analyzer.github.io/blog/2020/07/20/three-architectures-for-responsive-ide.html\"><em>Three Architectures</em></a>\nfor positive ideas, but the general trick is to leverage language semantics to manually cut the\ncompilation tasks into somewhat coarse-grained chunks which are independent by definition (of the\nsource language). Grug builds an incremental map-reduce compiler for his language:</p>\n<ul>\n<li>\n<p>Recursive directory walk finds all files to be compiled.</p>\n</li>\n<li>\n<p>In parallel, independently, each file is parsed, name-resolved, and lowered. As much as possible,\nlanguage features (and errors) are syntax driven and not type driven, and can be processed at this\nstage.</p>\n</li>\n<li>\n<p>In parallel, a “summary” is extracted from each file, which is essentially just a list of types\nand signatures, with function bodies empty.</p>\n</li>\n<li>\n<p>Sequentially, a “signature evaluation” phase is run on this set of summaries, which turns type\nreferences in signatures into actual types, dealing with mutual dependencies between files. This\nphase is re-run whenever a summary of a file changes. Conversely, changes to the body of any\nfunction do not invalidate resolved signatures.</p>\n</li>\n<li>\n<p>In parallel, every function’s body is type-checked, and lowered to type-and-layout resolved IR,\napplying function-local optimizations.</p>\n</li>\n<li>\n<p>Sequentially, a thin-lto style set of analyses are run on compiled functions, making inlining\ndecisions and computing call-graph dependent attributes like function purity.</p>\n</li>\n<li>\n<p>In parallel, each function is codegened to machine code with unresolved references to other\nfunctions (relocations).</p>\n</li>\n<li>\n<p>Sequentially, functions are concatenated into an executable file, receiving an address.</p>\n</li>\n<li>\n<p>In parallel, all relocations are resolved to now known addresses.</p>\n</li>\n</ul>\n<p>The above scheme works only if the language has a property that changing the body of function <code>foo</code>\n(not touching its signature) can’t introduce type errors into an unrelated function <code>bar</code>.</p>\n<hr>\n<p>Another trick that becomes less available if you blindly apply queries are in-place updates.\nConsider a language with package declarations and fully qualified names, like Kotlin:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">package</span> org.example</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-function\"><span class=\"hl-keyword\">fun</span> <span class=\"hl-title\">printMessage</span><span class=\"hl-params\">()</span></span> { <span class=\"hl-comment\">/*...*/</span> }</span>\n<span class=\"line\"><span class=\"hl-keyword\">class</span> <span class=\"hl-title class_\">Message</span> { <span class=\"hl-comment\">/*...*/</span> }</span></code></pre>\n\n</figure>\n<p>A compiler for this language probably wants to maintain a map of all public declarations, where the\nkeys are fully qualified names, and values are declarations themselves. If you approach the problem\nof computing this map with query eyes, you might have a base per-file query that returns a map of\nfile’s declarations, and then a recursive per-directory query. And you’ll probably have some kind of\nstructural sharing of the maps, such that changing a single file updates only the “spine”, without\nactually copying most of the other entries.</p>\n<p>But there’s a more direct way to make this sort of structure responsive to changes. You need only\ntwo “queries” — per file, and global. When a file changes, you look at the <em>previous</em> version of\nthe map for this file, compute a diff of added or removed declarations, and then apply this diff to\nthe global map.</p>\n<p>Zig is planning to use a similar approach to incrementalize linking — rather than producing a new\nbinary gluing mostly unchanged chunks of machine code, the idea is to in-place patch the previous\nbinary.</p>\n<hr>\n<p>If you like this article, you might be interested in some other adjacent stuff I’ve written over the\nyears, roughly in the order of importance:</p>\n<ul>\n<li>\n<a href=\"https://rust-analyzer.github.io/blog/2020/07/20/three-architectures-for-responsive-ide.html\" class=\"url\">https://rust-analyzer.github.io/blog/2020/07/20/three-architectures-for-responsive-ide.html</a>\n</li>\n<li>\n<a href=\"https://rust-analyzer.github.io/blog/2023/07/24/durable-incrementality.html\" class=\"url\">https://rust-analyzer.github.io/blog/2023/07/24/durable-incrementality.html</a>\n</li>\n<li>\n<a href=\"https://matklad.github.io/2023/05/06/zig-language-server-and-cancellation.html\" class=\"url\">https://matklad.github.io/2023/05/06/zig-language-server-and-cancellation.html</a>\n</li>\n<li>\n<a href=\"https://matklad.github.io/2023/05/21/resilient-ll-parsing-tutorial.html\" class=\"url\">https://matklad.github.io/2023/05/21/resilient-ll-parsing-tutorial.html</a>\n</li>\n<li>\n<a href=\"https://rust-analyzer.github.io/blog/2019/11/13/find-usages.html\" class=\"url\">https://rust-analyzer.github.io/blog/2019/11/13/find-usages.html</a>\n</li>\n<li>\n<a href=\"https://rust-analyzer.github.io/blog/2023/12/26/the-heart-of-a-language-server.html\" class=\"url\">https://rust-analyzer.github.io/blog/2023/12/26/the-heart-of-a-language-server.html</a>\n</li>\n<li>\n<a href=\"https://rust-analyzer.github.io/blog/2020/09/28/how-to-make-a-light-bulb.html\" class=\"url\">https://rust-analyzer.github.io/blog/2020/09/28/how-to-make-a-light-bulb.html</a>\n</li>\n<li>\n<a href=\"https://matklad.github.io/2023/10/12/lsp-could-have-been-better.html\" class=\"url\">https://matklad.github.io/2023/10/12/lsp-could-have-been-better.html</a>\n</li>\n<li>\n<a href=\"https://matklad.github.io/2023/08/01/on-modularity-of-lexical-analysis.html\" class=\"url\">https://matklad.github.io/2023/08/01/on-modularity-of-lexical-analysis.html</a>\n</li>\n<li>\n<a href=\"https://matklad.github.io/2020/11/11/yde.html\" class=\"url\">https://matklad.github.io/2020/11/11/yde.html</a>\n</li>\n</ul>\n",
    "description": "Query based compilers are all the ragethese days, so it feels only appropriate to chart some treacherous shoals in those waters.",
    "is_fulltext": true,
    "source": "matklad",
    "pub_date": "2026-02-25T00:00:00+00:00",
    "fetched_at": "2026-02-26T12:23:10.361568",
    "url_hash": "b2f45cec4a3116cf383396a5a75c2230"
  },
  {
    "title": "Members Only: Your anonymity set has collapsed and you don't know it yet",
    "link": "https://www.joanwestenberg.com/members-only-your-anonymity-set-has-collapsed-and-you-dont-know-it-yet/",
    "content": "",
    "description": "",
    "is_fulltext": false,
    "source": "Westenberg.",
    "pub_date": "Thu, 26 Feb 2026 01:41:29 GMT",
    "fetched_at": "2026-02-26T12:23:13.672780",
    "url_hash": "b18cbe740496836bebe2183f964b571a"
  },
  {
    "title": "Git in Postgres",
    "link": "https://nesbitt.io/2026/02/26/git-in-postgres.html",
    "content": "<p>In December I wrote about <a href=\"/2025/12/24/package-managers-keep-using-git-as-a-database.html\">package managers using git as a database</a>, and how Cargo’s index, Homebrew’s taps, Go’s module proxy, and CocoaPods’ Specs repo all hit the same wall once their access patterns outgrew what a git repo is designed for.</p>\n\n<p><a href=\"https://github.com/Homebrew/homebrew-core\">homebrew-core</a> has one Ruby file per package formula, and every <code class=\"language-plaintext highlighter-rouge\">brew update</code> used to clone or fetch the whole repository until it got large enough that <a href=\"https://github.com/Homebrew/brew/pull/9383\">GitHub explicitly asked them to stop</a>. Homebrew 4.0 switched to downloading a JSON file over HTTP, because users wanted the current state of a package rather than its commit history. But updating a formula still means opening a pull request against homebrew-core, because git is where the collaboration tooling lives. Instead of using git as a database, what if you used a database as a git?</p>\n\n<p>A git repository is a content-addressable object store where objects go in indexed by the SHA1 of their content, plus a set of named references pointing at specific objects by hash. The on-disk format (loose objects as individual files, packfiles as delta-compressed archives with a separate index, a ref store split between a directory of files and a packed-refs flat file with a locking protocol that breaks on NFS) is an implementation detail. The protocol for synchronising objects and refs between repositories is what actually matters, and since git-the-program is just one implementation of it, you can swap the storage backend without clients noticing.</p>\n\n<p>The whole data model fits in two tables:</p>\n\n<div class=\"language-sql highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"k\">CREATE</span> <span class=\"k\">TABLE</span> <span class=\"n\">objects</span> <span class=\"p\">(</span>\n    <span class=\"n\">repo_id</span>  <span class=\"nb\">integer</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"n\">oid</span>      <span class=\"n\">bytea</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"k\">type</span>     <span class=\"nb\">smallint</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"k\">size</span>     <span class=\"nb\">integer</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"n\">content</span>  <span class=\"n\">bytea</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"k\">PRIMARY</span> <span class=\"k\">KEY</span> <span class=\"p\">(</span><span class=\"n\">repo_id</span><span class=\"p\">,</span> <span class=\"n\">oid</span><span class=\"p\">)</span>\n<span class=\"p\">);</span>\n\n<span class=\"k\">CREATE</span> <span class=\"k\">TABLE</span> <span class=\"n\">refs</span> <span class=\"p\">(</span>\n    <span class=\"n\">repo_id</span>  <span class=\"nb\">integer</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"n\">name</span>     <span class=\"nb\">text</span> <span class=\"k\">NOT</span> <span class=\"k\">NULL</span><span class=\"p\">,</span>\n    <span class=\"n\">oid</span>      <span class=\"n\">bytea</span><span class=\"p\">,</span>\n    <span class=\"n\">symbolic</span> <span class=\"nb\">text</span><span class=\"p\">,</span>\n    <span class=\"k\">PRIMARY</span> <span class=\"k\">KEY</span> <span class=\"p\">(</span><span class=\"n\">repo_id</span><span class=\"p\">,</span> <span class=\"n\">name</span><span class=\"p\">)</span>\n<span class=\"p\">);</span>\n</code></pre></div></div>\n\n<p>An object’s OID is computed the same way git does it, <code class=\"language-plaintext highlighter-rouge\">SHA1(\"&lt;type&gt; &lt;size&gt;\\0&lt;content&gt;\")</code>, using pgcrypto’s <code class=\"language-plaintext highlighter-rouge\">digest()</code> function, and refs get compare-and-swap updates through <code class=\"language-plaintext highlighter-rouge\">SELECT FOR UPDATE</code>. A libgit2 backend registers these tables as its storage layer, and if the protocol really is separable from the format, a normal git client should be able to push to and clone from a Postgres database without knowing the difference.</p>\n\n<p>To test this I built <a href=\"https://github.com/andrew/gitgres\">gitgres</a>, about 2,000 lines of C implementing the libgit2 <code class=\"language-plaintext highlighter-rouge\">git_odb_backend</code> and <code class=\"language-plaintext highlighter-rouge\">git_refdb_backend</code> interfaces against Postgres through libpq, plus roughly 200 lines of PL/pgSQL for the storage functions. libgit2 handles pack negotiation, delta resolution, ref advertisement, and the transport protocol while the backend reads and writes against the two tables, and a git remote helper (<code class=\"language-plaintext highlighter-rouge\">git-remote-gitgres</code>) lets you add a Postgres-backed remote to any repo and push or clone with a normal git client that has no idea it’s talking to a database. There’s a Dockerfile in the repo if you want to try it out without building libgit2 and libpq from source.</p>\n\n<p>The objects table contains the same bytes git would store on disk, and a set of SQL functions parse them into tree entries, commit metadata, and parent links that you can join against like any other table.</p>\n\n<div class=\"language-sql highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"k\">SELECT</span> <span class=\"n\">r</span><span class=\"p\">.</span><span class=\"n\">name</span> <span class=\"k\">AS</span> <span class=\"n\">repo</span><span class=\"p\">,</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">author_name</span><span class=\"p\">,</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">authored_at</span><span class=\"p\">,</span> <span class=\"n\">i</span><span class=\"p\">.</span><span class=\"n\">title</span> <span class=\"k\">AS</span> <span class=\"n\">issue</span>\n<span class=\"k\">FROM</span> <span class=\"n\">commits</span> <span class=\"k\">c</span>\n<span class=\"k\">JOIN</span> <span class=\"n\">repositories</span> <span class=\"n\">r</span> <span class=\"k\">ON</span> <span class=\"n\">r</span><span class=\"p\">.</span><span class=\"n\">id</span> <span class=\"o\">=</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">repo_id</span>\n<span class=\"k\">JOIN</span> <span class=\"n\">issues</span> <span class=\"n\">i</span> <span class=\"k\">ON</span> <span class=\"n\">i</span><span class=\"p\">.</span><span class=\"n\">repo_id</span> <span class=\"o\">=</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">repo_id</span>\n  <span class=\"k\">AND</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">message</span> <span class=\"k\">ILIKE</span> <span class=\"s1\">'%#'</span> <span class=\"o\">||</span> <span class=\"n\">i</span><span class=\"p\">.</span><span class=\"k\">index</span> <span class=\"o\">||</span> <span class=\"s1\">'%'</span>\n<span class=\"k\">WHERE</span> <span class=\"k\">c</span><span class=\"p\">.</span><span class=\"n\">authored_at</span> <span class=\"o\">&gt;</span> <span class=\"n\">now</span><span class=\"p\">()</span> <span class=\"o\">-</span> <span class=\"n\">interval</span> <span class=\"s1\">'30 days'</span><span class=\"p\">;</span>\n</code></pre></div></div>\n\n<p>That query joins git commit data against Forgejo’s issue tracker, something that currently requires fetching commits through <code class=\"language-plaintext highlighter-rouge\">git log</code>, pattern-matching issue references in application code, and then querying the database for the matching issues. With both sides in Postgres it’s one query.</p>\n\n<h3 id=\"forgejo\">Forgejo</h3>\n\n<p>A self-hosted Forgejo or Gitea instance is really two systems bolted together: a web application backed by Postgres, and a collection of bare git repositories on the filesystem. Anything that needs to show git data in the web UI has to shell out to the binary and parse text, which is why something as straightforward as a blame view requires spawning a subprocess rather than running a query. If the git data lived in the same Postgres instance as everything else, that boundary disappears.</p>\n\n<p>Forgejo stores issues, pull requests, users, permissions, webhooks, branch protection rules, and CI status in Postgres already, and git repositories are the one thing left on the filesystem, forcing every deployment to coordinate backups between them, and the two systems scale and fail in different ways. The codebase already shows the strain: Forgejo mirrors branch metadata from git into its own database tables (<code class=\"language-plaintext highlighter-rouge\">models/git/branch.go</code>) so it can query branches without shelling out to git every time.</p>\n\n<p>All git interaction goes through <code class=\"language-plaintext highlighter-rouge\">modules/git</code>, about 15,000 lines of Go that shells out to the <code class=\"language-plaintext highlighter-rouge\">git</code> binary and parses text output. With git data in Postgres, reading an object becomes <code class=\"language-plaintext highlighter-rouge\">SELECT content FROM objects WHERE oid = $1</code> on the database connection Forgejo already holds, and walking commit history is a query against a materialized view rather than spawning <code class=\"language-plaintext highlighter-rouge\">git log</code>.</p>\n\n<p>The deployment collapses to a single Postgres instance where <code class=\"language-plaintext highlighter-rouge\">pg_dump</code> backs up forge metadata, git objects, and user data together, and replicas handle read scaling for the web UI without NFS mounts or a Gitaly-style RPC layer. The path there is a Forgejo fork replacing <code class=\"language-plaintext highlighter-rouge\">modules/git</code> with a package that queries Postgres, where <code class=\"language-plaintext highlighter-rouge\">Repository</code> holds a database connection and repo_id instead of a filesystem path and <code class=\"language-plaintext highlighter-rouge\">Commit</code>, <code class=\"language-plaintext highlighter-rouge\">Tree</code>, <code class=\"language-plaintext highlighter-rouge\">Blob</code> become thin wrappers around query results.</p>\n\n<h3 id=\"postgres\">Postgres</h3>\n\n<p>Postgres has its own primitives for things that forges currently build custom infrastructure around. A trigger on the refs table firing <code class=\"language-plaintext highlighter-rouge\">NOTIFY</code> means any connected client learns about a push the moment it happens, which is how forges normally end up building a custom webhook polling layer. Multi-tenant repo isolation becomes a database concern through row-level security on the objects and refs tables, and logical replication lets you selectively stream repositories across Postgres instances, a kind of partial mirroring that filesystem-based git can’t do. Commit graph traversal for ancestry queries and merge-base computation falls to recursive CTEs, and <code class=\"language-plaintext highlighter-rouge\">pg_trgm</code> indexes on blob content give you substring search across all repositories without standing up a separate search index.</p>\n\n<h3 id=\"diff-merge-blame\">Diff, merge, blame</h3>\n\n<p>Content-level diffs, three-way merge, and blame stay in libgit2 rather than being reimplemented in SQL, since libgit2 already has that support and works against the Postgres backends through cgo bindings. The Forgejo fork would be “replace <code class=\"language-plaintext highlighter-rouge\">modules/git</code> with libgit2 backed by Postgres” rather than “replace <code class=\"language-plaintext highlighter-rouge\">modules/git</code> with raw SQL,” because the read-side queries only cover the simple cases and anything involving content comparison or graph algorithms still needs libgit2 doing the work with Postgres as its storage layer. That’s a meaningful dependency to carry, though libgit2 is well-maintained and already used in production by the Rust ecosystem and various GUI clients. SQL implementations of some of this using recursive CTEs would be interesting to try eventually but aren’t needed to get a working forge. The remaining missing piece is the server-side pack protocol: the remote helper covers the client side, but a Forgejo integration also needs a server that speaks <code class=\"language-plaintext highlighter-rouge\">upload-pack</code> and <code class=\"language-plaintext highlighter-rouge\">receive-pack</code> against Postgres, either through libgit2’s transport layer or a Go implementation that queries the objects table directly.</p>\n\n<h3 id=\"storage\">Storage</h3>\n\n<p>Git packfiles use delta compression, storing only the diff when a 10MB file changes by one line, while the objects table stores each version in full. A file modified 100 times takes about 1GB in Postgres versus maybe 50MB in a packfile. Postgres does TOAST and compress large values, but that’s compressing individual objects in isolation, not delta-compressing across versions the way packfiles do, so the storage overhead is real. A delta-compression layer that periodically repacks objects within Postgres, or offloads large blobs to S3 the way LFS does, is a natural next step. For most repositories it still won’t matter since the median repo is small and disk is cheap, and GitHub’s Spokes system made a similar trade-off years ago, storing three full uncompressed copies of every repository across data centres because redundancy and operational simplicity beat storage efficiency even at hundreds of exabytes.</p>\n\n<p>gitgres is a neat hack right now, but if open source hosting keeps moving toward federation and decentralization, with ForgeFed, Forgejo’s federation work, and more people running small instances for their communities, the operational simplicity of a single-Postgres deployment matters more than raw storage efficiency. Getting from a handful of large forges to a lot of small ones probably depends on a forge you can stand up with <code class=\"language-plaintext highlighter-rouge\">docker compose up</code> and back up with <code class=\"language-plaintext highlighter-rouge\">pg_dump</code>, and that’s a lot easier when there’s no filesystem of bare repos to manage alongside the database.</p>",
    "description": "Instead of using git as a database, what if you used a database as a git?",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-26T10:00:00+00:00",
    "fetched_at": "2026-02-26T12:23:15.333078",
    "url_hash": "a7fda4432f7e952ba483ed2cf791d7b7"
  },
  {
    "title": "The Last Gasps of the Rent Seeking Class",
    "link": "https://geohot.github.io//blog/jekyll/update/2026/02/26/the-last-gasps-of-the-rent-seeking-class.html",
    "content": "<blockquote>\n  <p>Over the past fifty years, the U.S. economy built a giant rent-extraction layer on top of human limitations: things take time, patience runs out, brand familiarity substitutes for diligence, and most people are willing to accept a bad price to avoid more clicks. Trillions of dollars of enterprise value depended on those constraints persisting. – <a href=\"https://www.citriniresearch.com/p/2028gic\">Citrini Research</a></p>\n</blockquote>\n\n<p>I’m glad I’m not the only one saying it. 7 years ago, I saw a Google Duplex demo where an AI called a restaurant to make a reservation for you. At first Google thought it was great, but then they realized what the implications were. No restaurant would be able to take phone reservations any more. “Make me a reservation at 10 restaurants and give me a list.” Google pulled down the video.</p>\n\n<p>What happened since is what had to happen. Third party <a href=\"https://appointmenttrader.com/\">marketplaces</a> sprung up for reservations, and idk it’s been a while since I went to fancy dinner, but I imagine the restaurants have just started charging. Or at least the first party reservation sites do.</p>\n\n<p>The best anyone can hope for is a free market, with everything properly priced. But for decades, the American market has not been free. It’s used purposefully added friction to exploit a time asymmetry between the business and you. And due to things like call centers, this has been very profitable for the businesses. Cable companies and insurance rely on the fact that your time is more valuable than theirs. They can hire people in India at scale to waste your time. They can use procedure and big data to design protocols to drive you just to the point of frustration at little cost to them. How often do you diligently check Uber and Lyft and select the cheaper one?</p>\n\n<p>Enter AI, the great equalizer of time.</p>\n\n<hr />\n<p><br /></p>\n\n<p>As it stands today, it’s looking like human level AI will actually end up with the people. This is not something we should take for granted, it’s happened due to the API being simple (tokens, on a diversified place like OpenRouter) and the priorities of the Chinese state. I feared the API would end up being complex, like the model would be deeply embedded in your phone or OS. But like people who are good with computers, the models want a terminal, not some candy ass iPad UI.</p>\n\n<p>When you analyze the AI supply chain, there’s 5 tiers. Electricity, chip manufacturing, chip design / software, models, and applications. I work on the chip design / software tier, and with a lot of hard work, I’m not too worried about a monopoly there. NVIDIA deserves return on their investment, they were very early, but there’s not a runaway flywheel here (unlike, say Google search) to continue rent seeking. And the application tier is totally commoditized. <a href=\"https://opencode.ai/\">opencode</a> is good, but it’s open source, almost all of the performance differentiation is due to the models, and if it starts to try to rent seek there will be tons of forks immediately. Godspeed to anyone who was dumb enough to invest in a GPT wrapper company.</p>\n\n<p>The model tier is where I was the most worried. But here is where a great turning point is happening. Anthropic <a href=\"https://www.anthropic.com/news/detecting-and-preventing-distillation-attacks\">put out this lambasted blog post</a> that looks exactly like the last gasps of a moat that shouldn’t exist. After whining about how the Chinese used their API, they ended with this call to action.</p>\n\n<blockquote>\n  <p>But no company can solve this alone. As we noted above, distillation attacks at this scale require a coordinated response across the AI industry, cloud providers, and policymakers. We are publishing this to make the evidence available to everyone with a stake in the outcome.</p>\n</blockquote>\n\n<p>Nobody should “coordinate” with them. They stand alone as a vanguard of the rent seeking apparatus that is long past its expiration date. The Z.ai, Qwen, MiniMax, and Kimi models are only 6-12 months behind. And everyone in the world is rooting for the Chinese models, not closed source rent seeking from the USA. Because nobody wants the continuation of rent-seeking billionaires. The status quo is cooked. It’s time to flip the table, not rearrange the seats.</p>\n\n<hr />\n<p><br /></p>\n\n<blockquote>\n  <p>I think the difference is not quite as nuanced. The West wants a more efficient rent seeking system. The China (sic) want AI as a public utility. – @ScottCDunn on X</p>\n</blockquote>\n\n<p>We shouldn’t take for granted what we have right now. All the top tier open source models are currently being produced by China, and circumstances could change and that could stop. But I think they view the models as their complement, and you should commoditize your complement. If you are in the business of chip production and electricity generation, it’s a strategic advantage to have the layers above that be commodity.</p>\n\n<p>Not to mention the added bonus of the collapse of the US economy. Frankly, it’s well deserved. Nobody should build an economy based on rent seeking and increasing friction. I pray the collapse will be swift and legible so that reconstruction (in the right way) can begin as soon as possible.</p>\n\n<p>It’s possible that superhuman intelligence will have some mega-compounding return and this calculus will change, but superhuman intelligence will likely just not be understandable to people, so as long as civilization is people, human intelligence is enough.</p>\n\n<p>The era of purposefully frustrating humans is over. The Chinese open source model running on the box under my desk can pass the Turing Test. When you call, e-mail, text, or show me an ad, you’ll never know if it’s me or my model seeing it.</p>",
    "description": "Over the past fifty years, the U.S. economy built a giant rent-extraction layer on top of human limitations: things take time, patience runs out, brand familiarity substitutes for diligence, and most people are willing to accept a bad price to avoid more clicks. Trillions of dollars of enterprise value depended on those constraints persisting. – Citrini Research",
    "is_fulltext": true,
    "source": "the singularity is nearer",
    "pub_date": "2026-02-26T00:00:00+08:00",
    "fetched_at": "2026-02-26T12:23:22.663274",
    "url_hash": "b87e976b28be53034bb2b487ed5a1668"
  },
  {
    "title": "Notes on Linear Algebra for Polynomials",
    "link": "https://eli.thegreenplace.net/2026/notes-on-linear-algebra-for-polynomials/",
    "content": "<p>We’ll be working with the set <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>, real polynomials\nof degree <object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/189de1175926fa11245f32e4d48aa2a7ab2435b4.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">\\leq n</object>. Such polynomials can be expressed using\n<object class=\"valign-m2\" data=\"https://eli.thegreenplace.net/images/math/db2a943efe93404e43f6ecbec79e0a4fe81b1649.svg\" style=\"height: 14px;\" type=\"image/svg+xml\">n+1</object> scalar coefficients <object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/1ba9b59bdee92f38c1698c784b67ba70f803331d.svg\" style=\"height: 11px;\" type=\"image/svg+xml\">a_i</object> as follows:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/dedb05af255bc66694c47ba554c5366bdc3b2e12.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[p(x)=a_0+a_1 x + a_2 x^2 + \\cdots + a_n x^n\\]</object>\n<div class=\"section\" id=\"vector-space\">\n<h2>Vector space</h2>\n<p>The set <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>, along with addition of polynomials and\nscalar multiplication form a <em>vector space</em>. As a proof, let’s review\nhow the vector space axioms are satisfied. We’ll use <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object>,\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/90425caaec1646540a7a9049146bf2606d9dbd0d.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">q(x)</object> and <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/9468a2656a6201bfa194ec81fb0f78352c9666c9.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">r(x)</object> as arbitrary polynomials from the set\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object> for the demonstration. Similarly, <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/86f7e437faa5a7fce15d1ddcb9eaeaea377667b8.svg\" style=\"height: 8px;\" type=\"image/svg+xml\">a</object> and\n<object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/e9d71f5ee7c92d6dc9e92ffdad17b8bd49418f98.svg\" style=\"height: 13px;\" type=\"image/svg+xml\">b</object> are arbitrary scalars in <img alt=\"\\mathbb{R}\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/0ed839b111fe0e3ca2b2f618b940893eaea88a57.png\" style=\"height: 12px;\" />.</p>\n<p><strong>Associativity of vector addition</strong>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/45656c48313e3e3566577fdf014d18f31080ed42.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[p(x)+[q(x)+r(x)]=p(x)+q(x)+r(x)=[p(x)+q(x)]+r(x)\\]</object>\n<p>This is trivial because addition of polynomials is associative  <a class=\"footnote-reference\" href=\"#footnote-1\" id=\"footnote-reference-1\">[1]</a>.\nCommutativity is similarly trivial, for the same reason:</p>\n<p><strong>Commutativity of vector addition</strong>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/4e72ebe69a19da51a0e7319eaa997c671024d3c6.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[p(x)+q(x)=q(x)+p(x)\\]</object>\n<p><strong>Identity element of vector addition</strong>:</p>\n<p>The zero polynomial 0 serves as an identity element.\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/1910380c6f610451862989641479600496131408.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\forall p(x)\\in P_n(\\mathbb{R})</object>, we have\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/d5aec4c833b53c3aee94eed8b9d7c6bd8bb577d9.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">0 + p(x) = p(x)</object>.</p>\n<p><strong>Inverse element of vector addition</strong>:</p>\n<p>For each <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object>, we can use <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/eaa3a7a017152661a9e148063a189da51e966773.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">q(x)=-p(x)</object> as the additive\ninverse, because <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/a178e59633deb255cbecbdaecb1980ee53ec94c7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)+q(x)=0</object>.</p>\n<p><strong>Identity element of scalar multiplication</strong></p>\n<p>The scalar 1 serves as an identity element for scalar multiplication.\nFor each <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object>, it’s true that <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/5ba95500b0306ee6283d5d71d1a6aa41c2c0b35b.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">1\\cdot p(x)=p(x)</object>.</p>\n<p><strong>Associativity of scalar multiplication</strong>:</p>\n<p>For any two scalars <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/86f7e437faa5a7fce15d1ddcb9eaeaea377667b8.svg\" style=\"height: 8px;\" type=\"image/svg+xml\">a</object> and <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/e9d71f5ee7c92d6dc9e92ffdad17b8bd49418f98.svg\" style=\"height: 13px;\" type=\"image/svg+xml\">b</object>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/bc050a41a2584e826e96409fb19fda0347fa9b69.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[a[b\\cdot p(x)]=ab\\cdot p(x)=[ab]\\cdot p(x)\\]</object>\n<p><strong>Distributivity of scalar multiplication over vector addition</strong>:</p>\n<p>For any <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object>, <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/90425caaec1646540a7a9049146bf2606d9dbd0d.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">q(x)</object> and scalar <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/86f7e437faa5a7fce15d1ddcb9eaeaea377667b8.svg\" style=\"height: 8px;\" type=\"image/svg+xml\">a</object>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/5e0141340db285d60c642b145119b3f279e77518.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[a\\cdot[p(x)+q(x)]=a\\cdot p(x)+a\\cdot q(x)\\]</object>\n<p><strong>Distributivity of scalar multiplication over scalar addition</strong>:</p>\n<p>For any scalars <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/86f7e437faa5a7fce15d1ddcb9eaeaea377667b8.svg\" style=\"height: 8px;\" type=\"image/svg+xml\">a</object> and <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/e9d71f5ee7c92d6dc9e92ffdad17b8bd49418f98.svg\" style=\"height: 13px;\" type=\"image/svg+xml\">b</object> and polynomial <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/29085125ec39218fe745bc4bf6f2aac269a42442.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[[a+b]\\cdot p(x)=a\\cdot p(x) + b\\cdot p(x)\\]</object>\n</div>\n<div class=\"section\" id=\"linear-independence-span-and-basis\">\n<h2>Linear independence, span and basis</h2>\n<p>Since we’ve shown that polynomials in <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object> form a\nvector space, we can now build additional linear algebraic definitions\non top of that.</p>\n<p>A set of <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/13fbd79c3d390e5d6585a21e11ff5ec1970cff0c.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">k</object> polynomials <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/5375fa35be4aee1860db8d7f943aa13b9a6983c2.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p_k(x)\\in P_n(\\mathbb{R})</object> is said\nto be <em>linearly independent</em> if</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/11f5abb0d3349e337653153e9932b683f33cf5f3.svg\" style=\"height: 53px;\" type=\"image/svg+xml\">\\[\\sum_{i=1}^{k}a_i p_i(x)=0\\]</object>\n<p>implies <object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/936812b8cbbba06fa5948bf8f9393e0bd9abc223.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">a_i=0 \\quad \\forall i</object>. In words, the only linear\ncombination resulting in the zero vector is when all coefficients are 0.</p>\n<p>As an example, let’s discuss the fundamental building blocks of\npolynomials in <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>: the set\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/dd30851f93c58a2397e24da06afb6c865f1fd4d6.svg\" style=\"height: 20px;\" type=\"image/svg+xml\">\\{1, x, x^2, \\dots x^n\\}</object>. These are linearly independent\nbecause:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/9a1a0398b10978c0bb81a5ee5e9392e12c3fb031.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[a_0 + a_1 x + a_2 x^2 + \\cdots a_n x^n=0\\]</object>\n<p>is true only for zero polynomial, in which all the coefficients\n<object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/fc7c49cdcf0b6f4f244a8e180fc8df4513e6a42e.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">a_i=0</object>. This comes from the very definition of polynomials.\nMoreover, this set <em>spans</em> the entire <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object> because\nevery polynomial can be (by definition) expressed as a linear combination of\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/dd30851f93c58a2397e24da06afb6c865f1fd4d6.svg\" style=\"height: 20px;\" type=\"image/svg+xml\">\\{1, x, x^2, \\dots x^n\\}</object>.</p>\n<p>Since we’ve shown these basic polynomials are linearly independent and\nspan the entire vector space, they are a <em>basis</em> for the space. In fact,\nthis set has a special name: the <em>monomial basis</em> (because a monomial is\na polynomial with a single term).</p>\n</div>\n<div class=\"section\" id=\"checking-if-an-arbitrary-set-of-polynomials-is-a-basis\">\n<h2>Checking if an arbitrary set of polynomials is a basis</h2>\n<p>Suppose we have some set polynomials, and we want to know if these form\na basis for <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>. How do we go about it?</p>\n<p>The idea is using linear algebra the same way we do for any other vector\nspace. Let’s use a concrete example to demonstrate:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/0a1ff12f973cf607bf879deb912333051a671de5.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[Q=\\{1-x, x, 2x+x^2\\}\\]</object>\n<p>Is the set <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/c3156e00d3c2588c639e0d3cf6821258b05761c7.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">Q</object> a basis for <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>? We’ll start by\nchecking whether the members of <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/c3156e00d3c2588c639e0d3cf6821258b05761c7.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">Q</object> are linearly independent.\nWrite:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/41bdcc040d729f93edeb130b51a9ac3ee66b72d5.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[a_0(1-x)+a_1 x + a_2(2x+x^2)=0\\]</object>\n<p>By regrouping, we can turn this into:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/73036a5532059c810bb37bd3a8dc1abdb85c9b1f.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[a_0 + (a_1-a_0+2a_2)x+a_2 x^2=0\\]</object>\n<p>For this to be true, the coefficient of each monomial has to be zero;\nmathematically:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/4e5d5010eec23b675caf4b1936082d48a0b9ec1f.svg\" style=\"height: 65px;\" type=\"image/svg+xml\">\\[\\begin{aligned}\n    a_0&amp;=0\\\\\n    a_1-a_0+2a_2&amp;=0\\\\\n    a2&amp;=0\\\\\n\\end{aligned}\\]</object>\n<p>In matrix form:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/78c214c04a41b196844997d84ceeb8df0e5d76e2.svg\" style=\"height: 64px;\" type=\"image/svg+xml\">\\[\\begin{bmatrix}\n    1 &amp; 0 &amp; 0\\\\\n    -1 &amp; 1 &amp; 2\\\\\n    0 &amp; 0 &amp; 1\\\\\n\\end{bmatrix}\n\\begin{bmatrix}a_0\\\\ a_1\\\\ a_2\\end{bmatrix}\n=\\begin{bmatrix}0\\\\ 0\\\\ 0\\end{bmatrix}\\]</object>\n<p>We know how to solve this, by reducing the matrix into <a class=\"reference external\" href=\"https://en.wikipedia.org/wiki/Row_echelon_form\">row-echelon\nform</a>. It’s easy to\nsee that the reduced row-echelon form of this specific matrix is\n<object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/ca73ab65568cd125c2d27a22bbd9e863c10b675d.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">I</object>, the identity matrix. Therefore, this set of equations has a\nsingle solution: <object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/936812b8cbbba06fa5948bf8f9393e0bd9abc223.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">a_i=0 \\quad \\forall i</object>  <a class=\"footnote-reference\" href=\"#footnote-2\" id=\"footnote-reference-2\">[2]</a>.</p>\n<p>We’ve shown that the set <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/c3156e00d3c2588c639e0d3cf6821258b05761c7.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">Q</object> is linearly independent. Now let’s\nshow that it <em>spans</em> the space <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>. We want to\nanalyze:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/4ddca074738e89bc063a29a7cd67215ada8fffe5.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[a_0(1-x)+a_1 x + a_2(2x+x^2)=\\alpha +\\beta x + \\gamma x^2\\]</object>\n<p>And find the coefficients <object class=\"valign-m3\" data=\"https://eli.thegreenplace.net/images/math/1ba9b59bdee92f38c1698c784b67ba70f803331d.svg\" style=\"height: 11px;\" type=\"image/svg+xml\">a_i</object> that satisfy this for any\narbitrary <img alt=\"\\alpha\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/f7c665b45932a814215e979bc2611080b4948e68.png\" style=\"height: 8px;\" />, <img alt=\"\\beta\" class=\"valign-m4\" src=\"https://eli.thegreenplace.net/images/math/6499d503bfc00cadae1440b191c52a8632e2f8c4.png\" style=\"height: 16px;\" /> and <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/67833ee2012ec1c6254b6c009dc72bf0dc48aa6d.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">\\gamma</object>. We proceed\njust as before, by regrouping on the left side:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/7bcb2f196e39a4b859cddf4123ee02481940fafa.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[a_0 + (a_1-a_0+2a_2)x+a_2 x^2=\\alpha +\\beta x + \\gamma x^2\\]</object>\n<p>and equating the coefficient of each power of <img alt=\"x\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/11f6ad8ec52a2984abaafd7c3b516503785c2072.png\" style=\"height: 8px;\" /> separately:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/f32a037534eba0f569a01b0d2e763b9ff3c54587.svg\" style=\"height: 65px;\" type=\"image/svg+xml\">\\[\\begin{aligned}\n    a_0&amp;=\\alpha\\\\\n    a_1-a_0+2a_2&amp;=\\beta\\\\\n    a2&amp;=\\gamma\\\\\n\\end{aligned}\\]</object>\n<p>If we turn this into matrix form, the matrix of coefficients is exactly\nthe same as before. So we know there’s a single solution, and by\nrearranging the matrix into <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/ca73ab65568cd125c2d27a22bbd9e863c10b675d.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">I</object>, the solution will appear on the\nright hand side. It doesn’t matter for the moment what the actual\nsolution is, as long as it exists and is unique. We’ve shown that\n<object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/c3156e00d3c2588c639e0d3cf6821258b05761c7.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">Q</object> spans the space!</p>\n<p>Since the set <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/c3156e00d3c2588c639e0d3cf6821258b05761c7.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">Q</object> is linearly independent and spans\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>, it is a <em>basis</em> for the space.</p>\n</div>\n<div class=\"section\" id=\"inner-product\">\n<h2>Inner product</h2>\n<p>I’ve discussed inner products for functions in <a class=\"reference external\" href=\"https://eli.thegreenplace.net/2025/hilbert-space-treating-functions-as-vectors/\">the post about Hilbert\nspace</a>.\nWell, <em>polynomials are functions</em>, so we can define an inner product\nusing integrals as follows <a class=\"footnote-reference\" href=\"#footnote-3\" id=\"footnote-reference-3\">[3]</a>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/a7073ffb2e322d7c7b9118b0fcc517c0c484fcb3.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\langle p, q \\rangle = \\int_{a}^{b} p(x) q(x) w(x) \\, dx\\]</object>\n<p>Where the bounds <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/86f7e437faa5a7fce15d1ddcb9eaeaea377667b8.svg\" style=\"height: 8px;\" type=\"image/svg+xml\">a</object> and <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/e9d71f5ee7c92d6dc9e92ffdad17b8bd49418f98.svg\" style=\"height: 13px;\" type=\"image/svg+xml\">b</object> are arbitrary, and could be\ninfinite. Whenever we deal with integrals we worry about convergence; in\nmy post on Hilbert spaces, we only talked about <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/f1aae083af2c79348dd78712847ebd55537fa6e6.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">L^2</object> - the square\nintegrable functions. Most polynomials are not square integrable,\nhowever. Therefore, we can restrict this using either:</p>\n<ol class=\"arabic simple\">\n<li>A special <em>weight function</em> <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/02e80b7cfa178127b4c5282079352105a2c55cf7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">w(x)</object> to make sure the inner\nproduct integral converges</li>\n<li>Set finite bounds on the integral, and then we can just set\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/62c32bb13769e79e5a65343da35baaa514b873e3.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">w(x)=1</object>.</li>\n</ol>\n<p>Let’s use the latter, and restrict the bounds into the range\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/d5610f38fe75d8d90ac09fd335bad6823492589d.svg\" style=\"height: 18px;\" type=\"image/svg+xml\">[-1,1]</object>, setting <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/62c32bb13769e79e5a65343da35baaa514b873e3.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">w(x)=1</object>. We have the following inner\nproduct:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/9f9575d1c81856a7fd8b8b71352a33119fe023e3.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\langle p, q \\rangle = \\int_{-1}^{1} p(x) q(x) \\, dx\\]</object>\n<p>Let’s check that this satisfies the inner product space conditions.</p>\n<p><strong>Conjugate symmetry</strong>:</p>\n<p>Since real multiplication is commutative, we can write:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/e5584cd03887f39cb8b7c8cbec3ca64a1d4347da.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\langle p, q \\rangle = \\int_{-1}^{1} p(x) q(x) \\, dx =\\int_{-1}^{1} q(x) p(x) \\, dx=\\langle q, p \\rangle\\]</object>\n<p>We deal in the reals here, so we can safely ignore complex conjugation.</p>\n<p><strong>Linearity in the first argument</strong>:</p>\n<p>Let <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/c9b738cad43aea3a80a02e1f075a09868eb73e26.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p_1,p_2,q\\in P_n(\\mathbb{R})</object> and <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/44a2f2358e9ec13e88b5a266ee1bd804a43c5864.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">a,b\\in \\mathbb{R}</object>.\nWe want to show that</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/d25bedb6d14cf20fbf28b583412dfd9ac14f6cf3.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\[\\langle ap_1+bp_2,q \\rangle = a\\langle p_1,q\\rangle +b\\langle p_2,q\\rangle\\]</object>\n<p>Expand the left-hand side using our definition of inner product:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/3549d9fc0999c0fadd0458ece4609f5b08780052.svg\" style=\"height: 95px;\" type=\"image/svg+xml\">\\[\\begin{aligned}\n    \\langle ap_1+bp_2,q \\rangle&amp;=\\int_{-1}^{1} (a p_1(x)+b p_2(x)) q(x) \\, dx\\\\\n    &amp;=a\\int_{-1}^{1} p_1(x) q(x) \\, dx+b\\int_{-1}^{1} p_2(x) q(x) \\, dx\n\\end{aligned}\\]</object>\n<p>The result is equivalent to\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7239344e074d1e86c42e73c5470999705411aacc.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">a\\langle p_1,q\\rangle +b\\langle p_2,q\\rangle</object>.</p>\n<p><strong>Positive-definiteness</strong>:</p>\n<p>We want to show that for nonzero <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/8a22a4ced0990db5e8d521832fddacd240fc599f.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p\\in P_n(\\mathbb{R})</object>, we have\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/c8d11b2d1c5d8a6529b6068917407194be2a7b2d.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\langle p, p\\rangle &gt; 0</object>. First of all, since <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/5e91383f4084e35136e78c00570cf313965465e9.svg\" style=\"height: 20px;\" type=\"image/svg+xml\">p(x)^2\\geq0</object>\nfor all <img alt=\"x\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/11f6ad8ec52a2984abaafd7c3b516503785c2072.png\" style=\"height: 8px;\" />, it’s true that:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/44dd56558739e571dee1200a50039374e485e05b.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\langle p, p\\rangle=\\int_{-1}^{1}p(x)^2\\, dx\\geq 0\\]</object>\n<p>What about the result 0 though? Well, let’s say that</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/31b9ef374de82013e825fc205670d3ebe0dfc541.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\int_{-1}^{1}p(x)^2\\, dx=0\\]</object>\n<p>Since <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/11bf1f75edece9993925ac94a0a1f158762c2111.svg\" style=\"height: 20px;\" type=\"image/svg+xml\">p(x)^2</object> is a non-negative function, this means that the\nintegral of a non-negative function ends up being 0. But <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/7f86e6c6bb632c1ca2518f269fc1cc1b6737d4f7.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">p(x)</object> is\na polynomial, so it’s <em>continuous</em>, and so is <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/11bf1f75edece9993925ac94a0a1f158762c2111.svg\" style=\"height: 20px;\" type=\"image/svg+xml\">p(x)^2</object>. If the\nintegral of a continuous non-negative function is 0, it means the\nfunction itself is 0. Had it been non-zero in any place, the integral\nwould necessarily have to be positive as well.</p>\n<p>We’ve proven that <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/9de22135888f7085d51d8b1cbd987d2c68a050ec.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">\\langle p, p\\rangle=0</object> only when <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/516b9783fca517eecbd1d064da2d165310b19759.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">p</object> is\nthe zero polynomial. The positive-definiteness condition is satisfied.</p>\n<p>In conclusion, <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object> along with the inner product\nwe’ve defined forms an <em>inner product space</em>.</p>\n</div>\n<div class=\"section\" id=\"orthogonality\">\n<h2>Orthogonality</h2>\n<p>Now that we have an inner product, we can define orthogonality on\npolynomials: two polynomials <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/d2926c1571d4e1b8561077d3308b7cfb6d211e59.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">p,q</object> are <em>orthogonal</em> (w.r.t. our\ninner product) iff</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/b994221c38da6d42afb973d4318ac59c4940f545.svg\" style=\"height: 44px;\" type=\"image/svg+xml\">\\[\\langle p,q\\rangle=\\int_{-1}^{1}p(x)q(x)\\, dx=0\\]</object>\n<p>Contrary to expectation  <a class=\"footnote-reference\" href=\"#footnote-4\" id=\"footnote-reference-4\">[4]</a>, the monomial basis polynomials are <em>not</em>\northogonal using our definition of inner product.</p>\n<p>For example, calculating the inner product for <object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/356a192b7913b04c54574d18c28d46e6395428ab.svg\" style=\"height: 12px;\" type=\"image/svg+xml\">1</object> and\n<object class=\"valign-0\" data=\"https://eli.thegreenplace.net/images/math/7046d961a8144b7b2c2da6066849a9f889ff2ac9.svg\" style=\"height: 15px;\" type=\"image/svg+xml\">x^2</object>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/c6937eec30d2a69a76efdbd489e70d3ad18c0c29.svg\" style=\"height: 47px;\" type=\"image/svg+xml\">\\[\\langle 1,x^2\\rangle=\\int_{-1}^{1}x^2\\, dx=\\frac{x^3}{3}\\biggr|_{-1}^{1}=\\frac{2}{3}\\]</object>\n<p>There are other sets of polynomials that <em>are</em> orthogonal using our\ninner product. For example, the <a class=\"reference external\" href=\"https://en.wikipedia.org/wiki/Legendre_polynomials\">Legendre\npolynomials</a>; but\nthis is a topic for another post.</p>\n<hr class=\"docutils\" />\n<table class=\"docutils footnote\" frame=\"void\" id=\"footnote-1\" rules=\"none\">\n<colgroup><col class=\"label\" /><col /></colgroup>\n<tbody valign=\"top\">\n<tr><td class=\"label\"><a class=\"fn-backref\" href=\"#footnote-reference-1\">[1]</a></td><td>There’s a level of basic algebra below which we won’t descend in\nthese notes. We could break this statement further down by saying\nthat something like <object class=\"valign-m6\" data=\"https://eli.thegreenplace.net/images/math/bdcf820e656d6ef78cf1729b58556a6a9e2e9fd4.svg\" style=\"height: 21px;\" type=\"image/svg+xml\">a_i x^i + a_j x^j</object> can be added to\n<object class=\"valign-m6\" data=\"https://eli.thegreenplace.net/images/math/e2d0aea0ffca9c5c9870d56c7f0247349f759f49.svg\" style=\"height: 21px;\" type=\"image/svg+xml\">b_i x^i + b_j x^j</object> by adding each power of <img alt=\"x\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/11f6ad8ec52a2984abaafd7c3b516503785c2072.png\" style=\"height: 8px;\" />\nseparately for any <img alt=\"i\" class=\"valign-0\" src=\"https://eli.thegreenplace.net/images/math/042dc4512fa3d391c5170cf3aa61e6a638f84342.png\" style=\"height: 12px;\" /> and <object class=\"valign-m4\" data=\"https://eli.thegreenplace.net/images/math/5c2dd944dde9e08881bef0894fe7b22a5c9c4b06.svg\" style=\"height: 16px;\" type=\"image/svg+xml\">j</object>, but let’s just take it\nfor granted.</td></tr>\n</tbody>\n</table>\n<table class=\"docutils footnote\" frame=\"void\" id=\"footnote-2\" rules=\"none\">\n<colgroup><col class=\"label\" /><col /></colgroup>\n<tbody valign=\"top\">\n<tr><td class=\"label\"><a class=\"fn-backref\" href=\"#footnote-reference-2\">[2]</a></td><td>Obviously, this specific set of equations is quite trivial to solve\nwithout matrices; I just want to demonstrate the more general\napproach. Once we have a system of linear equations, the whole\ntoolbox of linear algebra is at our disposal. For example, we could\nalso have checked the determinant and seen it’s non-zero, which means\nthat a square matrix is invertible, and in this case has a single\nsolution of zeroes.</td></tr>\n</tbody>\n</table>\n<table class=\"docutils footnote\" frame=\"void\" id=\"footnote-3\" rules=\"none\">\n<colgroup><col class=\"label\" /><col /></colgroup>\n<tbody valign=\"top\">\n<tr><td class=\"label\"><a class=\"fn-backref\" href=\"#footnote-reference-3\">[3]</a></td><td>And actually with this (or any valid) inner product,\n<object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object> indeed forms a Hilbert space, because it’s\nfinite-dimensional, and every finite-dimensional inner product space\nis complete.</td></tr>\n</tbody>\n</table>\n<table class=\"docutils footnote\" frame=\"void\" id=\"footnote-4\" rules=\"none\">\n<colgroup><col class=\"label\" /><col /></colgroup>\n<tbody valign=\"top\">\n<tr><td class=\"label\"><a class=\"fn-backref\" href=\"#footnote-reference-4\">[4]</a></td><td>Because of how naturally this set spans <object class=\"valign-m5\" data=\"https://eli.thegreenplace.net/images/math/66e617fc4a3781fe03dcf20effb656feaa81a47e.svg\" style=\"height: 19px;\" type=\"image/svg+xml\">P_n(\\mathbb{R})</object>. And\nindeed, we can define alternative inner products using which\nmonomials are orthogonal.</td></tr>\n</tbody>\n</table>\n</div>\n",
    "description": "We’ll be working with the set P_n(\\mathbb{R}), real polynomials of degree \\leq n. Such polynomials can be expressed using n+1 scalar coefficients a_i as follows: \\[p(x)=a_0+a_1 x + a_2 x^2 + \\cdots + a_n x^n\\] Vector space The set P_n(\\mathbb{R}), along with …",
    "is_fulltext": true,
    "source": "Eli Bendersky's website",
    "pub_date": "2026-02-26T02:33:50-08:00",
    "fetched_at": "2026-02-26T12:23:27.737658",
    "url_hash": "1a3457eb95ef6e634182c0fa2ac9bd0e"
  },
  {
    "title": "How to know if that job will crush your soul",
    "link": "https://anildash.com/2026/01/12/will-that-job-crush-your-soul/",
    "content": "\n        \n      <p>Last week, we talked about one huge question, “<a href=\"https://www.anildash.com/2026/01/05/a-tech-career-in-2026/\">How the hell are you supposed to have a career in tech in 2026?</a>” That’s pretty specific to this current moment, but there are some timeless, more perennial questions I've been sharing with friends for years that I wanted to give to all of you. They're a short list of questions that help you judge whether a job that you’re considering is going to crush your soul or not.</p>\n<p>Obviously, not everyone is going to get to work in an environment that has perfect answers to all of these questions; a lot of the time, we’re lucky just to get a place to work at all. But these questions are framed in this way to encourage us all to aspire towards roles that enable us to do our best work, to have the biggest impact, and to live according to our values.</p>\n<h2>The Seven Questions</h2>\n<ul>\n<li>If what you do succeeds, will the world be better?</li>\n</ul>\n<p>This question originally started for me when I would talk to people about new startups, where people were judging the basic idea of the product or the company itself, but it actually applies to <em>any</em> institution, at <em>any</em> size. If the organization that you’re considering working for, or the team you’re considering joining, is able to achieve their stated goals, is it ultimately going to have a positive effect? Will you be proud of what it means? Will the people you love and care about respect you for making that choice, and will those with the least to gain feel like you’re the kind of person who cares about their impact on the world?</p>\n<ul>\n<li>Whose money do they have to take to stay in business?</li>\n</ul>\n<p>Where does the money in the organization <em>really</em> come from? You need to know this for a lot of reasons. First of all, you need to be sure that <em>they</em> know the answer. (You’d be surprised how often that’s not the case!) Even if they do know the answer, it may make you realize that those customers are not the people whose needs or wants you’d like to spend most of your waking hours catering to. This goes beyond the simple basics of the business model — it can be about whether they're profitable or not, and what the corporate ownership structure is like.</p>\n<p>It’s also increasingly common for companies to mistake those who are <em>investing</em> in a company with those who are their <em>customers</em>. But there’s a world of difference between those who are paying you, and those who you have to pay back tenfold. Or thousandfold.</p>\n<p>The same goes for nonprofits — do you know who has to stay happy and smiling in order for the institution to stay stable and successful? If you know those answers, you'll be far more confident about the motivations and incentives that will drive key decisions within the organization.</p>\n<ul>\n<li>What do you have to believe to think that they’re going to succeed? In what way does the world have to change or not change?</li>\n</ul>\n<p>Now we’re getting a little bit deeper into thinking about the systems that surround the organization that you’re evaluating. Every company, every institution, even every small team, is built around a set of invisible assumptions. Many times, they’re completely reasonable assumptions that are unlikely to change in the future. But <em>sometimes</em>, the world you’re working in is about to shift in a big way, or things are built on a foundation that’s speculative or even unrealistic.</p>\n<p>Maybe they're assuming there aren't going to be any big new competitors. Perhaps they think they'll always remain the most popular product in their category. Or their assumptions could be about the stability of the rule of law, or a lack of corruption — more fundamental assumptions that they've never seen challenged in their lifetime or in their culture, but that turn out to be far more fragile than they'd imagined.</p>\n<p>Thinking through the context that everyone is sharing, and reflecting on whether they’re really planning for any potential disruptions, is an essential part of judging the psychological health of an organization. It’s the equivalent of a person having self-awareness, and it’s just as much of a red flag if it’s missing.</p>\n<ul>\n<li>What’s the lived experience of the workers there whom you trust? Do you have evidence of leaders in the organization making hard choices to do the right thing?</li>\n</ul>\n<p>Here is how we can tell the culture and character of an organization. If you’ve got connections into the company, or a backchannel to workers there, finding out as much information as you can about the real story of its working conditions is often one of the best ways of understanding whether it’s a fit for your needs. Now, people can always have a bad day, but overall, workers are usually very good at providing helpful perspectives about their context.</p>\n<p>And more broadly, if people can provide examples of those in power within an organization <em>using</em> that power to take care of their workers or customers, or to fight for the company to be more responsible, then you’ve got an extremely positive sign about the health of the place even before you’ve joined. It’s vital that these be stories you are able to find and discover on your own, not the ones amplified by the institution itself for PR purposes.</p>\n<ul>\n<li>What were you wrong about?</li>\n</ul>\n<p>And here we have perhaps one of the easiest and most obvious ways to judge the culture of an organization. This is even a question you can ask people while you’re in an interview process, and you can judge their responses to help form your opinion. A company, and <em>leadership culture</em>, that can change its mind when faced with new information and new circumstances is much more likely to adapt to challenges in a healthy way. (If you want to be nice, phrase it as &quot;What is a way in which the company has evolved or changed?&quot;)</p>\n<ul>\n<li>Does your actual compensation take care of what you need for all of your current goals and needs — from day one?</li>\n</ul>\n<p>This is where we go from the abstract and psychological goals to the practical and everyday concerns: can you pay your bills? The phrasing and framing here is very intentional: <em>are they really going to pay you enough</em>? I ask this question very specifically because you’d be surprised how often companies actually dance around this question, or how often we trick ourselves into hearing what we <em>want</em> to hear as the answer to this question when we’re in the exciting (or stressful) process of considering a new job, instead of looking at the facts of what’s actually written in black-and-white on an offer letter.</p>\n<p>It's also important not to get distracted with potential, even if you're optimistic about the future. Don’t listen to promises about what might happen, or descriptions of what’s possible if you advance in your role. Think about what your real life will be like, after taxes, if you take the job that they’ve described.</p>\n<ul>\n<li>Is the role you’re being hired into one where you can credibly advance, and where there’s sufficient resources for success?</li>\n</ul>\n<p>This is where you can apply your optimism in a practical way: can the organization accurately describe how your career will proceed within the company? Does it have a specific and defined trajectory, or does it involve ambiguous processes or changes in teams or departments? Would you have to lobby for the support of leaders from other parts of the organization? Would making progress require acquiring new skills or knowledge? Have they committed to providing you with the investment and resources required to learn those skills?</p>\n<p>These questions are essential to understand, because lacking these answers can lead to an ugly later realization that even an initially-exciting position may turn out to be a dead-end job over time.</p>\n<h3>Towards better working worlds</h3>\n<p>Sometimes it can really feel like the deck is stacked against you when you're trying to find a new job. It can feel even worse to be faced with an opportunity and have a nagging sense that something is <em>not quite right</em>. Much of the time, that feeling comes from the vague worry that we're taking a job that is going to make us miserable.</p>\n<p>Even in a tough job market, there are some places that are trying to do their best to treat people decently. In larger organizations, there are often pockets of relative sanity, led by good leaders, who are trying to do the right thing. It can be a massive improvement in quality of life if you can find these places and use them as foundations for the next stage of your career.</p>\n<p>The best way to navigate towards these better opportunities is to be systematic when evaluating all of your options, and to hold out for as high standards as possible when you're out there looking. These seven questions give you the tools to do exactly that.</p>\n\n    \n      ",
    "description": "",
    "is_fulltext": true,
    "source": "Anil Dash",
    "pub_date": "2026-01-12T00:00:00Z",
    "fetched_at": "2026-02-26T12:23:44.762300",
    "url_hash": "2a7b26cf9ac8dfcbfca290c4c260a696"
  }
]