[
  {
    "title": "Microsoft Should Watch The Expanse",
    "link": "https://idiallo.com/blog/microsoft-should-watch-the-expanse?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>My favorite piece of technology in science fiction isn't lightsabers, flying spaceships, or even robots. It's AI. But not just any AI. My favorite is the one in the TV show <a href=\"https://en.wikipedia.org/wiki/The_Expanse_(TV_series)\">The Expanse</a>.</p>\n\n<p>If you watch The Expanse, the most advanced technology is, of course, the Epstein drive (an unfortunate name in this day and age). In their universe, humanity can travel to distant planets, the Belt, and Mars. Mars has the most high-tech military, which is incredibly cool. But the AI is still what impresses me most. If you watched the show, you're probably wondering what the hell I'm talking about right now. Because there is no mention of AI ever. The AI is barely visible. In fact, it's not visible at all. Most of the time, there aren't even voices. Instead, their computer interfaces respond directly to voice and gesture commands without returning any sass.</p>\n\t\t\t<p>In Season 1, Miller (the detective) is trying to solve a crime. Out of the blue, he just says, \"Plot the course the Scopuli took over the past months.\" The course is plotted right there in his living room. No fuss, no interruptions, no \"OK Google.\" And when he finally figures it out, no one says \"You are absolutely right!\"</p>\n\n<p>He then interacts with the holographic display in real time, asking for additional information and manipulating the data with gestures. At no point does he anthropomorphize the AI. It's always there, always available, always listening, but it never interrupts. </p>\n\n<p>This type of interaction is present throughout the series. In the Rocinante, James Holden will give commands like \"seal bulkhead,\" \"plot intercept course,\" or \"scan for life signs,\" and the ship's computer simply executes. There are no loading screens, no chatbot personality trying to be helpful. The computer doesn't explain what it's doing or ask for confirmation on routine tasks. It just works.</p>\n\n<p>When Holden needs tactical information during a firefight, he doesn't open an app or navigate menus. He shouts questions, and relevant data appears on his helmet display. When Naomi needs to calculate a complex orbital maneuver, she doesn't fight with an interface. She thinks out loud, and the system provides the calculations she needs.</p>\n\n<p>This is the complete opposite of Microsoft's Copilot... Yes, this is about Copilot.</p>\n\n<p>In Microsoft's vision, they think they're designing an AI assistant, an AI copilot that's always there to help. You have Copilot in Excel, in Edge, in the taskbar. It's everywhere, yet it's as useless as you can imagine.</p>\n\n<p>What is Copilot? Is it ChatGPT or a wrapper around it? Is it a code assistant? Is it a search engine? Or wait, is it all of Microsoft Office now? It's attached to every application, yet it hasn't been particularly helpful. </p>\n\n<p>We now use Teams at work, and I see Copilot popping up every time to offer to help me, just like Clippy. OK, fine, I asked for the meaning of a term I hear often in this company. Copilot doesn't know. Well, it doesn't say it doesn't know. Instead, it gives me the definition of what it thinks the term means in general.</p>\n\n<p>Imagine for a second you're a manager and you hear developers talking about issues with Apache delaying a project. You don't know what Apache is, so you ask Copilot. It tells you that the Apache are a group of Native American tribes known for their resilience in the Southwest. If you don't know any better, you might take that definition at face value, never knowing that Copilot has does not have access to any of the company data. Now in the project retro, you'll blame a native American tribe for delaying the project.</p>\n\n<p>Copilot is everywhere, yet it is nowhere. Nobody deliberately opens it to solve a problem. Instead, it's like Google Plus from back in the day. If you randomly clicked seven times on the web, you would somehow end up with a Google Plus account and, for some reason, two YouTube accounts.</p>\n\n<p>Copilot is visible when it should be invisible, and verbose when it should be silent. It interrupts your workflow to offer help you didn't ask for, then fails to provide useful answers when you actually need them. It's the opposite of the AI in The Expanse. It doesn't fade in the background. It is constantly reminding you that you need to use it here and now.</p>\n\n<p>In <em>The Expanse</em>, the AI doesn't have a personality because it doesn't need one. It's not trying to be your friend or impress you with its conversational abilities. It's a tool, refined to perfection. It is not trying to replace your job, it is there to support you. Copilot only exists to impress you, and it fails at it every single time.</p>\n\n<hr />\n\n<p>Satya should binge-watch The Expanse. I'm not advocating for AI everything, but I am all for creating useful tools. And Copilot, as it currently exists, is one of the least useful implementations of AI I've encountered.</p>\n\n<p>The best technology is invisible. It doesn't announce itself, doesn't demand attention, and doesn't try to be clever. It simply works when you need it and disappears when you don't. I know Microsoft won't read this or learn from it. Instead, I expect Windows 12 to be renamed Microsoft Copilot OS.</p>\n\n<p>In The Expanse, the AI turn people into heroes. In our world, Copilot, Gemini, ChatGPT, all want to be the heroes. And they will differentiate themselves by trying to be the loudest.</p>\n\t\t\t\n\t\t\t\t",
    "description": "My favorite piece of technology in science fiction isn't lightsabers, flying spaceships, or even robots. It's AI. But not just any AI. My favorite is the one in the TV show The Expanse. If you watch The Expanse, the most advanced technology is, of course, the Epstein drive (an unfortunate name in this day and age). In their universe, humanity can travel to distant planets, the Belt, and Mars. Mars has the most high-tech military, which is incredibly cool. But the AI is still what impresses me mo",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Mon, 09 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-09T12:25:08.475333",
    "url_hash": "b05de1b22abfeba7d1b4924c7c3730b3"
  },
  {
    "title": "Pluralistic: The Epstein class and collapse porn (09 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/09/sloppy-steve/",
    "content": "<p><!--\nTags:\nepstein files, epstein class, collapse porn, steve bannon, sloppy steve, class warfare, peter thiel, panic of 1893\n\nSummary:\nThe Epstein class and collapse porn; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/09/sloppy-steve/\n\nTitle:\nPluralistic: The Epstein class and collapse porn (09 Feb 2026) sloppy-steve\n\nBullet:\n&#x1f9a6;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/09Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#mckinley-fanfic-panic\">The Epstein class and collapse porn</a>: Buy the dip!\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#retro\">Object permanence</a>: Web 1.0 logos; Legality of printing Catan tiles; Hamster strandbeest; Pactuator; Michican bans oral; Blooks; Yours is a very bad hotel; Yippie Disneyland invasion model; Floppy toccata; Happy Birthday trolls owe $14m; Jughead is ace; Snowden for teens.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12398\"></span></p>\n<hr/>\n<p><a name=\"mckinley-fanfic-panic\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A detail of a US $100 bill. Jeffrey Epstein's mugshot has been overlaid over Benjamin Franklin's portrait. Peter Thiel's portrait has been swapped for the US Dept of Treasury seal. Trump's signature has been swapped for the US Treasurer's signature. The line of zeroes after the 100, top and bottom, has been extended to the edge of the image. The image has been roughed up and recolored in a hellish mix of reds and yellows.\" src=\"https://i0.wp.com/craphound.com/images/buy-the-dip.jpg?w=840&#038;ssl=1\"/></p>\n<h1>The Epstein class and collapse porn (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#mckinley-fanfic-panic\">permalink</a>)</h1>\n<p>It's hard to talk about the Epstein class without thinking about \"The Economy\" &#8211; \"The Economy\" in the sense of a kind of mystical, free-floating entity whose health or sickness determines the outcomes for all the rest of us, whom we must make sacrifices to if we are to prosper.</p>\n<p>As nebulous as \"The Economy\" is as an entity, there's an economic priesthood that claims it can measure and even alter the course of the economy using complex mathematics. We probably won't ever understand their methods, but we can at least follow an indicator or two, such as changes to GDP, an aggregated statistic that is deceptively precise, given that it subsumes any number of estimates, qualitative judgments and wild-ass guesses, which are all disguised behind an official statistic that is often published to three decimal places.</p>\n<p>There's plenty to criticize about GDP: a healthy GDP doesn't necessarily mean that the average worker is better off. When your rent goes up, so does GDP. Same with your salary going down (provided this results in more spending by your boss). GDP isn't really a measure of the health of \"The Economy\" &#8211; it's a measure of the parts of \"The Economy\" that make rich people (that is, the Epstein class) better off.</p>\n<p>But what if there was a way to make money from calamitous collapses in GDP? What if the wealthy didn't just win when \"number go up,\" but also when \"number eat shit?\"</p>\n<p>The latest batch of Epstein emails includes a particularly ghoulish exchange between Epstein and his business partner, the anti-democracy activist and billionaire Peter Thiel:</p>\n<p><a href=\"https://www.justice.gov/epstein/files/DataSet%209/EFTA00824843.pdf\">https://www.justice.gov/epstein/files/DataSet%209/EFTA00824843.pdf</a></p>\n<p>The email is dated 26 Jun 2016, right after Brexit, and in it, Epstein writes:</p>\n<blockquote><p>\n  return to tribalism . counter to globalization. amazing new alliances.  you and I both agreed zero interest rates were too high, as i said in your office.  finding things on their way to collapse , was much easier than finding the next bargain\n</p></blockquote>\n<p>This is a perfect example of what Naomi Klein calls \"disaster capitalism.\" It's been the norm since the crash of 2008, when bankers were made whole through public bailouts and mortgage holders were evicted by the millions to \"foam the runway\" for the banks:</p>\n<p><a href=\"https://wallstreetonparade.com/2012/08/how-treasury-secretary-geithner-foamed-the-runways-with-childrens-shattered-lives/\">https://wallstreetonparade.com/2012/08/how-treasury-secretary-geithner-foamed-the-runways-with-childrens-shattered-lives/</a></p>\n<p>The crash of 2008 turned a lot of people's homes &#8211; their only substantial possessions &#8211; into \"distressed assets\" that were purchased at fire-sale prices by Wall Street investors, who turned around and rented those homes out to people who were now priced out of the housing market at rents that kept them too poor to <em>ever</em> afford a home, under slum conditions that crawled with insects and black mold:</p>\n<p><a href=\"https://pluralistic.net/2024/10/01/housing-is-a-human-right/\">https://pluralistic.net/2024/10/01/housing-is-a-human-right/</a></p>\n<p>Note here that economic collapse helps the Epstein class only if society has no social safety net. If Obama had supported homeowners instead of banks, there wouldn't have been a foreclosure crisis and thus there wouldn't have been any \"distressed assets\" flooding the market.</p>\n<p>So it's no surprise that the Epstein class are also obsessed with austerity. Peter Mandelson (British Labour's \"Prince of Darkness\") is a close ally of Epstein's, and also a key figure in the crushing austerity agenda of Blair, Brown and Starmer. He's a machine for turning Parliamentary majorities into distressed assets at scale.</p>\n<p>Same for Steve Bannon, another close Epstein ally, who boasts about his alliances with far-right figures who exalt the capital class and call for deregulation and the elimination of public services: Le Pen, Salvini, Farage. Combine that with Epstein and Thiel's gloating about \"finding things on their way to collapse&#8230;much easier than finding the next bargain,\" and it starts to feel like these guys are even happier with \"number eat shit\" than they are with \"number go up.\"</p>\n<p>Trump is the undisputed king of the Epstein class, and he seems determined to drive \"The Economy\" over a cliff. Take his tariff program, modeled on the McKinley tariffs of 1890, which led to the Panic of 1893, a financial crisis that saw one in four American workers forced into unemployment and 15,000 businesses into bankruptcy (that's a lot of distressed assets!):</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Panic_of_1893\">https://en.wikipedia.org/wiki/Panic_of_1893</a></p>\n<p>Then there's Trump's mass deportation program, which will force lots of businesses (farms, restaurants, etc) into bankruptcy, creating another massive pool of distressed assets. Trump's given ICE $75b, while the DoJ Antitrust Division and FTC (which protect Americans from corporate scams) have seen their budgets take a real-terms cut. The majority of DoJ lawyers and FBI agents are working on immigration cases (against workers, not employers, mind!). The Antitrust Division has $275m to fight all of America's corporate crime:</p>\n<p><a href=\"https://www.organizedmoney.fm/p/white-collar-crime-enforcement-in\">https://www.organizedmoney.fm/p/white-collar-crime-enforcement-in</a></p>\n<p>I'm not saying that Trump is <em>trying</em> to induce another massive economic crash. I'm saying, rather, that within his coalition there is a substantial bloc of powerful, wealthy people who are on the hunt for \"things on their way to collapse,\" and who are doubtless maneuvering to frustrate other Trump coalition members who are solely committed to \"number go up.\"</p>\n<p>Even the collapse of crypto creates lots of opportunities to \"buy the dip.\" Not the dip in crypto (crypto's going to zero), but the dip in all the <em>real</em> things people bought with <em>real</em> money they got by borrowing against their shitcoins.</p>\n<p>The thousand-plus children that Epstein lured to his island rape-camp were often \"distressed assets\" in their own right: Julie K Brown's groundbreaking reporting on Epstein for the <em>Miami Herald</em> described how he sought out children whose parents were poor, or neglectful, or both, on the grounds that those children would be \"on their way to collapse,\" too.</p>\n<p>The Epstein class's commitment to destroying \"The Economy\" makes sense when you understand that trashing civilization is \"much easier than finding the next bargain.\" They want to buy the dip, so they're creating the dip.</p>\n<p>They don't need the <em>whole</em> number to go up, just theirs. They know that inclusive economies are more prosperous for society <em>as a whole</em>, but it makes criminals and predators worse off. The New Deal kicked off a period of American economic growth never seen before or since, but the rich despised it, because a prosperous economy is one in which it gets harder and harder to find \"things on their way to collapse,\" and thus nearly impossible to \"find[] the next bargain.\"</p>\n<p>(<i>Image: <a href=\"https://commons.wikimedia.org/wiki/File:Peter_Thiel_(51876609719).jpg\">Gage Skidmore</a>, <a href=\"https://creativecommons.org/licenses/by-sa/3.0/deed.en\">CC BY-SA 3.0</a></i>)</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>RIP, Dave Farber <a href=\"https://seclists.org/nanog/2026/Feb/18\">https://seclists.org/nanog/2026/Feb/18</a></p>\n</li>\n<li>\n<p>Outlier and collapse: The enron corpus and foundation model training data <a href=\"https://journals.sagepub.com/doi/10.1177/20539517261421474\">https://journals.sagepub.com/doi/10.1177/20539517261421474</a></p>\n</li>\n<li>\n<p>You're Doing It Wrong: Notes on Criticism and Technology Hype <a href=\"https://peoples-things.ghost.io/youre-doing-it-wrong-notes-on-criticism-and-technology-hype/\">https://peoples-things.ghost.io/youre-doing-it-wrong-notes-on-criticism-and-technology-hype/</a></p>\n</li>\n<li>\n<p>How Big Cloud becomes Bigger: Scrutinizing Google, Microsoft, and Amazon's investments <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5377426\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5377426</a></p>\n</li>\n<li>\n<p>Go Left, Young Writers! <a href=\"https://jacobin.com/2026/02/new-masses-proletarian-literature-wright-gold/\">https://jacobin.com/2026/02/new-masses-proletarian-literature-wright-gold/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#retro\">permalink</a>)</h1>\n<p>#25yrsago Yours is a very bad hotel <a href=\"https://www.slideshare.net/slideshow/yours-is-a-very-bad-hotel/34583\">https://www.slideshare.net/slideshow/yours-is-a-very-bad-hotel/34583</a></p>\n<p>#20yrsago Kids refuse to sell candy after completing health unit <a href=\"https://web.archive.org/web/20060223010123/http://www.guardian.co.uk/worldlatest/story/0,,-5600588,00.html\">https://web.archive.org/web/20060223010123/http://www.guardian.co.uk/worldlatest/story/0,,-5600588,00.html</a></p>\n<p>#20yrsago Disneyland model recreates Yippie invasion of 1970 <a href=\"https://web.archive.org/web/20051228122604/http://dannysland.blogspot.com/2005/12/great-moments-in-disneyland-history.html\">https://web.archive.org/web/20051228122604/http://dannysland.blogspot.com/2005/12/great-moments-in-disneyland-history.html</a></p>\n<p>#20yrsago Canadian Red Cross wastes its money harassing video game makers <a href=\"https://web.archive.org/web/20060221020835/https://www.igniq.com/2006/02/canadian-red-cross-wants-its-logo-out.html\">https://web.archive.org/web/20060221020835/https://www.igniq.com/2006/02/canadian-red-cross-wants-its-logo-out.html</a></p>\n<p>#20yrsago How Yahoo/AOL’s email tax will hurt free speech <a href=\"https://web.archive.org/web/20060213175705/https://www.eff.org/deeplinks/archives/004398.php#004398\">https://web.archive.org/web/20060213175705/https://www.eff.org/deeplinks/archives/004398.php#004398</a></p>\n<p>#20yrsago Adbusters and the Economist have the same covers <a href=\"https://pieratt.com/odds/adbusters_vs_theeconomist.jpg\">https://pieratt.com/odds/adbusters_vs_theeconomist.jpg</a></p>\n<p>#20yrsago Head of British Vid Assoc: Piracy doesn’t hurt DVD sales <a href=\"http://news.bbc.co.uk/1/hi/entertainment/4691228.stm#6\">http://news.bbc.co.uk/1/hi/entertainment/4691228.stm#6</a></p>\n<p>#20yrsago Countries around the world rebelling against extreme copyright <a href=\"https://web.archive.org/web/20060629232414/http://www.michaelgeist.ca/index.php?option=com_content&amp;amp;task=view&amp;amp;id=1095\">https://web.archive.org/web/20060629232414/http://www.michaelgeist.ca/index.php?option=com_content&amp;amp;task=view&amp;amp;id=1095</a></p>\n<p>#20yrsago Web 1.0 logo-mosaic <a href=\"https://web.archive.org/web/20060506074530/https://www.complexify.com/buttons/\">https://web.archive.org/web/20060506074530/https://www.complexify.com/buttons/</a></p>\n<p>#15yrsago Is it legal to print Settlers of Catan tiles on a 3D printer? <a href=\"https://web.archive.org/web/20110131102845/https://publicknowledge.org/blog/3d-printing-settlers-catan-probably-not-illeg\">https://web.archive.org/web/20110131102845/https://publicknowledge.org/blog/3d-printing-settlers-catan-probably-not-illeg</a></p>\n<p>#15yrsago UK Tories get majority of funding from bankers <a href=\"https://www.theguardian.com/politics/2011/feb/08/tory-funds-half-city-banks-financial-sector\">https://www.theguardian.com/politics/2011/feb/08/tory-funds-half-city-banks-financial-sector</a></p>\n<p>#15yrsago Colorado Springs school bans kid who takes THC lozenges for neuro condition from attending because of “internal possession” <a href=\"https://www.coloradoindependent.com/2011/02/07/teens-medical-marijuana-fight-escalates-as-school-says-he-cannot-come-back-to-class-after-going-home-for-medicine/\">https://www.coloradoindependent.com/2011/02/07/teens-medical-marijuana-fight-escalates-as-school-says-he-cannot-come-back-to-class-after-going-home-for-medicine/</a></p>\n<p>#15yrsago Hamster-powered strandbeest walker <a href=\"https://crabfuartworks.blogspot.com/2011/02/hamster-powered-walker.html\">https://crabfuartworks.blogspot.com/2011/02/hamster-powered-walker.html</a></p>\n<p>#15yrsago Daytripper: wrenching existential graphic novel <a href=\"https://memex.craphound.com/2011/02/08/daytripper-wrenching-existential-graphic-novel/\">https://memex.craphound.com/2011/02/08/daytripper-wrenching-existential-graphic-novel/</a></p>\n<p>#15yrsago Pactuator: a mechanical, hand-cranked Pac-Man <a href=\"https://upnotnorth.net/projects/pac-machina/pactuator/\">https://upnotnorth.net/projects/pac-machina/pactuator/</a></p>\n<p>#15yrsago Floppy drive organ plays toccata www.youtube.com/watch?v=dmoDLyiQYKw</p>\n<p>#15yrsago Mike Mignola talks setting and architecture <a href=\"https://www.bldgblog.com/2011/02/ruin-space-and-shadow-an-interview-with-mike-mignola/\">https://www.bldgblog.com/2011/02/ruin-space-and-shadow-an-interview-with-mike-mignola/</a></p>\n<p>#15yrsago BBC to delete 172 unarchived sites, geek saves them for $3.99 <a href=\"https://web.archive.org/web/20110210152012/https://bengoldacre.posterous.com/nerd-saves-entire-bbc-archive-for-399-you-can\">https://web.archive.org/web/20110210152012/https://bengoldacre.posterous.com/nerd-saves-entire-bbc-archive-for-399-you-can</a></p>\n<p>#10yrsago Australia, the driest country on Earth, eliminates basic climate science research <a href=\"https://www.scientificamerican.com/article/australia-cuts-110-climate-scientist-jobs/\">https://www.scientificamerican.com/article/australia-cuts-110-climate-scientist-jobs/</a></p>\n<p>#10yrsago Copyright trolls who claimed to own “Happy Birthday” will pay $14M to their “customers” <a href=\"https://web.archive.org/web/20160210091717/http://consumerist.com/2016/02/09/happy-birthday-song-settlement-to-pay-out-14-million-to-people-who-paid-to-use-song/\">https://web.archive.org/web/20160210091717/http://consumerist.com/2016/02/09/happy-birthday-song-settlement-to-pay-out-14-million-to-people-who-paid-to-use-song/</a></p>\n<p>#10yrsago Eviction epidemic: the racialized, weaponized homes of America’s cities <a href=\"https://www.newyorker.com/magazine/2016/02/08/forced-out\">https://www.newyorker.com/magazine/2016/02/08/forced-out</a></p>\n<p>#10yrsago Association of German judges slams US-EU trade deal for its special corporate courts <a href=\"https://www.techdirt.com/2016/02/09/top-german-judges-tear-to-shreds-eus-proposed-tafta-ttip-investment-court-system/\">https://www.techdirt.com/2016/02/09/top-german-judges-tear-to-shreds-eus-proposed-tafta-ttip-investment-court-system/</a></p>\n<p>#10yrsago A digital, 3D printed sundial whose precise holes cast a shadow displaying the current time <a href=\"https://www.mojoptix.com/fr/2015/10/12/ep-001-cadran-solaire-numerique/\">https://www.mojoptix.com/fr/2015/10/12/ep-001-cadran-solaire-numerique/</a></p>\n<p>#10yrsago Jughead is asexual <a href=\"https://www.themarysue.com/jughead-asexuality/\">https://www.themarysue.com/jughead-asexuality/</a></p>\n<p>#10yrsago Vtech, having leaked 6.3m kids’ data, has a new EULA disclaiming responsibility for the next leak <a href=\"https://web.archive.org/web/20160210092704/https://motherboard.vice.com/read/hacked-toy-company-vtech-tos-now-says-its-not-liable-for-hacks\">https://web.archive.org/web/20160210092704/https://motherboard.vice.com/read/hacked-toy-company-vtech-tos-now-says-its-not-liable-for-hacks</a></p>\n<p>#10yrsago How America’s presidents started cashing out <a href=\"https://web.archive.org/web/20160208210036/https://theintercept.com/2016/02/08/taxpayers-give-big-pensions-to-ex-presidents-precisely-so-they-dont-have-to-sell-out/\">https://web.archive.org/web/20160208210036/https://theintercept.com/2016/02/08/taxpayers-give-big-pensions-to-ex-presidents-precisely-so-they-dont-have-to-sell-out/</a></p>\n<p>#10yrsago Bill criminalizing anal and oral sex passes Michigan Senate <a href=\"https://www.thenewcivilrightsmovement.com/2016/02/michigan_senate_passes_bill_saying_sodomy_is_a_felony/\">https://www.thenewcivilrightsmovement.com/2016/02/michigan_senate_passes_bill_saying_sodomy_is_a_felony/</a></p>\n<p>#10yrsago Hacker promises dump of data from 20K FBI and 9K DHS employees <a href=\"https://web.archive.org/web/20160208214013/https://motherboard.vice.com/read/hacker-plans-to-dump-alleged-details-of-20000-fbi-9000-dhs-employees\">https://web.archive.org/web/20160208214013/https://motherboard.vice.com/read/hacker-plans-to-dump-alleged-details-of-20000-fbi-9000-dhs-employees</a></p>\n<p>#10yrsago Blooks: functional objects disguised as books <a href=\"https://www.theguardian.com/books/2016/jan/30/blook-madness-inside-the-world-of-bogus-books\">https://www.theguardian.com/books/2016/jan/30/blook-madness-inside-the-world-of-bogus-books</a></p>\n<p>#10yrsago Indian regulator stands up for net neutrality, bans Facebook’s walled garden <a href=\"https://arstechnica.com/tech-policy/2016/02/facebooks-free-internet-app-banned-by-indias-new-net-neutrality-rule/\">https://arstechnica.com/tech-policy/2016/02/facebooks-free-internet-app-banned-by-indias-new-net-neutrality-rule/</a></p>\n<p>#10yrsago British spies want to be able to suck data out of US Internet giants <a href=\"https://www.washingtonpost.com/world/national-security/the-british-want-to-come-to-america--with-wiretap-orders-and-search-warrants/2016/02/04/b351ce9e-ca86-11e5-a7b2-5a2f824b02c9_story.html\">https://www.washingtonpost.com/world/national-security/the-british-want-to-come-to-america&#8211;with-wiretap-orders-and-search-warrants/2016/02/04/b351ce9e-ca86-11e5-a7b2-5a2f824b02c9_story.html</a></p>\n<p>#5yrsago Fleet Street calls out schtum Tories <a href=\"https://pluralistic.net/2021/02/09/permanent-record/#foia-uk\">https://pluralistic.net/2021/02/09/permanent-record/#foia-uk</a></p>\n<p>#5yrsago The ECB should forgive the debt it owes itself <a href=\"https://pluralistic.net/2021/02/09/permanent-record/#ecb\">https://pluralistic.net/2021/02/09/permanent-record/#ecb</a></p>\n<p>#5yrsago Favicons as undeletable tracking beacons <a href=\"https://pluralistic.net/2021/02/09/permanent-record/#supercookies\">https://pluralistic.net/2021/02/09/permanent-record/#supercookies</a></p>\n<p>#5yrsago Snowden's young adult memoir <a href=\"https://pluralistic.net/2021/02/09/permanent-record/#ya-snowden\">https://pluralistic.net/2021/02/09/permanent-record/#ya-snowden</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18<br />\n<a href=\"https://tanner.utah.edu/center-events/cory-doctorow/\">https://tanner.utah.edu/center-events/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#recent\">permalink</a>)</h1>\n<ul>\n<li>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n<li>\n<p>Why Big Tech is a Trap for Independent Creators (Stripper News)<br />\n<a href=\"https://www.youtube.com/watch?v=nmYDyz8AMZ0\">https://www.youtube.com/watch?v=nmYDyz8AMZ0</a></p>\n</li>\n<li>\n<p>Enshittification (Creative Nonfiction podcast)<br />\n<a href=\"https://brendanomeara.com/episode-507-enshittification-author-cory-doctorow-believes-in-a-new-good-internet/\">https://brendanomeara.com/episode-507-enshittification-author-cory-doctorow-believes-in-a-new-good-internet/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025</p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/09/sloppy-steve/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America ( words today, total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links The Epstein class and collapse porn: Buy the dip! Hey look at this: Delights to delectate. Object permanence: Web 1.0 logos; Legality of printing Catan tiles; Hamster strandbeest; Pactuator; Michican bans oral; Blooks; Yours is a very bad hotel; Yippie Disneyland invasion model; Floppy toccata; Happy Birthday trolls owe $14m; Jughead is ace; Snowden for teens. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep w",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Mon, 09 Feb 2026 10:29:37 +0000",
    "fetched_at": "2026-02-09T12:25:12.585615",
    "url_hash": "a49b353f217e1da22cf4a910711473aa"
  },
  {
    "title": "A Language For Agents",
    "link": "https://lucumr.pocoo.org/2026/2/9/a-language-for-agents/",
    "content": "<p>Last year I first started thinking about what the future of programming\nlanguages might look like now that agentic engineering is a growing thing.\nInitially I felt that the enormous corpus of pre-existing code would cement\nexisting languages in place but now I&#8217;m starting to think the opposite is true.\nHere I want to outline my thinking on why we are going to see more new\nprogramming languages and why there is quite a bit of space for interesting\ninnovation.  And just in case someone wants to start building one, here are some\nof my thoughts on what we should aim for!</p>\n<h2>Why New Languages Work</h2>\n<p>Does an agent perform dramatically better on a language that it has in its\nweights?  Obviously yes.  But there are less obvious factors that affect how\ngood an agent is at programming in a language: how good the tooling around it is\nand how much churn there is.</p>\n<p>Zig seems underrepresented in the weights (at least in the models I&#8217;ve used)\nand also changing quickly.  That combination is not optimal, but it&#8217;s still\npassable: you can program even in the upcoming Zig version if you point the\nagent at the right documentation.  But it&#8217;s not great.</p>\n<p>On the other hand, some languages are well represented in the weights but agents\nstill don&#8217;t succeed as much because of tooling choices.  Swift is a good\nexample: in my experience the tooling around building a Mac or iOS application\ncan be so painful that agents struggle to navigate it.  Also not great.</p>\n<p>So, just because it exists doesn&#8217;t mean the agent succeeds and just because it&#8217;s\nnew also doesn&#8217;t mean that the agent is going to struggle.  I&#8217;m convinced that\nyou can build yourself up to a new language if you don&#8217;t want to depart\neverywhere all at once.</p>\n<p>The biggest reason new languages might work is that the cost of coding is going\ndown dramatically.  The result is the breadth of an ecosystem matters less. I&#8217;m\nnow routinely reaching for JavaScript in places where I would have used Python.\nNot because I love it or the ecosystem is better, but because the agent does\nmuch better with TypeScript.</p>\n<p>The way to think about this: if important functionality is missing in my\nlanguage of choice, I just point the agent at a library from a different\nlanguage and have it build a port.  As a concrete example, I recently built an\nEthernet driver in JavaScript to implement the host controller for our sandbox.\nImplementations exist in Rust, C, and Go, but I wanted something pluggable and\ncustomizable in JavaScript.  It was easier to have the agent reimplement it than\nto make the build system and distribution work against a native binding.</p>\n<p>New languages will work if their value proposition is strong enough and they\nevolve with knowledge of how LLMs train.  People will adopt them despite being\nunderrepresented in the weights.  And if they are designed to work well with\nagents, then they might be designed around familiar syntax that is already known\nto work well.</p>\n<h2>Why A New Language?</h2>\n<p>So why would we want a new language at all?  The reason this is interesting to\nthink about is that many of today&#8217;s languages were designed with the assumption\nthat punching keys is laborious, so we traded certain things for brevity.  As an\nexample, many languages — particular modern ones — lean heavily on type\ninference so that you don&#8217;t have to write out types.  The downside is that you\nnow need an LSP or the resulting compiler error messages to figure out what the\ntype of an expression is.  Agents struggle with this too, and it&#8217;s also\nfrustrating in pull request review where complex operations can make it very\nhard to figure out what the types actually are.  Fully dynamic languages are\neven worse in that regard.</p>\n<p>The cost of writing code is going down, but because we are also producing more\nof it, understanding what the code does is becoming more important.  We might\nactually want more code to be written if it means there is less ambiguity when\nwe perform a review.</p>\n<p>I also want to point out that we are heading towards a world where some code is\nnever seen by a human and is only consumed by machines.  Even in that case, we\nstill want to give an indication to a user, who is potentially a non-programmer,\nabout what is going on.  We want to be able to explain to a user what the code\nwill do without going into the details of how.</p>\n<p>So the case for a new language comes down to: given the fundamental changes in\nwho is programming and what the cost of code is, we should at least consider\none.</p>\n<h2>What Agents Want</h2>\n<p>It&#8217;s tricky to say what an agent wants because agents will lie to you and they\nare influenced by all the code they&#8217;ve seen.  But one way to estimate how they\nare doing is to look at how many changes they have to perform on files and how\nmany iterations they need for common tasks.</p>\n<p>There are some things I&#8217;ve found that I think will be true for a while.</p>\n<h3>Context Without LSP</h3>\n<p>The language server protocol lets an IDE infer information about what&#8217;s under\nthe cursor or what should be autocompleted based on semantic knowledge of the\ncodebase.  It&#8217;s a great system, but it comes at one specific cost that is tricky\nfor agents: the LSP has to be running.</p>\n<p>There are situations when an agent just won&#8217;t run the LSP — not because of\ntechnical limitations, but because it&#8217;s also lazy and will skip that step if it\ndoesn&#8217;t have to.  If you give it an example from documentation, there is no easy\nway to run the LSP because it&#8217;s a snippet that might not even be complete.  If\nyou point it at a GitHub repository and it pulls down individual files, it will\njust look at the code.  It won&#8217;t set up an LSP for type information.</p>\n<p>A language that doesn&#8217;t split into two separate experiences (with-LSP and\nwithout-LSP) will be beneficial to agents because it gives them one unified way\nof working across many more situations.</p>\n<h3>Braces, Brackets, and Parentheses</h3>\n<p>It pains me as a Python developer to say this, but whitespace-based indentation\nis a problem.  The underlying token efficiency of getting whitespace right is\ntricky, and a language with significant whitespace is harder for an LLM to work\nwith.  This is particularly noticeable if you try to make an LLM do surgical\nchanges without an assisted tool.  Quite often they will intentionally disregard\nwhitespace, add markers to enable or disable code and then rely on a code\nformatter to clean up indentation later.</p>\n<p>On the other hand, braces that are not separated by whitespace can cause issues\ntoo.  Depending on the tokenizer, runs of closing parentheses can end up split\ninto tokens in surprising ways (a bit like the &#8220;strawberry&#8221; counting problem),\nand it&#8217;s easy for an LLM to get Lisp or Scheme wrong because it loses track of\nhow many closing parentheses it has already emitted or is looking at.  Fixable\nwith future LLMs?  Sure, but also something that was hard for humans to get\nright too without tooling.</p>\n<h3>Flow Context But Explicit</h3>\n<p>Readers of this blog might know that I&#8217;m a huge believer in async locals and\nflow execution context — basically the ability to carry data through every\ninvocation that might only be needed many layers down the call chain.  Working\nat an observability company has really driven home the importance of this for\nme.</p>\n<p>The challenge is that anything that flows implicitly might not be configured.\nTake for instance the current time.  You might want to implicitly pass a timer\nto all functions.  But what if a timer is not configured and all of a sudden a\nnew dependency appears?  Passing all of it explicitly is tedious for both humans\nand agents and bad shortcuts will be made.</p>\n<p>One thing I&#8217;ve experimented with is having effect markers on functions that are\nadded through a code formatting step.  A function can declare that it needs the\ncurrent time or the database, but if it doesn&#8217;t mark this explicitly, it&#8217;s\nessentially a linting warning that auto-formatting fixes.  The LLM can start\nusing something like the current time in a function and any existing caller gets\nthe warning; formatting propagates the annotation.</p>\n<p>This is nice because when the LLM builds a test, it can precisely mock out\nthese side effects — it understands from the error messages what it has to\nsupply.</p>\n<p>For instance:</p>\n<div class=\"highlight\"><pre><span></span><span class=\"k\">fn</span><span class=\"w\"> </span><span class=\"nf\">issue</span><span class=\"p\">(</span><span class=\"n\">sub</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"nc\">UserId</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">scopes</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"p\">[]</span><span class=\"n\">Scope</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"p\">-&gt;</span><span class=\"w\"> </span><span class=\"nc\">Token</span>\n<span class=\"w\">    </span><span class=\"n\">needs</span><span class=\"w\"> </span><span class=\"p\">{</span><span class=\"w\"> </span><span class=\"n\">time</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">rng</span><span class=\"w\"> </span><span class=\"p\">}</span>\n<span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"k\">return</span><span class=\"w\"> </span><span class=\"n\">Token</span><span class=\"p\">{</span>\n<span class=\"w\">        </span><span class=\"n\">sub</span><span class=\"p\">,</span>\n<span class=\"w\">        </span><span class=\"n\">exp</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"nc\">time</span><span class=\"p\">.</span><span class=\"n\">now</span><span class=\"p\">().</span><span class=\"n\">add</span><span class=\"p\">(</span><span class=\"mi\">24</span><span class=\"n\">h</span><span class=\"p\">),</span>\n<span class=\"w\">        </span><span class=\"n\">scopes</span><span class=\"p\">,</span>\n<span class=\"w\">    </span><span class=\"p\">}</span>\n<span class=\"p\">}</span>\n\n<span class=\"n\">test</span><span class=\"w\"> </span><span class=\"s\">&quot;issue creates exp in the future&quot;</span><span class=\"w\"> </span><span class=\"p\">{</span>\n<span class=\"w\">    </span><span class=\"n\">using</span><span class=\"w\"> </span><span class=\"n\">time</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">time</span><span class=\"p\">.</span><span class=\"n\">fixed</span><span class=\"p\">(</span><span class=\"s\">&quot;2026-02-06T23:00:00Z&quot;</span><span class=\"p\">);</span>\n<span class=\"w\">    </span><span class=\"n\">using</span><span class=\"w\"> </span><span class=\"n\">rng</span><span class=\"w\">  </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">rng</span><span class=\"p\">.</span><span class=\"n\">deterministic</span><span class=\"p\">(</span><span class=\"n\">seed</span><span class=\"p\">:</span><span class=\"w\"> </span><span class=\"mi\">1</span><span class=\"p\">);</span>\n\n<span class=\"w\">    </span><span class=\"kd\">let</span><span class=\"w\"> </span><span class=\"n\">t</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">issue</span><span class=\"p\">(</span><span class=\"n\">user</span><span class=\"p\">(</span><span class=\"s\">&quot;u1&quot;</span><span class=\"p\">),</span><span class=\"w\"> </span><span class=\"p\">[</span><span class=\"s\">&quot;read&quot;</span><span class=\"p\">]);</span>\n<span class=\"w\">    </span><span class=\"n\">assert</span><span class=\"p\">(</span><span class=\"n\">t</span><span class=\"p\">.</span><span class=\"n\">exp</span><span class=\"w\"> </span><span class=\"o\">&gt;</span><span class=\"w\"> </span><span class=\"n\">time</span><span class=\"p\">.</span><span class=\"n\">now</span><span class=\"p\">());</span>\n<span class=\"p\">}</span>\n</pre></div>\n<h3>Results over Exceptions</h3>\n<p>Agents struggle with exceptions, they are afraid of them.  I&#8217;m not sure to what\ndegree this is solvable with RL (Reinforcement Learning), but right now agents\nwill try to catch everything they can, log it, and do a pretty poor recovery.\nGiven how little information is actually available about error paths, that makes\nsense.  Checked exceptions are one approach, but they propagate all the way up\nthe call chain and don&#8217;t dramatically improve things.  Even if they end up as\nhints where a linter tracks which errors can fly by, there are still many call\nsites that need adjusting.  And like the auto-propagation proposed for context\ndata, it might not be the right solution.</p>\n<p>Maybe the right approach is to go more in on typed results, but that&#8217;s still\ntricky for composability without a type and object system that supports it.</p>\n<h3>Minimal Diffs and Line Reading</h3>\n<p>The general approach agents use today to read files into memory is line-based,\nwhich means they often pick chunks that span multi-line strings.  One easy way\nto see this fall apart: have an agent work on a 2000-line file that also\ncontains long embedded code strings — basically a code generator.  The agent\nwill sometimes edit within a multi-line string assuming it&#8217;s the real code when\nit&#8217;s actually just embedded code in a multi-line string.  For multi-line\nstrings, the only language I&#8217;m aware of with a good solution is Zig, but its\nprefix-based syntax is pretty foreign to most people.</p>\n<p>Reformatting also often causes constructs to move to different lines.  In many\nlanguages, trailing commas in lists are either not supported (JSON) or not\ncustomary.  If you want diff stability, you&#8217;d aim for a syntax that requires\nless reformatting and mostly avoids multi-line constructs.</p>\n<h3>Make It Greppable</h3>\n<p>What&#8217;s really nice about Go is that you mostly cannot import symbols from\nanother package into scope without every use being prefixed with the package\nname.  Eg: <code>context.Context</code> instead of <code>Context</code>.  There are escape hatches\n(import aliases and dot-imports), but they&#8217;re relatively rare and usually\nfrowned upon.</p>\n<p>That dramatically helps an agent understand what it&#8217;s looking at.  In general,\nmaking code findable through the most basic tools is great — it works with\nexternal files that aren&#8217;t indexed, and it means fewer false positives for\nlarge-scale automation driven by code generated on the fly (eg: <code>sed</code>, <code>perl</code>\ninvocations).</p>\n<h3>Local Reasoning</h3>\n<p>Much of what I&#8217;ve said boils down to: agents really like local reasoning.  They\nwant it to work in parts because they often work with just a few loaded files in\ncontext and don&#8217;t have much spatial awareness of the codebase.  They rely on\nexternal tooling like grep to find things, and anything that&#8217;s hard to grep or\nthat hides information elsewhere is tricky.</p>\n<h3>Dependency Aware Builds</h3>\n<p>What makes agents fail or succeed in many languages is just how good the build\ntools are.  Many languages make it very hard to determine what actually needs to\nrebuild or be retested because there are too many cross-references.  Go is\nreally good here: it forbids circular dependencies between packages (import\ncycles), packages have a clear layout, and test results are cached.</p>\n<h2>What Agents Hate</h2>\n<h3>Macros</h3>\n<p>Agents often struggle with macros.  It was already pretty clear that humans\nstruggle with macros too, but the argument for them was mostly that code\ngeneration was a good way to have less code to write.  Since that is less of a\nconcern now, we should aim for languages with less dependence on macros.</p>\n<p>There&#8217;s a separate question about generics and\n<a href=\"https://zig.guide/language-basics/comptime/\">comptime</a>.  I think they fare\nsomewhat better because they mostly generate the same structure with different\nplaceholders and it&#8217;s much easier for an agent to understand that.</p>\n<h3>Re-Exports and Barrel Files</h3>\n<p>Related to greppability: agents often struggle to understand <a href=\"https://tkdodo.eu/blog/please-stop-using-barrel-files\">barrel\nfiles</a> and they don&#8217;t\nlike them.  Not being able to quickly figure out where a class or function comes\nfrom leads to imports from the wrong place, or missing things entirely and\nwasting context by reading too many files.  A one-to-one mapping from where\nsomething is declared to where it&#8217;s imported from is great.</p>\n<p>And it does not have to be overly strict either.  Go kind of goes this way, but\nnot too extreme.  Any file within a directory can define a function, which isn&#8217;t\noptimal, but it&#8217;s quick enough to find and you don&#8217;t need to search too far.\nIt works because packages are forced to be small enough to find everything with\ngrep.</p>\n<p>The worst case is free re-exports all over the place that completely decouple\nthe implementation from any trivially reconstructable location on disk.  Or\nworse: aliasing.</p>\n<h3>Aliasing</h3>\n<p>Agents often hate it when aliases are involved.  In fact, you can get them to\neven complain about it in thinking blocks if you let them refactor something\nthat uses lots of aliases.  Ideally a language encourages good naming and\ndiscourages aliasing at import time as a result.</p>\n<h3>Flaky Tests and Dev Env Divergence</h3>\n<p>Nobody likes flaky tests, but agents even less so.  Ironic given how\nparticularly good agents are at creating flaky tests in the first place.  That&#8217;s\nbecause agents currently love to mock and most languages do not support mocking\nwell.  So many tests end up accidentally not being concurrency safe or depend on\ndevelopment environment state that then diverges in CI or production.</p>\n<p>Most programming languages and frameworks make it much easier to write flaky\ntests than non-flaky ones.  That&#8217;s because they encourage indeterminism\neverywhere.</p>\n<h3>Multiple Failure Conditions</h3>\n<p>In an ideal world the agent has one command, that lints and compiles and it\ntells the agent if all worked out fine.  Maybe another command to run all tests\nthat need running.  In practice most environments don&#8217;t work like this.  For\ninstance in TypeScript you can often run the code even <a href=\"/2025/8/4/shitty-types/\">though it fails\ntype checks</a>.  That can gaslight the agent.  Likewise\ndifferent bundler setups can cause one thing to succeed just for a slightly\ndifferent setup in CI to fail later.  The more uniform the tooling the better.</p>\n<p>Ideally it either runs or doesn&#8217;t and there is mechanical fixing for as many\nlinting failures as possible so that the agent does not have to do it by hand.</p>\n<h2>Will We See New Languages?</h2>\n<p>I think we will.  We are writing more software now than we ever have — more\nwebsites, more open source projects, more of everything.  Even if the ratio of\nnew languages stays the same, the absolute number will go up.  But I also truly\nbelieve that many more people will be willing to rethink the foundations of\nsoftware engineering and the languages we work with.  That&#8217;s because while for\nsome years it has felt you need to build a lot of infrastructure for a language\nto take off, now you can target a rather narrow use case: make sure the agent is\nhappy and extend from there to the human.</p>\n<p>I just hope we see two things.  First, some outsider art: people who haven&#8217;t\nbuilt languages before trying their hand at it and showing us new things.\nSecond, a much more deliberate effort to document what works and what doesn&#8217;t\nfrom first principles.  We have actually learned a lot about what makes good\nlanguages and how to scale software engineering to large teams.  Yet,  finding\nit written down, as a consumable overview of good and bad language design, is\nvery hard to come by.  Too much of it has been shaped by opinion on rather\npointless things instead of hard facts.</p>\n<p>Now though, we are slowly getting to the point where facts matter more, because\nyou can actually measure what works by seeing how well agents perform with it.\nNo human wants to be subject to surveys, but <a href=\"/2025/6/17/measuring/\">agents don&#8217;t\ncare</a>.  We can see how successful they are and where they\nare struggling.</p>\n",
    "description": "",
    "is_fulltext": true,
    "source": "Armin Ronacher's Thoughts and Writings",
    "pub_date": "2026-02-09T00:00:00+00:00",
    "fetched_at": "2026-02-09T12:25:18.705116",
    "url_hash": "77a0e78a77640398b08f4283386f35d4"
  },
  {
    "title": "The pitch deck is dead. Write a pitch.md instead.",
    "link": "https://www.joanwestenberg.com/the-pitch-deck-is-dead-write-a-pitch-md-instead/",
    "content": "<img src=\"https://www.joanwestenberg.com/content/images/2026/02/ilya-pavlov-hXrPSgGFpqQ-unsplash.jpg\" alt=\"The pitch deck is dead. Write a pitch.md instead.\"><p>Every week, thousands of founders open Canva or Google Slides or, God help them, PowerPoint, and begin the ritual. They agonize over fonts. They nudge logos three pixels to the left. They workshop whether the TAM slide should come before or after the team slide, as though the ordering of these particular runes determines whether capital flows // doesn&apos;t. They search &quot;pitch deck template YC&quot; and download something that looks exactly like every other deck built from a template found by searching &quot;pitch deck template YC.&quot; They use Claude Opus to generate slide decks, or Gamma to beautify scripts.</p><p>And it&apos;s a near-pointless activity.</p><p>I&apos;ve sat through hundreds of pitches at this point and I can tell you with some confidence that the &quot;quality&quot; of the deck is inversely correlated with the quality of the thinking behind it.</p><p>William Zinsser argued in <em>On Writing Well</em> that the act of writing forces clarity - because you can&apos;t write a clear sentence about a thing you don&apos;t understand. The principle applies to startup pitches. I&apos;ve met founders who could deliver a flawless twenty-minute deck, who completely fall apart when asked to write two paragraphs explaining their competitive advantage.</p><p>The deck was performance, and the writing would have been proof.</p><p>Pitch decks are a format optimized for the wrong thing. The entire medium is built around a synchronous, performative moment, and that moment, as it turns out, is a shit way to evaluate whether a business makes sense.</p><p>But we keep using them.</p><p><em>why</em>?</p><p>Part of the reason: venture ecosystem runs on pattern-matching, and the 10-slide deck is a pattern everyone recognizes. Funds have intake processes built around decks. Analysts have workflows for reviewing them. Entire cottage industries exist for deck design, deck feedback, deck optimization. The pitch deck is load-bearing infrastructure in a system that doesn&apos;t love change.</p><p>But the deeper reason is that nobody has proposed a credible replacement, a format that carries the same information with less artifice and more signal. I&apos;d argue there&apos;s an obvious one.</p><p>Write a <code>pitch.md</code> file instead.</p><p>A plain markdown file. The argument for why your company should exist, written in plain text, structured with headers, readable by humans and machines alike - readable in a terminal if it comes to that.</p><p>Make it live in a repository next to your actual code, your README, your documentation. In the McLuhan sense, the medium&apos;s message is: _this company builds things and writes things down clearly.</p><p>Writing and thinking are functionally the same activity, or close enough that the distinction doesn&apos;t matter. When you build a pitch deck, you&apos;re arranging fragments. A bullet point here, a chart there, a big number on a slide by itself for dramatic effect. The format actively discourages connected reasoning. You don&apos;t have to build an argument that flows from one paragraph to the next because you don&apos;t have paragraphs. You have slides, and slides are designed to be self-contained units of impression. The result is that pitch decks test your ability to create impressions, which is a real skill but not the skill that determines whether your business will work.</p><p>Writing a pitch.md forces you to make the connections explicit. If your market analysis doesn&apos;t logically lead to your product thesis, you can&apos;t hide that gap behind a slide transition. The gap sits there on the page, visible // embarrassing // useful.</p><p>Markdown is the native format of the people you&apos;re actually trying to reach. The best technical investors I know, the ones at the firms that reliably pick winners, don&apos;t want to sit through your deck.</p><p>AI tools parse markdown trivially. A VC running deal flow through any Claude Code // literally any automated pipeline (and most serious funds are building these pipelines right now) can ingest a pitch.md, cross-reference it against a live repo, check claims against observable data, and surface inconsistencies in seconds.</p><p>The deck was created for human eyeballs scanning in three minutes and forty-four seconds. A pitch.md file is for a world where the first reader might not be human at all, and where the second reader, the partner who actually writes checks, wants substance they can verify rather than styling they can admire.</p><p>They want to read something. They want to forward something to their partner with a note that says &quot;read this, what do you think.&quot; A pdf of your Keynote presentation is a terrible artifact for that purpose. It&apos;s bloated, it&apos;s archaic, half the slides don&apos;t make sense if you ignore the meaningless diagrams, and nobody is going to read thirty fucking slides on their phone while waiting for coffee anyway. A markdown file is small, format-independent, and (this matters more than people realise) greppable.</p><p>It&apos;s honest too, for whatever that&apos;s worth. Markdown strips away the ability to design your way out of a weak argument. In a deck, you can make a questionable claim feel authoritative by putting it in 72-point Helvetica on a dark background with a lot of whitespace. In a markdown file, a questionable claim looks like exactly what it is: a sentence that needs to be better.</p><p>The format is a forcing function for rigor.</p><p>If you can&apos;t explain your idea clearly in writing, you probably can&apos;t explain it clearly at all, and if you can&apos;t explain it clearly at all, you probaly don&apos;t understand it well enough to build it.</p><p>If you haven&apos;t written your pitch as a plain document, as words on a page making an argument, you&apos;re skipping the hardest and most valuable part of the process. In my experience, the founders who&apos;ve done that homework give better pitches anyway, because they actually know what they&apos;re talking about, and that comes through regardless of whether your slides have drop shadows.</p><p>Write the pitch.md first. You might find you don&apos;t need the deck at all, or you might find that when you do build the deck, it&apos;s better, because you finally know what you&apos;re trying to say.</p>",
    "description": "Every week, thousands of founders open Canva or Google Slides or, God help them, PowerPoint, and begin the ritual. They agonize over fonts. They nudge logos three pixels to the left. They workshop whether the TAM slide should come before or after the team slide, as though the ordering of",
    "is_fulltext": true,
    "source": "Westenberg.",
    "pub_date": "Mon, 09 Feb 2026 06:49:33 GMT",
    "fetched_at": "2026-02-09T12:25:37.279657",
    "url_hash": "45ba5a83b70ff4c6492125b4b229f8eb"
  },
  {
    "title": "Package Manager Podcast Episodes",
    "link": "https://nesbitt.io/2026/02/09/package-manager-podcast-episodes.html",
    "content": "<p>Like the <a href=\"/2026/01/09/package-management-blog-posts.html\">blog posts</a> and <a href=\"/2025/11/13/package-management-papers.html\">papers</a> collections, this is a running list of podcast episodes where people who build and maintain package managers talk about their work. Grouped by ecosystem, with a few cross-cutting episodes at the end.</p>\n\n<p>The Manifest (<a href=\"https://manifest.fm\">manifest.fm</a>) is a podcast dedicated entirely to package management, hosted by Alex Pounds and me. I’ve listed its episodes under the relevant ecosystems below rather than in a separate section.</p>\n\n<h2 id=\"javascript--typescript\">JavaScript / TypeScript</h2>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/052-jsj-node-npm-with-isaac-schlueter\">JavaScript Jabber #052: Node npm</a></strong> (Isaac Schlueter, 2013). Early discussion of npm’s role in the Node ecosystem, semantic versioning, and module discovery.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/101\">The Changelog #101: npm Origins and Node.js</a></strong> (Isaac Schlueter, 2013). npm’s creator on its origins and how to get paid to do open source.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/099-jsj-npm-inc-with-isaac-schlueter-laurie-voss-and-rod-boothby\">JavaScript Jabber #099: npm, Inc.</a></strong> (Isaac Schlueter, Laurie Voss, and Rod Boothby, 2014). The founding of npm, Inc. and turning a community project into a company.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/127-jsj-changes-in-npm-land-with-forrest-norvell-rebecca-turner-ben-coe-and-isaac-z-schlueter\">JavaScript Jabber #127: Changes in npm Land</a></strong> (Forrest Norvell, Rebecca Turner, Ben Coe, and Isaac Schlueter, 2014). The full npm team on what was changing inside the registry and CLI.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/174-jsj-npm-3-with-rebecca-turner-and-forrest-norvell\">JavaScript Jabber #174: npm 3</a></strong> (Rebecca Turner and Forrest Norvell, 2015). The npm tech lead on npm 3’s changes to dependency tree flattening.</p>\n\n<p><strong><a href=\"https://javascriptair.com/episodes/2016-11-02-bonus/\">JavaScript Air #047: Yarn</a></strong> (Sebastian McKenzie, Konstantin Raev, Yehuda Katz, and Christoph Pojer, 2016). The original Yarn team explaining why they built it, recorded right after launch.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/jsj-266-npm-5-0-with-rebecca-turner\">JavaScript Jabber #266: npm 5.0</a></strong> (Rebecca Turner, 2017). npm 5’s lockfile, performance improvements, and the design decisions behind them.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/jsj-294-node-security-with-adam-baldwin\">JavaScript Jabber #294: Node Security</a></strong> (Adam Baldwin, 2018). The Node Security Platform, dependency vulnerabilities, and integrating security into npm workflows.</p>\n\n<p><strong><a href=\"https://changelog.com/founderstalk/61\">Founders Talk #61: Building npm and Hiring a CEO</a></strong> (Isaac Schlueter, 2019). Isaac on the journey of hiring his successor and the business side of running npm.</p>\n\n<p><strong><a href=\"https://undefined.fm/radio/the-future-of-javascript-tooling-with-sebastian-mckenzie\">The Undefined Podcast: The Future of JavaScript Tooling</a></strong> (Sebastian McKenzie, 2019). The Babel and Yarn creator on open source burnout, working at Facebook, and the Rome project.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/326\">The Changelog #326: The event-stream compromise</a></strong> (Dominic Tarr, 2018). The maintainer whose package was hijacked explains how it happened. The best incident postmortem in podcast form.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/jsj-357-event-stream-package-vulnerabilities-with-richard-feldman-and-hillel-wayne\">JavaScript Jabber #357: event-stream Package Vulnerabilities</a></strong> (Richard Feldman and Hillel Wayne, 2019). The event-stream attack from the community’s perspective, and whether paying maintainers would improve security.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/355\">The Changelog #355: The Economics of Open Source</a></strong> (CJ Silverio, 2019). npm’s former CTO on who owns the JavaScript commons, VC-funded registries, and the Entropic federated alternative.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/jsj-366-npm-with-mikeal-rogers\">JavaScript Jabber #366: npm</a></strong> (Mikeal Rogers, 2019). Node.js history, alternate CLIs, Pika, import maps, and where package management was heading.</p>\n\n<p><strong><a href=\"https://manifest.fm/9\">The Manifest #9: Typosquatting</a></strong> (Adam Baldwin). Security in npm, typosquatting attacks, and what exploits look like in practice.</p>\n\n<p><strong><a href=\"https://podrocket.logrocket.com/pnpm\">PodRocket: What makes pnpm performant</a></strong> (Zoltan Kochan, 2022). pnpm’s creator on its content-addressable store and symlink architecture.</p>\n\n<p><strong><a href=\"https://www.devtools.fm/episode/154\">devtools.fm #154: pnpm and the Future of Package Management</a></strong> (Zoltan Kochan). How pnpm revolutionized dependency installation in the JavaScript ecosystem.</p>\n\n<p><strong><a href=\"https://softwareengineeringdaily.com/2025/09/18/pnpm-with-zoltan-kochan/\">Software Engineering Daily: pnpm</a></strong> (Zoltan Kochan, 2025). pnpm’s background and where package management in the web is heading.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/443\">The Changelog #443: Exploring Deno Land</a></strong> (Ryan Dahl, 2021). Only Ryan Dahl’s second podcast appearance. Covers the full arc from Node regrets to Deno.</p>\n\n<p><strong><a href=\"https://syntax.fm/show/737/jsr-the-new-typescript-package-registry-npm-killer\">Syntax #737: JSR: The New TypeScript Package Registry</a></strong> (Luca Casonato, 2024). JSR’s design as an ESM-only, TypeScript-first registry that complements npm.</p>\n\n<p><strong><a href=\"https://syntax.fm/show/815/deno-2-with-ryan-dahl\">Syntax #815: Deno 2</a></strong> (Ryan Dahl, 2024). Deno 2’s npm package support, web standards, and framework integration.</p>\n\n<p><strong><a href=\"https://changelog.com/jsparty/282\">JS Party #282: The massive bug at the heart of npm</a></strong> (Darcy Clarke, 2023). A deep technical disclosure of an integrity bug in the npm registry.</p>\n\n<p><strong><a href=\"https://syntax.fm/show/688/ex-npm-employee-making-a-new-package-manager-vlt-with-darcy-clarke\">Syntax #688: vlt with Darcy Clarke</a></strong> (Darcy Clarke). Darcy introduces vlt, a next-generation package manager and registry.</p>\n\n<p><strong><a href=\"https://changelog.com/jsparty/295\">JS Party #295: Reflecting on Bun’s big launch</a></strong> (Jarred Sumner, 2023). Bun 1.0, its relationship to Node, and how a VC-backed startup sustains an open source runtime.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/supply-chain-security-part-1-jsj-524\">JavaScript Jabber #524: Supply Chain Security, Part 1</a></strong> (Feross Aboukhadijeh, 2022). Malware trends targeting npm dependencies and how Socket detects them beyond traditional vulnerability scanning.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/javascript-jabber/supply-chain-security-part-2-jsj-525\">JavaScript Jabber #525: Supply Chain Security, Part 2</a></strong> (Feross Aboukhadijeh, 2022). Continued discussion on shifting mindsets around dependencies and understanding dependency lifecycle management.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/482\">The Changelog #482: Securing the open source supply chain</a></strong> (Feross Aboukhadijeh). Socket’s launch and the broader problem of npm supply chain security.</p>\n\n<h2 id=\"python\">Python</h2>\n\n<p><strong><a href=\"https://www.pythonpodcast.com/episodepage/episode-54-pip-and-the-python-package-authority-with-donald-stufft\">Podcast.__init__ #54: Pip and the Python Package Authority</a></strong> (Donald Stufft, 2016). pip and PyPI’s primary maintainer on the work involved in keeping them running.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/64/inside-the-python-package-index\">Talk Python To Me #64: Inside the Python Package Index</a></strong> (Donald Stufft, 2016). PyPI handling over 300 TB of traffic per month and the infrastructure behind it.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/159/inside-the-new-pypi-launch\">Talk Python To Me #159: Inside the new PyPI launch</a></strong> (Nicole Harris, Ernest Durbin III, and Dustin Ingram, 2018). The launch of pypi.org replacing the legacy system after 15+ years.</p>\n\n<p><strong><a href=\"https://www.pythonpodcast.com/episodepage/pip-resolver-dependency-management-episode-264\">Podcast.__init__ #264: Dependency Management Improvements in Pip’s Resolver</a></strong> (Pradyun Gedam, Tzu-ping Chung, and Paul Moore, 2020). The new pip dependency resolver, its design, and the challenge of writing good error messages.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/377/python-packaging-and-pypi-in-2022\">Talk Python To Me #377: Python Packaging and PyPI in 2022</a></strong> (Dustin Ingram, 2022). 2FA rollout, securing the supply chain, and the state of PyPI.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/406/reimagining-pythons-packaging-workflows\">Talk Python To Me #406: Reimagining Python’s Packaging Workflows</a></strong> (Steve Dower, Pradyun Gedam, Ofek Lev, and Paul Moore, 2023). How the packaging landscape expanded with Poetry, Hatch, PDM, and others.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/453/uv-the-next-evolution-in-python-packages\">Talk Python To Me #453: uv - The Next Evolution in Python Packages?</a></strong> (Charlie Marsh, 2024). uv’s initial launch as a pip replacement.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/660\">The Changelog #660: Reinventing Python tooling with Rust</a></strong> (Charlie Marsh, 2025). Why Python, why Rust, how Astral makes everything fast.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/476/unified-python-packaging-with-uv\">Talk Python To Me #476: Unified Python packaging with uv</a></strong> (Charlie Marsh, 2024). uv’s expansion from pip replacement to full project manager.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/520/pyx-the-other-side-of-the-uv-coin-announcing-pyx\">Talk Python To Me #520: pyx - the other side of the uv coin</a></strong> (Charlie Marsh, 2025). Astral’s Python-native package registry and how it complements PyPI.</p>\n\n<p><strong><a href=\"https://se-radio.net/2024/06/se-radio-622-wolf-vollprecht-on-python-tooling-in-rust/\">SE Radio #622: Wolf Vollprecht on Python Tooling in Rust</a></strong> (Wolf Vollprecht, 2024). Mamba and Pixi, building Python infrastructure in Rust.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/439/pixi-a-fast-package-manager\">Talk Python To Me #439: Pixi, A Fast Package Manager</a></strong> (Wolf Vollprecht and Ruben Arts, 2023). Pixi’s high-performance package management with full conda compatibility.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/115/python-for-humans-projects\">Talk Python To Me #115: Python for Humans projects</a></strong> (Kenneth Reitz, 2017). Requests, pipenv, and the philosophy behind them.</p>\n\n<p><strong><a href=\"https://www.pythonshow.com/p/41-python-packaging-and-foss-with\">The Python Show #41: Python Packaging and FOSS with Armin Ronacher</a></strong> (Armin Ronacher, 2024). The creator of Flask and Rye on the state of Python packaging and open source sustainability.</p>\n\n<p><strong><a href=\"https://opensourcesecurity.io/2024/10/20/episode-451-python-security-with-seth-larson/\">Open Source Security Podcast: Python security with Seth Larson</a></strong> (Seth Larson, 2024). What happens when open source developers are paid to do security work.</p>\n\n<p><strong><a href=\"https://talkpython.fm/episodes/show/435/pypi-security\">Talk Python To Me #435: PyPI Security</a></strong> (Mike Fiedler, 2023). PyPI’s safety and security engineer on malware detection, trusted publishers, and the 2FA mandate for all publishers.</p>\n\n<h2 id=\"ruby\">Ruby</h2>\n\n<p><strong><a href=\"https://manifest.fm/3\">The Manifest #3: RubyGems with Andre Arko</a></strong> (Andre Arko, 2017). How he became lead maintainer of RubyGems and Bundler, and what led to Ruby Together.</p>\n\n<p><strong><a href=\"https://topenddevs.com/podcasts/ruby-rogues/045-rr-bundler-with-andre-arko\">Ruby Rogues #45: Bundler</a></strong> (Andre Arko, 2012). Early, in-depth discussion of Bundler’s design and purpose.</p>\n\n<p><strong><a href=\"https://www.rooftopruby.com/2108545/episodes/13495314\">Rooftop Ruby #23: Head of Open Source at Ruby Central</a></strong> (Andre Arko, 2023). His journey to Bundler, how Ruby Together came to be, and continuing that work at Ruby Central.</p>\n\n<p><strong><a href=\"https://www.friendly.show/2278525/episodes/13995352\">Friendly Show #5: How we got RubyGems and Bundler</a></strong> (Andre Arko, 2023). The full history of RubyGems and Bundler, the cost of maintaining them (~$500k/month), and future plans.</p>\n\n<p><strong><a href=\"https://www.railschangelog.com/19\">The Rails Changelog #19: Exploring RubyGems</a></strong> (Jenny Shen). The mechanics of dependency resolution in RubyGems, including compact indexes.</p>\n\n<p><strong><a href=\"https://changelog.com/friends/113\">Changelog &amp; Friends #113: The RubyGems Debacle</a></strong> (Mike McQuaid and Justin Searls, 2025). The Ruby Central governance controversy, money in open source, and what sustainability means.</p>\n\n<h2 id=\"rust\">Rust</h2>\n\n<p><strong><a href=\"https://manifest.fm/8\">The Manifest #8: Cargo and Crates.io</a></strong> (Carol Nichols, 2017). The features that make Cargo the envy of other package managers, and the sustainability of the Rust ecosystem.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/151\">The Changelog #151: The Rust Programming Language</a></strong> (Steve Klabnik and Yehuda Katz, 2015). Yehuda Katz designed Cargo by rolling up five years of innovation from Bundler, Node, and Go.</p>\n\n<p><strong><a href=\"https://opensourcesecurity.io/2025/2025-08-cratesio-trusted-publishing-tobias/\">Open Source Security Podcast: crates.io trusted publishing</a></strong> (Tobias Bieniek, 2025). Steps crates.io is taking to enhance supply chain security through trusted publishing.</p>\n\n<h2 id=\"go\">Go</h2>\n\n<p><strong><a href=\"https://manifest.fm/4\">The Manifest #4: Go dep</a></strong> (Sam Boyer, 2017). Package management for Go, SAT-solving, and dependency resolution before Go modules existed.</p>\n\n<p><strong><a href=\"https://changelog.com/gotime/77\">Go Time #77: Dependencies and the future of Go</a></strong> (Russ Cox, 2018). The Go tech lead on the Vgo proposal that became Go modules.</p>\n\n<p><strong><a href=\"https://changelog.com/gotime/188\">Go Time #188: SIV and the V2+ issue</a></strong> (Tim Heckman and Peter Bourgon, 2021). Semantic import versioning and the community friction it caused.</p>\n\n<p><strong><a href=\"https://changelog.com/gotime/321\">Go Time #321: Dependencies are dangerous</a></strong> (panel, 2024). The polyfill.io supply chain attack and Go’s “a little copying is better than a little dependency” proverb.</p>\n\n<p><strong><a href=\"https://changelog.com/gotime/86\">Go Time #86: Go modules and the Athens project</a></strong> (Marwan Sulaiman and Aaron Schlesinger, 2019). How Go module proxies work, the Athens project, and the transition from GOPATH to modules.</p>\n\n<p><strong><a href=\"https://se-radio.net/2021/12/episode-489-sam-boyer-on-package-management/\">SE Radio #489: Sam Boyer on Package Management</a></strong> (Sam Boyer, 2021). A broad, ecosystem-agnostic discussion of package management as a discipline.</p>\n\n<h2 id=\"php\">PHP</h2>\n\n<p><strong><a href=\"https://manifest.fm/15\">The Manifest #15: Packagist</a></strong> (Nils Adermann, 2019). PHP package management with Composer and Packagist from its co-creator.</p>\n\n<h2 id=\"dart\">Dart</h2>\n\n<p><strong><a href=\"https://manifest.fm/5\">The Manifest #5: Pub</a></strong> (Natalie Weizenbaum, 2017). How Dart’s pub works and a new algorithm for better dependency resolution errors, which became PubGrub.</p>\n\n<h2 id=\"java--jvm\">Java / JVM</h2>\n\n<p><strong><a href=\"https://manifest.fm/6\">The Manifest #6: Maven</a></strong> (Brian Fox, 2017). The history of Maven Central, how Minecraft DDoS’d the service, and the future of Java dependency management.</p>\n\n<p><strong><a href=\"https://manifest.fm/12\">The Manifest #12: Clojars</a></strong> (Daniel Compton, 2019). Clojars, the Clojure package registry, and its relationship to Maven.</p>\n\n<p><strong><a href=\"https://openssf.org/podcast/2024/07/16/whats-in-the-soss-podcast-9-sonatypes-brian-fox-and-the-perplexing-phenomenon-of-downloading-known-vulnerabilities/\">OpenSSF “What’s in the SOSS?” #9: Downloading Known Vulnerabilities</a></strong> (Brian Fox, 2024). Why 96% of vulnerable downloads from Maven Central had known fixes available.</p>\n\n<p><strong><a href=\"https://chariotsolutions.com/podcast/episode-53-gradle-creators-hans-dockter-and-adam-murdoch-part-1/\">TechCast #53: Gradle Creators, Part 1</a></strong> (Hans Dockter and Adam Murdoch, 2010). Gradle’s creators on the build system’s design and origins.</p>\n\n<p><strong><a href=\"https://chariotsolutions.com/podcast/episode-54-gradle-creators-hans-dockter-and-adam-murdoch-part-2/\">TechCast #54: Gradle Creators, Part 2</a></strong> (Hans Dockter and Adam Murdoch, 2010). Continuation of the Gradle discussion.</p>\n\n<p><strong><a href=\"https://se-radio.net/2024/08/se-radio-628-hans-dockter-on-developer-productivity/\">SE Radio #628: Hans Dockter on Developer Productivity</a></strong> (Hans Dockter, 2024). Gradle’s creator on developer productivity and build tooling.</p>\n\n<h2 id=\"swift--apple\">Swift / Apple</h2>\n\n<p><strong><a href=\"https://manifest.fm/2\">The Manifest #2: CocoaPods</a></strong> (Orta Therox, 2017). How CocoaPods grew, the arrival of Swift Package Manager, and the Danger project.</p>\n\n<p><strong><a href=\"https://www.swiftbysundell.com/podcast/75/\">Swift by Sundell #75: The Swift Package Ecosystem</a></strong> (Dave Verwer and Sven A. Schmidt, 2020). The Swift Package Index launch and the state of the Swift package ecosystem.</p>\n\n<h2 id=\"net\">.NET</h2>\n\n<p><strong><a href=\"https://www.hanselminutes.com/238/aspnet-mvc-3-rc-and-nuget-package-management-with-phil-haack\">Hanselminutes #238: NuGet Package Management with Phil Haack</a></strong> (Phil Haack, 2010). Recorded during PDC week, this is essentially the launch episode for .NET’s package manager, back when it was still called NuPack.</p>\n\n<h2 id=\"c--c\">C / C++</h2>\n\n<p><strong><a href=\"https://manifest.fm/13\">The Manifest #13: Conan</a></strong> (Diego Rodriguez-Losada, 2019). Package management problems specific to C/C++ and the road to Conan 1.0.</p>\n\n<p><strong><a href=\"https://cppcast.com/diego-rodriguez-losada/\">CppCast #56: Conan</a></strong> (Diego Rodriguez-Losada, 2016). Early discussion of Conan from its creator.</p>\n\n<p><strong><a href=\"https://cppcast.com/robert-schumacher/\">CppCast #153: Vcpkg</a></strong> (Robert Schumacher, 2018). vcpkg’s evolution from a Visual Studio migration tool to a cross-platform C/C++ dependency manager.</p>\n\n<h2 id=\"haskell\">Haskell</h2>\n\n<p><strong><a href=\"https://haskell.foundation/podcast/68/\">Haskell Interlude #68: Michael Snoyman</a></strong> (Michael Snoyman, 2025). The creator of Stack and Stackage on building a build tool that “just works” for Haskell.</p>\n\n<h2 id=\"elm\">Elm</h2>\n\n<p><strong><a href=\"https://elm-radio.com/episode/publishing-packages/\">Elm Radio #5: How (And When) to Publish a Package</a></strong> (2020). Elm’s enforced semantic versioning, where the compiler diffs package APIs and rejects publishes that break compatibility without a major bump.</p>\n\n<h2 id=\"elixir\">Elixir</h2>\n\n<p><strong><a href=\"https://podcast.thinkingelixir.com/3\">Thinking Elixir #3: Hex Package Manager</a></strong> (Eric Meadows-Jonsson, 2020). Hex’s creator on how Elixir’s package ecosystem handles versioning and resolution.</p>\n\n<h2 id=\"erlang\">Erlang</h2>\n\n<p><strong><a href=\"https://mostlyerlang.wordpress.com/2015/05/12/067-rebar-3/\">Mostly Erlang #067: Rebar 3</a></strong> (Fred Hebert, 2015). Fred Hebert and the panel on rebar3, Erlang’s build and dependency management tool.</p>\n\n<h2 id=\"perl\">Perl</h2>\n\n<p><strong><a href=\"https://underbar.cpan.io/episodes/3/\">The Underbar #3: MetaCPAN</a></strong> (Olaf Alders, Mickey Nasriachi, Shawn Sorichetti, and Graham Knop, 2025). The MetaCPAN team on the project’s history and future, recorded at the Perl Toolchain Summit in Leipzig.</p>\n\n<p><strong><a href=\"https://underbar.cpan.io/episodes/6/\">The Underbar #6: CPAN Testers</a></strong> (Doug Bell, Ruth Holloway, Ferenc Erki, and Breno G. de Oliveira, 2025). How CPAN Testers went down, and how a new team formed around its lone remaining maintainer to get things running again.</p>\n\n<p><strong><a href=\"https://underbar.cpan.io/episodes/7/\">The Underbar #7: CPAN Security Group</a></strong> (Salve J. Nilsen, Stig Palmquist, and others, 2025). The CPAN Security Group on supply chain security for Perl’s package ecosystem.</p>\n\n<p><strong><a href=\"https://twit.tv/shows/floss-weekly/episodes/246\">FLOSS Weekly #246: Pinto</a></strong> (Jeffrey Thalhammer, 2013). Custom CPAN-like repositories with Pinto, covering why pinning dependencies matters for reproducible builds.</p>\n\n<h2 id=\"system-package-managers\">System package managers</h2>\n\n<p><strong><a href=\"https://manifest.fm/1\">The Manifest #1: Homebrew</a></strong> (Mike McQuaid, 2017). The lead maintainer on Homebrew’s design, how it uses GitHub as a database, and patching upstream.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/35\">The Changelog #35: Homebrew and OS X Package Management</a></strong> (Max Howell, 2010). Early interview with Homebrew’s creator about the project’s origins.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/223\">The Changelog #223: Homebrew and Package Management</a></strong> (Mike McQuaid, 2016). The 1.0.0 release and growth to almost 6000 unique contributors.</p>\n\n<p><strong><a href=\"https://www.freecodecamp.org/news/the-most-important-skills-going-forward-with-cto-homebrew-maintainer-mike-mcquaid-podcast-204\">freeCodeCamp Podcast #204: Mike McQuaid</a></strong> (Mike McQuaid, 2026). How big open source infrastructure gets built and maintained.</p>\n\n<p><strong><a href=\"https://manifest.fm/14\">The Manifest #14: Debian and Reproducible Builds</a></strong> (Chris Lamb, 2019). How package management works in Debian and the Reproducible Builds project.</p>\n\n<p><strong><a href=\"https://changelog.com/podcast/437\">The Changelog #437: Into the Nix Ecosystem</a></strong> (Domen Kozar, 2021). Nix’s origins from Eelco Dolstra’s university research, how it works as a “Swiss Army knife of DevOps,” and the road ahead.</p>\n\n<p><strong><a href=\"https://creators.spotify.com/pod/profile/happypathprogramming/episodes/73-Nix---Functional-Programming-for-Software-Packaging-with-Domen-Koar-e1t5onm\">Happy Path Programming #73: Nix - Functional Programming for Software Packaging</a></strong> (Domen Kozar, 2023). Nix as functional programming applied to the packaging problem.</p>\n\n<p><strong><a href=\"https://www.podchaser.com/podcasts/foss-north-the-pod-4749563/episodes/flatpak-with-alexander-larsson-141124423\">foss-north #33: Flatpak with Alexander Larsson</a></strong> (Alexander Larsson, 2021). Flatpak’s creator on its design, containers, and Linux desktop application distribution.</p>\n\n<p><strong><a href=\"https://cast.postmarketos.org/episode/30-Interview-Natanael-Copa-Alpine-Linux/\">postmarketOS Podcast #30: Natanael Copa</a></strong> (Natanael Copa, 2023). Alpine Linux’s creator on why apk-tools is so fast and planned improvements for future versions.</p>\n\n<h2 id=\"scientific-computing\">Scientific computing</h2>\n\n<p><strong><a href=\"https://manifest.fm/11\">The Manifest #11: Spack</a></strong> (Todd Gamblin). The package manager for supercomputers and the unique challenges of HPC packaging.</p>\n\n<p><strong><a href=\"https://manifest.fm/16\">The Manifest #16: Conda Forge, Mamba, and Packaging Con</a></strong> (Wolf Vollprecht, 2021). Conda-forge, the Mamba solver, and the first Packaging-Con.</p>\n\n<p><strong><a href=\"https://www.rce-cast.com/Podcast/rce-103-easybuild.html\">RCE 103: EasyBuild</a></strong> (2016). EasyBuild’s approach to managing scientific software builds on HPC systems.</p>\n\n<p><strong><a href=\"https://flossforscience.com/podcast/season-1-episode-12\">FLOSSforScience EP012: EasyBuild</a></strong> (Kenneth Hoste, 2018). The problems of installing scientific software on HPC systems and how EasyBuild addresses them.</p>\n\n<h2 id=\"cross-ecosystem\">Cross-ecosystem</h2>\n\n<p><strong><a href=\"https://manifest.fm/7\">The Manifest #7: The Update Framework</a></strong> (Trishank Karthik Kuppusamy). TUF, a security layer for package managers that grew out of the Tor Project. Also covers Uptane for automotive package management.</p>\n\n<p><strong><a href=\"https://manifest.fm/10\">The Manifest #10: Open Source Licensing</a></strong> (Kate Stewart). How open source licensing intersects with software packaging, from the SPDX perspective.</p>\n\n<p><strong><a href=\"https://openssf.org/podcast/2024/11/26/whats-in-the-soss-podcast-20-jack-cable-of-cisa-and-zach-steindler-of-github-dig-into-package-repository-security/\">OpenSSF “What’s in the SOSS?” #20: Package Repository Security</a></strong> (Jack Cable and Zach Steindler, 2024). Trusted Publishing, which started in PyPI and spread to RubyGems and npm.</p>\n\n<p><strong><a href=\"https://openssf.org/podcast/2024/12/10/whats-in-the-soss-podcast-21-alpha-omegas-michael-winser-and-catalyzing-sustainable-improvements-in-open-source-security/\">OpenSSF “What’s in the SOSS?” #21: Alpha-Omega</a></strong> (Michael Winser, 2024). Securing critical dependency chains one project at a time, the “fix, fork, or forego” framework for upstream vulnerabilities, and why human trust beats automated reports.</p>\n\n<p><strong><a href=\"https://twit.tv/shows/security-now/episodes/807\">Security Now #807: Dependency Confusion</a></strong> (Steve Gibson, 2021). A detailed walkthrough of Alex Birsan’s dependency confusion research, where uploading packages to public registries matching internal names at Apple, PayPal, and others achieved remote code execution.</p>\n\n<hr />\n\n<p>What’s missing? There are ecosystems I know less about and episodes I haven’t found. <a href=\"https://mastodon.social/@andrewnez\">Let me know</a> or <a href=\"https://github.com/andrew/nesbitt.io\">open a PR</a>.</p>",
    "description": "A reference list of podcast episodes about package managers, grouped by ecosystem.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-09T10:00:00+00:00",
    "fetched_at": "2026-02-09T12:25:38.595473",
    "url_hash": "24470abb625529c4cbb4950117f22fd1"
  },
  {
    "title": "Weekly Update 490",
    "link": "https://www.troyhunt.com/weekly-update-490/",
    "content": "<img src=\"https://www.troyhunt.com/content/images/2026/02/Splash-Template@1x_1-1.jpg\" alt=\"Weekly Update 490\"><p>A big &quot;thank you&quot; to everyone who helped me troubleshoot the problem with my &quot;Print Screen&quot; button on the new PC. Try as we all might, none of us could figure out why it refused to bind to SnagIt and instead insisted on dumping the entire collection of screens to a file on the desktop. But an <em>especailly</em> big thanks to the follower who later emailed me with an idea that didn&apos;t work, and followed up with an idea that finally <em>did!</em></p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2026/02/image.png\" class=\"kg-image\" alt=\"Weekly Update 490\" loading=\"lazy\" width=\"1498\" height=\"838\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2026/02/image.png 600w, https://www.troyhunt.com/content/images/size/w1000/2026/02/image.png 1000w, https://www.troyhunt.com/content/images/2026/02/image.png 1498w\" sizes=\"(min-width: 720px) 720px\"></figure><p>So, yeah, thanks Logitech for making this a real pain in the arse &#x1F926;&#x200D;&#x2642;&#xFE0F;</p>\n<!--kg-card-begin: html-->\n<div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 490\"></a></div><div style=\"width: 175px; display: inline-block; margin-right: 3px;\"><a href=\"https://www.youtube.com/playlist?list=PL7LAAxaabizMAXnJe0s3xjQ30q12EVmjt&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2024/09/Watch-and-Listen-on-YouTube.svg\" alt=\"Weekly Update 490\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 490\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 490\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/mEE0Qht3Zkw\" title=\"YouTube video player\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen loading=\"lazy\" spellcheck=\"false\"></iframe></div>\n<!--kg-card-end: html-->\n",
    "description": "A big &quot;thank you&quot; to everyone who helped me troubleshoot the problem with my &quot;Print Screen&quot; button on the new PC. Try as we all might, none of us could figure out why it refused to bind to SnagIt and instead insisted on dumping the entire",
    "is_fulltext": true,
    "source": "Troy Hunt",
    "pub_date": "Mon, 09 Feb 2026 04:19:39 GMT",
    "fetched_at": "2026-02-09T12:26:05.341254",
    "url_hash": "d080b5c43bde802fb1c3b018c847e422"
  }
]