[
  {
    "title": "Nano Banana Pro diff to webcomic",
    "link": "https://simonwillison.net/2026/Feb/17/release-notes-webcomic/#atom-everything",
    "content": "\n    <p>Given the threat of <a href=\"https://simonwillison.net/tags/cognitive-debt/\">cognitive debt</a> brought on by AI-accelerated software development leading to more projects and less deep understanding of how they work and what they actually do, it's interesting to consider artifacts that might be able to help.</p>\n<p>Nathan Baschez <a href=\"https://twitter.com/nbaschez/status/2023501535343509871\">on Twitter</a>:</p>\n<blockquote>\n<p>my current favorite trick for reducing \"cognitive debt\" (h/t @simonw\n) is to ask the LLM to write two versions of the plan:</p>\n<ol>\n<li>The version for it (highly technical and detailed)</li>\n<li>The version for me (an entertaining essay designed to build my intuition)</li>\n</ol>\n<p>Works great</p>\n</blockquote>\n<p>This inspired me to try something new. I generated <a href=\"https://github.com/simonw/showboat/compare/v0.5.0...v0.6.0.diff\">the diff</a> between v0.5.0 and v0.6.0 of my Showboat project - which introduced <a href=\"https://simonwillison.net/2026/Feb/17/chartroom-and-datasette-showboat/#showboat-remote-publishing\">the remote publishing feature</a> - and dumped that into Nano Banana Pro with the prompt:</p>\n<blockquote>\n<p>Create a webcomic that explains the new feature as clearly and entertainingly as possible</p>\n</blockquote>\n<p>Here's <a href=\"https://gemini.google.com/share/cce6da8e5083\">what it produced</a>:</p>\n<p><img alt=\"A six-panel comic strip illustrating a tool called &quot;Showboat&quot; for live-streaming document building. Panel 1, titled &quot;THE OLD WAY: Building docs was a lonely voyage. You finished it all before anyone saw it.&quot;, shows a sad bearded man on a wooden boat labeled &quot;THE LOCALHOST&quot; holding papers and saying &quot;Almost done... then I have to export and email the HTML...&quot;. Panel 2, titled &quot;THE UPGRADE: Just set the environment variable!&quot;, shows the same man excitedly plugging in a device with a speech bubble reading &quot;ENV VAR: SHOWBOAT_REMOTE_URL&quot; and the sound effect &quot;*KA-CHUNK!*&quot;. Panel 3, titled &quot;init establishes the uplink and generates a unique UUID beacon.&quot;, shows the man typing at a keyboard with a terminal reading &quot;$ showboat init 'Live Demo'&quot;, a satellite dish transmitting to a floating label &quot;UUID: 550e84...&quot;, and a monitor reading &quot;WAITING FOR STREAM...&quot;. Panel 4, titled &quot;Every note and exec is instantly beamed to the remote viewer!&quot;, shows the man coding with sound effects &quot;*HAMMER!*&quot;, &quot;ZAP!&quot;, &quot;ZAP!&quot;, &quot;BANG!&quot; as red laser beams shoot from a satellite dish to a remote screen displaying &quot;NOTE: Step 1...&quot; and &quot;SUCCESS&quot;. Panel 5, titled &quot;Even image files are teleported in real-time!&quot;, shows a satellite dish firing a cyan beam with the sound effect &quot;*FOOMP!*&quot; toward a monitor displaying a bar chart. Panel 6, titled &quot;You just build. The audience gets the show live.&quot;, shows the man happily working at his boat while a crowd of cheering people watches a projected screen reading &quot;SHOWBOAT LIVE STREAM: Live Demo&quot;, with a label &quot;UUID: 550e84...&quot; and one person in the foreground eating popcorn.\" src=\"https://static.simonwillison.net/static/2026/nano-banana-diff.jpg\" /></p>\n<p>Good enough to publish with the release notes? I don't think so. I'm sharing it here purely to demonstrate the idea. Creating assets like this as a personal tool for thinking about novel ways to explain a feature feels worth exploring further.</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/nano-banana\">nano-banana</a>, <a href=\"https://simonwillison.net/tags/gemini\">gemini</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/cognitive-debt\">cognitive-debt</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/text-to-image\">text-to-image</a>, <a href=\"https://simonwillison.net/tags/showboat\">showboat</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a></p>\n\n\n\n",
    "description": "Given the threat of cognitive debt brought on by AI-accelerated software development leading to more projects and less deep understanding of how they work and what they actually do, it's interesting to consider artifacts that might be able to help. Nathan Baschez on Twitter: my current favorite trick for reducing \"cognitive debt\" (h/t @simonw ) is to ask the LLM to write two versions of the plan: The version for it (highly technical and detailed) The version for me (an entertaining essay designe",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-17T04:51:58+00:00",
    "fetched_at": "2026-02-17T12:21:36.013340",
    "url_hash": "6e1d9d6377d6519c6bf109d2a4aa1d68"
  },
  {
    "title": "LLM-generated skills work, if you generate them afterwards",
    "link": "https://seangoedecke.com/generate-skills-afterwards/",
    "content": "<p>LLM <a href=\"https://github.com/anthropics/skills\">“skills”</a> are a short explanatory prompt for a particular task, typically bundled with helper scripts. A recent <a href=\"https://arxiv.org/abs/2602.12670\">paper</a> showed that while skills are useful to LLMs, <em>LLM-authored</em> skills are not. From the abstract:</p>\n<blockquote>\n<p>Self-generated skills provide no benefit on average, showing that models cannot reliably author the procedural knowledge they benefit from consuming</p>\n</blockquote>\n<p>For the moment, I don’t really want to dive into the paper. I just want to note that the way the paper uses LLMs to generate skills is bad, and you shouldn’t do this. Here’s how the paper prompts a LLM to produce skills:</p>\n<blockquote>\n<p>Before attempting to solve this task, please follow these steps: 1. Analyze the task requirements and identify what domain knowledge, APIs, or techniques are needed. 2. Write 1–5 modular skill documents that would help solve this task. Each skill should: focus on a specific tool, library, API, or technique; include installation/setup instructions if applicable; provide code examples and usage patterns; be reusable for similar tasks. 3. Save each skill as a markdown file in the environment/skills/ directory with a descriptive name. 4. Then solve the task using the skills you created as reference</p>\n</blockquote>\n<p>The key idea here is that they’re asking the LLM to produce a skill <em>before</em> it starts on the task. It’s essentially a strange version of the “make a plan first” or “think step by step” prompting strategy. I’m not at all surprised that this doesn’t help, because current reasoning models already think carefully about the task before they begin.</p>\n<p>What should you do instead? You should <strong>ask the LLM to write up a skill <em>after</em> it’s completed the task</strong>. Obviously this isn’t useful for truly one-off tasks. But few tasks are truly one-off. For instance, I’ve recently been playing around with <a href=\"https://transformer-circuits.pub/2024/scaling-monosemanticity/\">SAEs</a> and trying to clamp features in open-source models, a la <a href=\"https://www.anthropic.com/news/golden-gate-claude\">Golden Gate Claude</a>. It took a while for Codex to get this right. Here are some things it had to figure out:</p>\n<ul>\n<li>Extracting features from the final layernorm is too late - you may as well just boost individual logits during sampling</li>\n<li>You have to extract from about halfway through the model layers to get features that can be usefully clamped</li>\n<li>Training a SAE on ~10k activations is two OOMs too few to get useful features. You need to train until features account for >50% of variance</li>\n</ul>\n<p>Once I was able (with Codex’s help) to clamp an 8B model and force it to obsess about a subject<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup>, I <em>then</em> asked Codex to summarize the process into an agent skill<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>. That worked great! I was able to spin up a brand-new Codex instance with that skill and immediately get clamping working on a different 8B model. But if I’d asked Codex to write the skill at the start, it would have baked in all of its incorrect assumptions (like extracting from the final layernorm), and the skill wouldn’t have helped at all.</p>\n<p>In other words, the purpose of LLM-generated skills is to get it to distil the knowledge it’s gained by iterating on the problem for millions of tokens, not to distil the knowledge it already has from its training data. You can get a LLM to generate skills for you, <strong>so long as you do it <em>after</em> the LLM has already solved the problem the hard way</strong>.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>If you’re interested, it was “going to the movies”.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>I’ve pushed it up <a href=\"https://github.com/sgoedecke/skills/tree/main\">here</a>. I’m sure you could do much better for a feature-extraction skill, this was just my zero-effort Codex-only attempt.</p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>",
    "description": "",
    "is_fulltext": true,
    "source": "seangoedecke.com RSS feed",
    "pub_date": "Tue, 17 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-17T12:21:36.990947",
    "url_hash": "b1d3a6ea9a5f609bb5a4d15ff21db3ae"
  },
  {
    "title": "Pluralistic: What's a \"gig work minimum wage\" (17 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/17/no-piecework/",
    "content": "<p><!--\nTags:\nnber, gig work, labor, worker misclassification, wage theft, payup, seattle, class war, gig economy, distributional outcomes, economics,\n\nSummary:\nWhat's a \"gig work minimum wage\"; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/17/no-piecework/\n\nTitle:\nPluralistic: What's a \"gig work minimum wage\" (17 Feb 2026) no-piecework\n\nBullet:\n&#x1f421;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/17/no-piecework/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/17Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#no-justice\">What's a \"gig work minimum wage\"</a>: The important rate is what you're paid when you're waiting for a job.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#retro\">Object permanence</a>: MBA phrenology; Sony's DRM CEO is out; Midwestern Tahrir; Reverse Centaurs and AI.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/17/no-piecework/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12441\"></span></p>\n<hr/>\n<p><a name=\"no-justice\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A figure in a rich robe sitting atop a throne, surrounded by bags of money; his face is masked by a robber's balaclava. Beneath the throne stream densely packed cars on a nighttime freeway. Behind him is a car's broken windscreen with an Uber logo in one corner.\" src=\"https://i0.wp.com/craphound.com/images/uber-wage-theft.jpg?w=840&#038;ssl=1\"/></p>\n<h1>What's a \"gig work minimum wage\" (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#no-justice\">permalink</a>)</h1>\n<p>\"Minimum wage\" is one of those odd concepts that <em>seems</em> to have an intuitive definition, but the harder you think about it, the more complicated it gets. For example, if you want to work, but can't find a job, then the minimum wage you'll get is zero:</p>\n<p><a href=\"https://web.archive.org/web/20200625043843/https://www.latimes.com/entertainment-arts/books/story/2020-06-24/forget-ubi-says-an-economist-its-time-for-universal-basic-jobs\">https://web.archive.org/web/20200625043843/https://www.latimes.com/entertainment-arts/books/story/2020-06-24/forget-ubi-says-an-economist-its-time-for-universal-basic-jobs</a></p>\n<p>That's why politicians like Avi Lewis (who is running for leader of Canada's New Democratic Party) has call for a jobs guarantee: a government guarantee of a good job at a socially inclusive wage for everyone who wants one:</p>\n<p><a href=\"https://lewisforleader.ca/ideas/dignified-work-full-plan\">https://lewisforleader.ca/ideas/dignified-work-full-plan</a></p>\n<p>(Disclosure: I have advised the Lewis campaign on technical issues and I have endorsed his candidacy.)</p>\n<p>If that sounds Utopian or Communist to you (or both), consider this: it was the American jobs guarantee that delivered the America's system of national parks, among many other achievements:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Civilian_Conservation_Corps\">https://en.wikipedia.org/wiki/Civilian_Conservation_Corps</a></p>\n<p>The idea of a wage for everyone who wants a job is just one interesting question raised by the concept of a \"minimum wage.\" Even when we're talking about people who <em>have</em> wages, the idea of a \"minimum wage\" is anything but straightforward.</p>\n<p>Take gig workers: the rise of Uber and its successors created an ever-expanding class of workers who are misclassified as independent contractors by employers, seeking to evade unionization, benefits and liability. It's a weird kind of \"independent contractor\" who gets punished for saying no to lowball offers, has to decorate their personal clothes and/or cars in their \"client's\" livery, and who has every movement scripted by an app controlled by their \"client\":</p>\n<p><a href=\"https://pluralistic.net/2024/02/02/upward-redistribution/\">https://pluralistic.net/2024/02/02/upward-redistribution/</a></p>\n<p>The pretext that a worker is actually a standalone small business confers another great advantage on their employers: it's a great boon to any boss who wants to steal their worker's wages. I'm not talking about stealing tips here (though gig-work platforms do steal tips, like crazy):</p>\n<p><a href=\"https://www.nyc.gov/mayors-office/news/2026/01/mayor-mamdani-announces--5-million-settlement--reinstatement-of-\">https://www.nyc.gov/mayors-office/news/2026/01/mayor-mamdani-announces&#8211;5-million-settlement&#8211;reinstatement-of-</a></p>\n<p>I'm talking about how gig-work platforms define their workers' wages in the first place. This is a very salient definition in public policy debates. Gig platforms facing regulation or investigation routinely claim that their workers are paid sky-high wages. During the debate over California's Prop 22 (in which Uber and Lyft spent more than $225m to formalize worker misclassification), gig companies agreed to all kinds of reasonable-sounding wage guarantees:</p>\n<p><a href=\"https://pluralistic.net/2020/10/14/final_ver2/#prop-22\">https://pluralistic.net/2020/10/14/final_ver2/#prop-22</a></p>\n<p>When Toronto was grappling with the brutal effect that gig-work taxis have on the city's world-beatingly bad traffic, Uber promised to pay its drivers \"120% of the minimum wage,\" which would come out to $21.12 per hour. However, the <em>real</em> wage Uber was proposing to pay its drivers came out to about <em>$2.50</em> per hour:</p>\n<p><a href=\"https://pluralistic.net/2024/02/29/geometry-hates-uber/#toronto-the-gullible\">https://pluralistic.net/2024/02/29/geometry-hates-uber/#toronto-the-gullible</a></p>\n<p>How to explain the difference? Well, Uber &#8211; and its gig-work competitors &#8211; only pay drivers while they have a passenger &#8211; or an item &#8211; in the car. Drivers are not paid for the time they spend waiting for a job or the time they spend getting to the job. This is the majority of time that a gig driver spends working for the platform, and by excluding the majority of time a driver is on the clock, the company can claim to pay a generous wage while actually paying peanuts.</p>\n<p>Now, at this phase, you may be thinking that this is only fair, or at least traditional. Livery cab drivers don't get paid unless they have a fare in the cab, right?</p>\n<p>That's true, but livery cab drivers have lots of ways to influence that number. They can shrewdly choose a good spot to cruise. They can give their cellphone numbers to riders they've established a rapport with in order to win advance bookings. In small towns with just a few drivers &#8211; or in cities where drivers are in a co-op &#8211; they can spend some of their earnings to advertise the taxi company. Livery drivers can offer discounts to riders going a long way. It's a tough job, but it's one in which workers have some <em>agency</em>.</p>\n<p>Contrast that with driving for Uber: Uber decides which drivers get to even see a job. Uber decides how to market its services. Uber gets to set fares, on a per-passenger basis, meaning that it might choose to scare some passengers off of a few of their rides with high prices, in a bid to psychologically nudge that passenger into accepting higher fares overall.</p>\n<p>At the same time, Uber is reliant on a minimum pool of drivers cruising the streets, on the clock but off the payroll. If riders had to wait 45 minutes to get an Uber, they'd make other arrangements. If it happened too often, they'd delete the app. So Uber can't survive without those cruising, unpaid drivers, who provide the capacity that make the company commercially viable.</p>\n<p>What's more, livery cab drivers aren't the only comparators for gig-work platforms. Many gig workers deliver food, meaning that we should compare them to, say, pizza delivery drivers. These drivers aren't just paid when they have a pizza in the car and they're driving to a customer's home. They're paid from the moment they clock onto their shift to the moment they clock off (plus tips).</p>\n<p>Now, obviously, this is more expensive for employers, but the Uber Eats arrangement &#8211; in which drivers are only paid when they've got a pizza in the car and they're en route to a customer &#8211; doesn't eliminate that expense. When a gig delivery company takes away the pay that drivers used to get while waiting for a pizza, they're shifting this expense from employers to workers:</p>\n<p><a href=\"https://pluralistic.net/2025/08/20/billionaireism/#surveillance-infantalism\">https://pluralistic.net/2025/08/20/billionaireism/#surveillance-infantalism</a></p>\n<p>The fact that Uber can manipulate the concept of a minimum wage in order to claim to pay $21.12/hour to drivers who are making $2.50 per hour creates all kinds of policy distortions.</p>\n<p>Take Seattle: in 2024, the city implemented a program called \"PayUp\" that sets a \"minimum wage\" for drivers, but it's not a real minimum wage. It's a minimum payment for every ride or delivery.</p>\n<p>A new National Bureau of Economic Research paper analyzes the program and concludes that it hasn't increased drivers' pay at all:</p>\n<p><a href=\"https://www.nber.org/papers/w34545\">https://www.nber.org/papers/w34545</a></p>\n<p>To which we might say, \"Duh.\" Cranking up the sum paid for a small fraction of the work you do for a company will have very little impact on the overall wage you receive from the company.</p>\n<p>However, there <em>is</em> an interesting wrinkle in this paper's conclusions. Drivers aren't earning <em>less</em> under this system, either. So they're getting paid more for every delivery, but they're not adding more deliveries to their day. In other words, they're doing less work and then clocking off:</p>\n<p><a href=\"https://marginalrevolution.com/marginalrevolution/2026/02/minimum-wages-for-gig-work-cant-work.html\">https://marginalrevolution.com/marginalrevolution/2026/02/minimum-wages-for-gig-work-cant-work.html</a></p>\n<p>A neoclassical economist (someone who has experienced a specific form of neurological injury that makes you incapable of perceiving or reasoning about power) would say that this means that the drivers only desire to earn the sums they were earning before the \"minimum wage\" and so the program hasn't made a difference to their lives.</p>\n<p>But anyone else can look at this situation and understand that drivers only did this shitty job out of desperation. They had a sum they <em>needed</em> to get every month in order to pay the rent or the grocery bill. They have lots of needs besides those that they would like to fulfill, but not under the shitty gig-work app conditions. The only reason they tolerate a shitty app as their shitty boss at all is that they are desperate, and that desperation gives gig companies power over their workers.</p>\n<p>In other words, Seattle's PayUp \"minimum wage\" has shifted some of the expense associated with operating a gig platform from workers back onto their bosses. With fewer drivers available on the app, waiting times for customers will necessarily go up. Some of those customers will take the bus, or get a livery cab, or defrost a pizza, or walk to the corner cafe. For the gig platforms to win those customers back, they will have to reduce waiting times, and the most reliable way to do that is to increase the wages paid to their workers.</p>\n<p>So PayUp isn't a wash &#8211; it has changed the distributional outcome of the gig-work economy in Seattle. Drivers have clawed back a surplus &#8211; time they can spend doing more productive or pleasant things than cruising and waiting for a booking &#8211; from their bosses, who now must face lower profits, either from a loss of business from impatient customers, or from a higher wage they must pay to get those wait-times down again.</p>\n<p>But if you want to <em>really</em> move the needle on gig workers' wages, the answer is simple: pay workers for <em>all</em> the hours they put in for their bosses, not just the ones where bosses decide they deserve to get paid for.</p>\n<p>(<i>Image: <a href=\"https://commons.wikimedia.org/wiki/File:Balaclava_3_hole_black.jpg\">Tobias \"ToMar\" Maier</a>, <a href=\"https://creativecommons.org/licenses/by-sa/3.0/deed.en\">CC BY-SA 3.0</a>; <a href=\"https://www.flickr.com/photos/jonfeinstein/186791934/\">Jon Feinstein</a>, <a href=\"https://creativecommons.org/licenses/by/2.0/deed.en\">CC BY 2.0</a>; modified</i>)</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Privilege is bad grammar <a href=\"https://tadaima.bearblog.dev/privilege-is-bad-grammar/\">https://tadaima.bearblog.dev/privilege-is-bad-grammar/</a></p>\n</li>\n<li>\n<p>Closing the Stablecoin Yield Loophole in the Post-GENIUS Era <a href=\"https://clsbluesky.law.columbia.edu/2026/01/23/closing-the-stablecoin-yield-loophole-in-the-post-genius-era/\">https://clsbluesky.law.columbia.edu/2026/01/23/closing-the-stablecoin-yield-loophole-in-the-post-genius-era/</a></p>\n</li>\n<li>\n<p>The century of the maxxer <a href=\"https://samkriss.substack.com/p/the-century-of-the-maxxer\">https://samkriss.substack.com/p/the-century-of-the-maxxer</a></p>\n</li>\n<li>\n<p>Why the \"AI God\" Narrative is Actually a Corporate Power Grab <a href=\"https://www.thebignewsletter.com/p/monopoly-round-up-stop-telling-me\">https://www.thebignewsletter.com/p/monopoly-round-up-stop-telling-me</a></p>\n</li>\n<li>\n<p>All Your Base, slight remaster <a href=\"https://www.jwz.org/blog/2026/02/all-your-base-slight-remaster/\">https://www.jwz.org/blog/2026/02/all-your-base-slight-remaster/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#retro\">permalink</a>)</h1>\n<p>#20yrsago HOWTO resist warrantless searches at Best Buy <a href=\"https://www.die.net/musings/bestbuy/\">https://www.die.net/musings/bestbuy/</a></p>\n<p>#20yrsago RIAA using kids’ private info to attack their mother <a href=\"https://web.archive.org/web/20060223111437/http://p2pnet.net/story/7942\">https://web.archive.org/web/20060223111437/http://p2pnet.net/story/7942</a></p>\n<p>#20yrsago Sony BMG demotes CEO for deploying DRM <a href=\"https://web.archive.org/web/20060219233817/http://biz.yahoo.com/ap/060210/germany_sony_bmg_ceo.html?.v=7\">https://web.archive.org/web/20060219233817/http://biz.yahoo.com/ap/060210/germany_sony_bmg_ceo.html?.v=7</a></p>\n<p>#20yrsago Sistine Chapel recreated through 10-year cross-stitch project <a href=\"https://web.archive.org/web/20060214195146/http://www.austinstitchers.org/Show06/images/sistine2.jpg\">https://web.archive.org/web/20060214195146/http://www.austinstitchers.org/Show06/images/sistine2.jpg</a></p>\n<p>#15yrsago Selling cookies like a crack dealer, by dangling a string out your kitchen window <a href=\"https://laughingsquid.com/cookies-sold-by-string-dangling-from-san-francisco-apartment-window/\">https://laughingsquid.com/cookies-sold-by-string-dangling-from-san-francisco-apartment-window/</a></p>\n<p>#15yrsago Midwestern Tahrir: Workers refuse to leave Wisconsin capital over Tea Party labor law <a href=\"https://www.theawl.com/2011/02/wisconsin-demonstrates-against-scott-walkers-war-on-unions/\">https://www.theawl.com/2011/02/wisconsin-demonstrates-against-scott-walkers-war-on-unions/</a></p>\n<p>#10yrsago Back-room revisions to TPP sneakily criminalize fansubbing &amp; other copyright grey zones <a href=\"https://www.eff.org/deeplinks/2016/02/sneaky-change-tpp-drastically-extends-criminal-penalties\">https://www.eff.org/deeplinks/2016/02/sneaky-change-tpp-drastically-extends-criminal-penalties</a></p>\n<p>#10yrsago Russian Central Bank shutting down banks that staged fake cyberattacks to rip off depositors <a href=\"https://web.archive.org/web/20160220100817/http://www.scmagazine.com/russian-bank-licences-revoked-for-using-hackers-to-withdraw-funds/article/474477/\">https://web.archive.org/web/20160220100817/http://www.scmagazine.com/russian-bank-licences-revoked-for-using-hackers-to-withdraw-funds/article/474477/</a></p>\n<p>#10yrsago Stop paying your student loans and debt collectors can send US Marshals to arrest you <a href=\"https://web.archive.org/web/20201026202024/https://nymag.com/intelligencer/2016/02/us-marshals-forcibly-collecting-student-debt.html?mid=twitter-share-di\">https://web.archive.org/web/20201026202024/https://nymag.com/intelligencer/2016/02/us-marshals-forcibly-collecting-student-debt.html?mid=twitter-share-di</a></p>\n<p>#5yrsago Reverse centaurs and the failure of AI <a href=\"https://pluralistic.net/2021/02/17/reverse-centaur/#reverse-centaur\">https://pluralistic.net/2021/02/17/reverse-centaur/#reverse-centaur</a></p>\n<p>#1yrago Business school professors trained an AI to judge workers' personalities based on their faces <a href=\"https://pluralistic.net/2025/02/17/caliper-ai/#racism-machine\">https://pluralistic.net/2025/02/17/caliper-ai/#racism-machine</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18<br />\n<a href=\"https://tanner.utah.edu/center-events/cory-doctorow/\">https://tanner.utah.edu/center-events/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Oslo (remote): Seminar og lansering av rapport om «enshittification»<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#recent\">permalink</a>)</h1>\n<ul>\n<li>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/17/no-piecework/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1148 words today, 30940 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links What's a \"gig work minimum wage\": The important rate is what you're paid when you're waiting for a job. Hey look at this: Delights to delectate. Object permanence: MBA phrenology; Sony's DRM CEO is out; Midwestern Tahrir; Reverse Centaurs and AI. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. What's a \"gig work minimum w",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Tue, 17 Feb 2026 10:56:49 +0000",
    "fetched_at": "2026-02-17T12:21:43.003504",
    "url_hash": "af82cb39c958daf54639bd91a6722d4c"
  },
  {
    "title": "Platform Strings",
    "link": "https://nesbitt.io/2026/02/17/platform-strings.html",
    "content": "<p>Ask a dozen ecosystems what platform you’re running on and you’ll get a dozen different answers. An M1 Mac compiling a library is <code class=\"language-plaintext highlighter-rouge\">aarch64-apple-darwin</code> to LLVM, <code class=\"language-plaintext highlighter-rouge\">arm64-darwin</code> to RubyGems, <code class=\"language-plaintext highlighter-rouge\">darwin/arm64</code> to Go, <code class=\"language-plaintext highlighter-rouge\">macosx_11_0_arm64</code> to Python wheels, and <code class=\"language-plaintext highlighter-rouge\">darwin-arm64</code> to npm, all describing the same chip on the same OS. Each naming scheme was designed for its own context with its own constraints, and every tool that needs to work across ecosystems ends up maintaining a translation table between them.</p>\n\n<h3 id=\"gnu-target-triples\">GNU target triples</h3>\n\n<p>The format <code class=\"language-plaintext highlighter-rouge\">cpu-vendor-os</code> dates to the early 1990s GNU autoconf toolchain. Per Bothner wrote <a href=\"https://www.gnu.org/software/autoconf/manual/autoconf-2.68/html_node/Specifying-Target-Triplets.html\"><code class=\"language-plaintext highlighter-rouge\">config.guess</code></a> in 1992 to detect the build system’s architecture. <a href=\"https://gcc.gnu.org/install/configure.html\"><code class=\"language-plaintext highlighter-rouge\">config.sub</code></a> normalized the output using a long list of known CPUs and operating systems. The “triple” described three things: what CPU, what vendor made the hardware, and what OS it runs.<sup id=\"fnref:triple\"><a href=\"#fn:triple\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">1</a></sup></p>\n\n<p>GCC adopted this for <a href=\"https://gcc.gnu.org/onlinedocs/gccint/Configure-Terms.html\">cross-compilation</a>, where the build machine, host machine, and target machine might all differ. The vendor field (<code class=\"language-plaintext highlighter-rouge\">pc</code>, <code class=\"language-plaintext highlighter-rouge\">apple</code>, <code class=\"language-plaintext highlighter-rouge\">unknown</code>) is mostly decorative for the compiler itself but serves as a namespace to avoid collisions when the same arch-os pair needs different behavior. LLVM inherited the format through <a href=\"https://clang.llvm.org/docs/CrossCompilation.html\">Clang’s cross-compilation support</a>, using <code class=\"language-plaintext highlighter-rouge\">&lt;arch&gt;&lt;sub&gt;-&lt;vendor&gt;-&lt;sys&gt;-&lt;env&gt;</code> with the fourth field encoding ABI details like <code class=\"language-plaintext highlighter-rouge\">gnu</code>, <code class=\"language-plaintext highlighter-rouge\">musl</code>, or <code class=\"language-plaintext highlighter-rouge\">msvc</code>.</p>\n\n<p>ARM naming has been a persistent source of confusion. The architecture ARM calls “AArch64” is what Apple calls “arm64” and what LLVM accepts as both. A <a href=\"https://groups.google.com/g/llvm-dev/c/PIBNR1EE9R0\">Clang bug</a> meant <code class=\"language-plaintext highlighter-rouge\">--target=aarch64-apple-ios</code> and <code class=\"language-plaintext highlighter-rouge\">--target=arm64-apple-ios</code> produced different results. ARM itself used both names at different times before settling on AArch64 as the official designation, and the ambiguity persists everywhere downstream.</p>\n\n<h3 id=\"go\">Go</h3>\n\n<p>Go uses two environment variables rather than a combined string: <code class=\"language-plaintext highlighter-rouge\">GOOS=darwin GOARCH=arm64</code> or <code class=\"language-plaintext highlighter-rouge\">GOOS=linux GOARCH=amd64</code>, with no vendor or ABI field. The <a href=\"https://go.dev/doc/install/source\">canonical values</a> are maintained in the Go source tree in <a href=\"https://github.com/golang/go/blob/master/internal/platform/syslist_test.go\"><code class=\"language-plaintext highlighter-rouge\">syslist.go</code></a>.</p>\n\n<p>This design traces back to Plan 9, where the <code class=\"language-plaintext highlighter-rouge\">$objtype</code> environment variable selected the target architecture and <code class=\"language-plaintext highlighter-rouge\">mk</code> used it to pick the right compiler. Go’s creators (Rob Pike and Ken Thompson, both Plan 9 veterans) carried forward the idea that <a href=\"https://9p.io/sys/doc/comp.html\">a single environment variable should select the build target</a>. The early Go compilers even used Plan 9’s letter-based naming: <code class=\"language-plaintext highlighter-rouge\">8g</code> for the x86 compiler, <code class=\"language-plaintext highlighter-rouge\">6g</code> for amd64, <code class=\"language-plaintext highlighter-rouge\">5g</code> for ARM.</p>\n\n<p>Go can afford two flat variables because it statically links everything. It doesn’t need to express which vendor made the hardware or which C library the system uses, because <a href=\"https://eli.thegreenplace.net/2024/building-static-binaries-with-go-on-linux/\">Go programs don’t link against a C library by default</a>. CGo changes this, and when it does, cross-compilation gets harder. That’s the tradeoff: the simple model works because Go opted out of the C ecosystem.</p>\n\n<p>Go chose <code class=\"language-plaintext highlighter-rouge\">amd64</code> over <code class=\"language-plaintext highlighter-rouge\">x86_64</code> following Debian and Plan 9 conventions. This caused confusion early on, with users on Intel hardware wondering if <code class=\"language-plaintext highlighter-rouge\">amd64</code> downloads would work for them. The Go team eventually <a href=\"https://github.com/golang/go/issues/3125\">relabeled downloads</a> as “x86 64-bit” while keeping the internal <code class=\"language-plaintext highlighter-rouge\">amd64</code> naming.</p>\n\n<h3 id=\"nodejs\">Node.js</h3>\n\n<p>Node exposes <code class=\"language-plaintext highlighter-rouge\">process.platform</code> and <code class=\"language-plaintext highlighter-rouge\">process.arch</code>, with platform values like <code class=\"language-plaintext highlighter-rouge\">darwin</code>, <code class=\"language-plaintext highlighter-rouge\">linux</code>, <code class=\"language-plaintext highlighter-rouge\">win32</code>, and <code class=\"language-plaintext highlighter-rouge\">freebsd</code>, and architecture values like <code class=\"language-plaintext highlighter-rouge\">x64</code>, <code class=\"language-plaintext highlighter-rouge\">arm64</code>, <code class=\"language-plaintext highlighter-rouge\">ia32</code>, and <code class=\"language-plaintext highlighter-rouge\">arm</code>.</p>\n\n<p><code class=\"language-plaintext highlighter-rouge\">win32</code> for Windows and <code class=\"language-plaintext highlighter-rouge\">x64</code> for 64-bit x86 both come from existing conventions that Node inherited rather than chose. <code class=\"language-plaintext highlighter-rouge\">win32</code> is the Windows API subsystem name, used even on 64-bit Windows because the Win32 API kept its name, so <code class=\"language-plaintext highlighter-rouge\">process.platform</code> returns <code class=\"language-plaintext highlighter-rouge\">win32</code> on a machine that hasn’t been 32-bit for a decade. <code class=\"language-plaintext highlighter-rouge\">x64</code> is the name Microsoft and <a href=\"https://v8.dev/\">V8</a> use for the architecture, following the Windows SDK convention rather than the Linux <code class=\"language-plaintext highlighter-rouge\">x86_64</code> or Debian <code class=\"language-plaintext highlighter-rouge\">amd64</code> convention.</p>\n\n<p>npm’s <a href=\"https://docs.npmjs.com/cli/v7/configuring-npm/package-json/\"><code class=\"language-plaintext highlighter-rouge\">package.json</code></a> has <code class=\"language-plaintext highlighter-rouge\">os</code> and <code class=\"language-plaintext highlighter-rouge\">cpu</code> fields (<code class=\"language-plaintext highlighter-rouge\">{\"os\": [\"darwin\", \"linux\"], \"cpu\": [\"x64\", \"arm64\"]}</code>) that filter which platforms a package can install on, but npm itself has no built-in binary distribution mechanism, so the community invented one. Tools like <a href=\"https://github.com/evanw/esbuild/blob/main/lib/npm/node-platform.ts\">esbuild</a> publish platform-specific binaries as scoped packages (<code class=\"language-plaintext highlighter-rouge\">@esbuild/darwin-arm64</code>, <code class=\"language-plaintext highlighter-rouge\">@esbuild/linux-x64</code>) listed as <code class=\"language-plaintext highlighter-rouge\">optionalDependencies</code> of a wrapper package, with <code class=\"language-plaintext highlighter-rouge\">os</code> and <code class=\"language-plaintext highlighter-rouge\">cpu</code> fields on each so npm silently skips the ones that don’t match. The wrapper package then uses <code class=\"language-plaintext highlighter-rouge\">process.platform</code> and <code class=\"language-plaintext highlighter-rouge\">process.arch</code> at runtime to <code class=\"language-plaintext highlighter-rouge\">require()</code> the right one. This pattern, popularized by esbuild and adopted by SWC and others, works but it’s a convention built on top of npm’s dependency resolution, not a feature npm designed for the purpose.</p>\n\n<p>The Node scheme has no way to express libc version, OS version, or ABI, which is fine for most of the JavaScript ecosystem where packages are pure JavaScript. The cost shows up at the edges: native addons that need different builds for glibc vs musl Linux have to encode that information outside the platform string, and the <code class=\"language-plaintext highlighter-rouge\">optionalDependencies</code> pattern offers no help there.</p>\n\n<h3 id=\"python-wheels\">Python wheels</h3>\n\n<p>Python’s <a href=\"https://peps.python.org/pep-0425/\">wheel platform tags</a> encode the most information of any ecosystem. A wheel filename like <code class=\"language-plaintext highlighter-rouge\">numpy-1.26.0-cp312-cp312-manylinux_2_17_x86_64.whl</code> contains the Python version (<code class=\"language-plaintext highlighter-rouge\">cp312</code>), the ABI tag (<code class=\"language-plaintext highlighter-rouge\">cp312</code>), and the platform tag (<code class=\"language-plaintext highlighter-rouge\">manylinux_2_17_x86_64</code>).</p>\n\n<p>The platform tag comes from <a href=\"https://docs.python.org/3/library/sysconfig.html\"><code class=\"language-plaintext highlighter-rouge\">sysconfig.get_platform()</code></a> with hyphens and periods replaced by underscores. On macOS it encodes the minimum OS version: <code class=\"language-plaintext highlighter-rouge\">macosx_11_0_arm64</code> means “macOS 11 or later on arm64.” On Windows it’s <code class=\"language-plaintext highlighter-rouge\">win_amd64</code>. On Linux it encodes the glibc version.</p>\n\n<p>The manylinux story is its own saga. <a href=\"https://peps.python.org/pep-0513/\">PEP 513</a> introduced <code class=\"language-plaintext highlighter-rouge\">manylinux1</code> (glibc 2.5) so that compiled wheels could run on most Linux distributions. Then came <a href=\"https://peps.python.org/pep-0571/\">PEP 571</a> for <code class=\"language-plaintext highlighter-rouge\">manylinux2010</code> (glibc 2.12), then <a href=\"https://peps.python.org/pep-0599/\">PEP 599</a> for <code class=\"language-plaintext highlighter-rouge\">manylinux2014</code> (glibc 2.17). Each required a new PEP. <a href=\"https://peps.python.org/pep-0600/\">PEP 600</a> finally created a pattern, <code class=\"language-plaintext highlighter-rouge\">manylinux_${GLIBCMAJOR}_${GLIBCMINOR}_${ARCH}</code>, so future glibc versions don’t need new PEPs. The old names became aliases: <code class=\"language-plaintext highlighter-rouge\">manylinux1_x86_64</code> is <code class=\"language-plaintext highlighter-rouge\">manylinux_2_5_x86_64</code>.</p>\n\n<p>Python needs all this because wheels contain compiled C extensions that link against system libraries. A wheel built on a system with glibc 2.34 may call functions that don’t exist on a system with glibc 2.17. The tag encodes the minimum compatible glibc version so pip can select the right wheel. <a href=\"https://peps.python.org/pep-0656/\">PEP 656</a> added <code class=\"language-plaintext highlighter-rouge\">musllinux</code> tags for Alpine Linux and other musl-based distributions, which most web developers encounter when they try to <code class=\"language-plaintext highlighter-rouge\">pip install</code> a compiled package inside an Alpine Docker container and discover that <code class=\"language-plaintext highlighter-rouge\">manylinux</code> wheels won’t work there. The architecture field uses the <code class=\"language-plaintext highlighter-rouge\">uname</code> convention (<code class=\"language-plaintext highlighter-rouge\">x86_64</code>, <code class=\"language-plaintext highlighter-rouge\">aarch64</code>, <code class=\"language-plaintext highlighter-rouge\">i686</code>), which means no <code class=\"language-plaintext highlighter-rouge\">amd64</code>, no <code class=\"language-plaintext highlighter-rouge\">arm64</code>, and no <code class=\"language-plaintext highlighter-rouge\">x64</code>.</p>\n\n<h3 id=\"rubygems\">RubyGems</h3>\n\n<p>RubyGems uses <code class=\"language-plaintext highlighter-rouge\">cpu-os</code> pairs: <code class=\"language-plaintext highlighter-rouge\">x86_64-linux</code>, <code class=\"language-plaintext highlighter-rouge\">arm64-darwin</code>, <code class=\"language-plaintext highlighter-rouge\">x86_64-linux-musl</code>. The format comes from <a href=\"https://docs.ruby-lang.org/en/master/Gem/Platform.html\"><code class=\"language-plaintext highlighter-rouge\">Gem::Platform</code></a>, which parses the string into cpu, os, and version components.</p>\n\n<p>For years the Linux version field was unused. Then the musl libc question arrived. Alpine Linux uses musl instead of glibc, and a native extension compiled against glibc won’t run on musl. RubyGems <a href=\"https://github.com/rubygems/rubygems/pull/5852\">added <code class=\"language-plaintext highlighter-rouge\">linux-musl</code> and <code class=\"language-plaintext highlighter-rouge\">linux-gnu</code> platform variants</a> starting in RubyGems 3.3.22. The matching logic has a special case: on Linux, “no version” defaults to <code class=\"language-plaintext highlighter-rouge\">gnu</code>, but when matching a gem platform against the runtime platform, it acts as a wildcard.</p>\n\n<p><a href=\"https://github.com/rake-compiler/rake-compiler\">rake-compiler-dock</a> handles cross-compilation of native gems, and its platform naming has its own conventions. <code class=\"language-plaintext highlighter-rouge\">x64-mingw-ucrt</code> targets Ruby 3.1+ on Windows (which switched to the UCRT runtime), while <code class=\"language-plaintext highlighter-rouge\">x64-mingw32</code> targets Ruby 3.0 and earlier. Platform names ending in <code class=\"language-plaintext highlighter-rouge\">-linux</code> are <a href=\"https://github.com/rake-compiler/rake-compiler-dock/issues/117\">treated as aliases for <code class=\"language-plaintext highlighter-rouge\">-linux-gnu</code></a>.</p>\n\n<p>RubyGems is now working on a more expressive system inspired by Python’s wheels. Samuel Giddins has been building <a href=\"https://blog.rubygems.org/2025/08/21/july-rubygems-updates.html\">experimental support for tag-based platform matching</a>, using a filename format of <code class=\"language-plaintext highlighter-rouge\">{gem_name}-{version}-{ruby tag}-{abi tag}-{platform tag}.gem2</code>. The proposed dimensions for platform matching are Ruby ABI, OS, OS version, CPU architecture, libc implementation, and libc version. This is <a href=\"https://traveling.engineer/posts/goals-for-binary-gems/\">almost exactly the same set of dimensions</a> that Python’s wheel tags evolved to cover, arrived at independently.</p>\n\n<h3 id=\"debian-multiarch-tuples\">Debian multiarch tuples</h3>\n\n<p>Debian uses <a href=\"https://wiki.debian.org/Multiarch/Tuples\">multiarch tuples</a> as directory names for architecture-specific library paths. <code class=\"language-plaintext highlighter-rouge\">/usr/lib/x86_64-linux-gnu/</code> holds 64-bit x86 libraries, <code class=\"language-plaintext highlighter-rouge\">/usr/lib/aarch64-linux-gnu/</code> holds ARM64 libraries. The format is based on normalized GNU triplets but Debian chose its own canonical forms.</p>\n\n<p>The Debian architecture name <code class=\"language-plaintext highlighter-rouge\">amd64</code> maps to the multiarch tuple <code class=\"language-plaintext highlighter-rouge\">x86_64-linux-gnu</code>. The architecture name <code class=\"language-plaintext highlighter-rouge\">arm64</code> maps to <code class=\"language-plaintext highlighter-rouge\">aarch64-linux-gnu</code>. <code class=\"language-plaintext highlighter-rouge\">armhf</code> maps to <code class=\"language-plaintext highlighter-rouge\">arm-linux-gnueabihf</code>. That last one is notable: the hard-float/soft-float distinction was originally supposed to go in the vendor field, which is what <a href=\"https://wiki.debian.org/ArmHardFloatPort\">GCC developers recommended</a>. But the vendor field is semantically private, not meant for cross-distribution use, so Debian instead appended <code class=\"language-plaintext highlighter-rouge\">hf</code> to the ABI component: <code class=\"language-plaintext highlighter-rouge\">gnueabihf</code> vs <code class=\"language-plaintext highlighter-rouge\">gnueabi</code>. The naming was argued over for months.</p>\n\n<p>Multiarch exists to solve co-installation: running 32-bit and 64-bit libraries side by side on the same system. The tuple goes into the filesystem path, so it has to be a valid directory name, stable across releases, and unique per ABI. This is a different set of constraints than a compiler target triple. GCC and Debian independently developed tuple formats that look similar but diverge in the details, because they’re optimizing for different things.</p>\n\n<h3 id=\"rust\">Rust</h3>\n\n<p>Rust uses target triples that look like LLVM triples but are <a href=\"https://doc.rust-lang.org/rustc/platform-support.html\">curated and normalized</a>. <code class=\"language-plaintext highlighter-rouge\">x86_64-unknown-linux-gnu</code>, <code class=\"language-plaintext highlighter-rouge\">aarch64-apple-darwin</code>, <code class=\"language-plaintext highlighter-rouge\">x86_64-pc-windows-msvc</code>. Where LLVM’s triples are sprawling and sometimes inconsistent, Rust maintains an explicit list organized into <a href=\"https://doc.rust-lang.org/rustc/target-tier-policy.html\">tiers</a>.</p>\n\n<p>Tier 1 targets are “guaranteed to work” with automated testing on every commit. As of 2025, <a href=\"https://blog.rust-lang.org/2025/10/30/Rust-1.91.0/\">aarch64-apple-darwin reached Tier 1</a> while x86_64-apple-darwin dropped to Tier 2, reflecting Apple Silicon’s dominance. Tier 2 targets build but may not pass all tests. Tier 3 targets are community-maintained.</p>\n\n<p><a href=\"https://rust-lang.github.io/rfcs/0131-target-specification.html\">RFC 0131</a> established that Rust target triples map to but aren’t identical to LLVM triples. A Rust target specification is a JSON file with an <code class=\"language-plaintext highlighter-rouge\">llvm-target</code> field that can differ from the Rust-facing name. This lets Rust present clean, consistent names to users while translating to whatever LLVM expects internally. The <a href=\"https://github.com/bytecodealliance/target-lexicon\">target-lexicon</a> crate from the Bytecode Alliance provides parsing and matching for these triples.</p>\n\n<h3 id=\"zig\">Zig</h3>\n\n<p>Zig inherited LLVM’s target triples but is actively redesigning them. An <a href=\"https://github.com/ziglang/zig/issues/20690\">accepted proposal</a> by Alex Ronne Petersen would turn triples into quadruples, splitting the C library choice (API) from the ABI into separate components: <code class=\"language-plaintext highlighter-rouge\">&lt;arch&gt;-&lt;os&gt;-&lt;api&gt;-&lt;abi&gt;</code>.</p>\n\n<p>The proposal includes what it calls “a fairly exhaustive survey of the ISA and ABI landscape,” and the scale of the problem becomes clear quickly. RISC-V alone defines eight distinct ABIs (ilp32, ilp32f, ilp32d, ilp32e, lp64, lp64f, lp64d, lp64q). PowerPC has multiple ABIs (SVR4, EABI, Apple, ELFv1, ELFv2, AIX) plus variations in <code class=\"language-plaintext highlighter-rouge\">long double</code> representation. LoongArch is “the only architecture I’m aware of to have done the sane thing” and put the ABI information into the ABI component from the start; the current triple format can’t express most of these combinations cleanly.</p>\n\n<p>Under the proposed scheme, <code class=\"language-plaintext highlighter-rouge\">aarch64-linux-gnu</code> becomes <code class=\"language-plaintext highlighter-rouge\">aarch64-linux-gnu-lp64</code> and <code class=\"language-plaintext highlighter-rouge\">powerpc64le-linux-musl</code> becomes <code class=\"language-plaintext highlighter-rouge\">powerpc64le-linux-musl-elfv2+ldbl64</code>, with the <code class=\"language-plaintext highlighter-rouge\">+</code> syntax letting ABI options compose like feature flags. The proposal quotes <a href=\"https://ziglang.org/learn/overview/\">Zig’s design philosophy</a>: “Edge cases matter” and “Avoid local maximums,” arguing that just because GNU triples are ubiquitous doesn’t mean they’re good. It’s the same lesson Python learned from the other direction: it took four PEPs across five years to get manylinux right, discovering at each step that the problem space was bigger than the previous design assumed. Zig is trying to get it right from the compiler side before the package ecosystem calcifies around a format that can’t express what it needs to.</p>\n\n<h3 id=\"conan-and-vcpkg\">Conan and vcpkg</h3>\n\n<p>C and C++ have <a href=\"/2026/01/27/the-c-shaped-hole-in-package-management.html\">no canonical package registry</a>, so the two main C/C++ package managers each invented their own platform identification from scratch.</p>\n\n<p><a href=\"https://conan.io/\">Conan</a> doesn’t use platform strings at all. It uses <a href=\"https://docs.conan.io/2/reference/config_files/settings.html\">hierarchical settings</a>: <code class=\"language-plaintext highlighter-rouge\">os=Macos</code>, <code class=\"language-plaintext highlighter-rouge\">arch=armv8</code>, <code class=\"language-plaintext highlighter-rouge\">compiler=apple-clang</code>, <code class=\"language-plaintext highlighter-rouge\">compiler.version=15</code>. The settings are separate key-value pairs rather than a combined string, which means Conan never had to decide on a separator or field order. It also means Conan calls ARM64 <code class=\"language-plaintext highlighter-rouge\">armv8</code>, adding a fourth name for the architecture alongside <code class=\"language-plaintext highlighter-rouge\">aarch64</code>, <code class=\"language-plaintext highlighter-rouge\">arm64</code>, and <code class=\"language-plaintext highlighter-rouge\">x64</code>. For cross-compilation, Conan 2 uses <a href=\"https://docs.conan.io/2/tutorial/consuming_packages/cross_building_with_conan.html\">dual profiles</a> (<code class=\"language-plaintext highlighter-rouge\">--profile:build</code> and <code class=\"language-plaintext highlighter-rouge\">--profile:host</code>) rather than encoding build and target in a single string.</p>\n\n<p><a href=\"https://vcpkg.io/\">vcpkg</a> borrowed the word “triplet” but simplified the format to <a href=\"https://learn.microsoft.com/en-us/vcpkg/concepts/triplets\"><code class=\"language-plaintext highlighter-rouge\">arch-os</code></a> with optional suffixes: <code class=\"language-plaintext highlighter-rouge\">x64-windows</code>, <code class=\"language-plaintext highlighter-rouge\">arm64-osx</code>, <code class=\"language-plaintext highlighter-rouge\">x64-linux</code>, <code class=\"language-plaintext highlighter-rouge\">x64-windows-static</code>. There’s no vendor or ABI field, and vcpkg uses <code class=\"language-plaintext highlighter-rouge\">x64</code> (the Windows SDK convention) and <code class=\"language-plaintext highlighter-rouge\">osx</code> rather than <code class=\"language-plaintext highlighter-rouge\">darwin</code> or <code class=\"language-plaintext highlighter-rouge\">macos</code>. The <a href=\"https://learn.microsoft.com/en-us/vcpkg/users/triplets\">documentation</a> cites the Android NDK’s naming as inspiration for custom triplets, which is itself a variation on GNU triples with an API level suffix like <code class=\"language-plaintext highlighter-rouge\">aarch64-linux-android21</code>.</p>\n\n<h3 id=\"net\">.NET</h3>\n\n<p>.NET has <a href=\"https://learn.microsoft.com/en-us/dotnet/core/rid-catalog\">Runtime Identifiers</a> (RIDs) that follow an <code class=\"language-plaintext highlighter-rouge\">os[-version]-arch</code> pattern: <code class=\"language-plaintext highlighter-rouge\">linux-x64</code>, <code class=\"language-plaintext highlighter-rouge\">win-arm64</code>, <code class=\"language-plaintext highlighter-rouge\">osx-arm64</code>, <code class=\"language-plaintext highlighter-rouge\">linux-musl-x64</code>. The format puts OS first, which is the opposite of most other schemes. Starting with .NET 8, Microsoft <a href=\"https://learn.microsoft.com/en-us/dotnet/core/compatibility/deployment/8.0/rid-asset-list\">strongly recommends</a> portable RIDs without version numbers, but version-specific RIDs like <code class=\"language-plaintext highlighter-rouge\">win10-x64</code> and <code class=\"language-plaintext highlighter-rouge\">osx.13-arm64</code> still exist for backward compatibility. The RID system includes a compatibility fallback graph: <code class=\"language-plaintext highlighter-rouge\">osx-arm64</code> falls back to <code class=\"language-plaintext highlighter-rouge\">osx</code> which falls back to <code class=\"language-plaintext highlighter-rouge\">unix</code> which falls back to <code class=\"language-plaintext highlighter-rouge\">any</code>. NuGet uses these RIDs to select platform-specific assets from packages.</p>\n\n<h3 id=\"others\">Others</h3>\n\n<p><a href=\"https://swiftinit.org/docs/swift-package-manager/basics/triple\">Swift Package Manager</a> uses LLVM target triples directly (<code class=\"language-plaintext highlighter-rouge\">arm64-apple-macosx15.0</code>, <code class=\"language-plaintext highlighter-rouge\">x86_64-unknown-linux-gnu</code>), inheriting both the format and its quirks without adding new ones. <a href=\"https://kotlinlang.org/docs/native-target-support.html\">Kotlin Multiplatform</a> wraps LLVM triples in camelCase Gradle target names (<code class=\"language-plaintext highlighter-rouge\">linuxX64</code>, <code class=\"language-plaintext highlighter-rouge\">macosArm64</code>, <code class=\"language-plaintext highlighter-rouge\">iosSimulatorArm64</code>) that are friendlier to type but map one-to-one to underlying triples.</p>\n\n<p>Java doesn’t have a standard platform string format because most Java code doesn’t need one. When it does, the <a href=\"https://github.com/trustin/os-maven-plugin\">os-maven-plugin</a> normalizes platform detection into a classifier string like <code class=\"language-plaintext highlighter-rouge\">linux-x86_64</code> or <code class=\"language-plaintext highlighter-rouge\">osx-aarch_64</code>, adding an underscore to <code class=\"language-plaintext highlighter-rouge\">aarch_64</code> that no other ecosystem uses.</p>\n\n<p><a href=\"https://docs.brew.sh/Bottles\">Homebrew</a> names its bottle builds using macOS marketing names: <code class=\"language-plaintext highlighter-rouge\">arm64_sonoma</code>, <code class=\"language-plaintext highlighter-rouge\">arm64_ventura</code>, <code class=\"language-plaintext highlighter-rouge\">ventura</code> (Intel implied). On Linux it’s <code class=\"language-plaintext highlighter-rouge\">x86_64_linux</code>. This makes Homebrew the only package manager that encodes the OS release name rather than a version number, and bottles break whenever Apple ships a new macOS version until Homebrew adds it.</p>\n\n<p><a href=\"https://nixos.org/\">Nix</a> uses simple <code class=\"language-plaintext highlighter-rouge\">arch-os</code> pairs like <code class=\"language-plaintext highlighter-rouge\">x86_64-linux</code> and <code class=\"language-plaintext highlighter-rouge\">aarch64-darwin</code>, clean and minimal but unable to distinguish between glibc and musl Linux in the system string.</p>\n\n<h3 id=\"comparison\">Comparison</h3>\n\n<p>The same four platforms, named by each ecosystem:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th> </th>\n      <th>64-bit x86 Linux</th>\n      <th>ARM64 macOS</th>\n      <th>64-bit x86 Windows</th>\n      <th>ARM64 Linux</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>GCC/LLVM</td>\n      <td>x86_64-pc-linux-gnu</td>\n      <td>aarch64-apple-darwin</td>\n      <td>x86_64-pc-windows-msvc</td>\n      <td>aarch64-unknown-linux-gnu</td>\n    </tr>\n    <tr>\n      <td>Go</td>\n      <td>linux/amd64</td>\n      <td>darwin/arm64</td>\n      <td>windows/amd64</td>\n      <td>linux/arm64</td>\n    </tr>\n    <tr>\n      <td>Node.js</td>\n      <td>linux-x64</td>\n      <td>darwin-arm64</td>\n      <td>win32-x64</td>\n      <td>linux-arm64</td>\n    </tr>\n    <tr>\n      <td>Python wheels</td>\n      <td>manylinux_2_17_x86_64</td>\n      <td>macosx_11_0_arm64</td>\n      <td>win_amd64</td>\n      <td>manylinux_2_17_aarch64</td>\n    </tr>\n    <tr>\n      <td>RubyGems</td>\n      <td>x86_64-linux</td>\n      <td>arm64-darwin</td>\n      <td>x64-mingw-ucrt</td>\n      <td>aarch64-linux</td>\n    </tr>\n    <tr>\n      <td>Debian</td>\n      <td>x86_64-linux-gnu</td>\n      <td>(N/A)</td>\n      <td>(N/A)</td>\n      <td>aarch64-linux-gnu</td>\n    </tr>\n    <tr>\n      <td>Rust</td>\n      <td>x86_64-unknown-linux-gnu</td>\n      <td>aarch64-apple-darwin</td>\n      <td>x86_64-pc-windows-msvc</td>\n      <td>aarch64-unknown-linux-gnu</td>\n    </tr>\n    <tr>\n      <td>Zig (current)</td>\n      <td>x86_64-linux-gnu</td>\n      <td>aarch64-macos-none</td>\n      <td>x86_64-windows-msvc</td>\n      <td>aarch64-linux-gnu</td>\n    </tr>\n    <tr>\n      <td>Conan</td>\n      <td>os=Linux, arch=x86_64</td>\n      <td>os=Macos, arch=armv8</td>\n      <td>os=Windows, arch=x86_64</td>\n      <td>os=Linux, arch=armv8</td>\n    </tr>\n    <tr>\n      <td>vcpkg</td>\n      <td>x64-linux</td>\n      <td>arm64-osx</td>\n      <td>x64-windows</td>\n      <td>arm64-linux</td>\n    </tr>\n    <tr>\n      <td>.NET</td>\n      <td>linux-x64</td>\n      <td>osx-arm64</td>\n      <td>win-x64</td>\n      <td>linux-arm64</td>\n    </tr>\n    <tr>\n      <td>Nix</td>\n      <td>x86_64-linux</td>\n      <td>aarch64-darwin</td>\n      <td>(N/A)</td>\n      <td>aarch64-linux</td>\n    </tr>\n    <tr>\n      <td>Homebrew</td>\n      <td>x86_64_linux</td>\n      <td>arm64_sonoma</td>\n      <td>(N/A)</td>\n      <td>(N/A)</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The same four platforms yield three names for 64-bit x86 (<code class=\"language-plaintext highlighter-rouge\">x86_64</code>, <code class=\"language-plaintext highlighter-rouge\">amd64</code>, <code class=\"language-plaintext highlighter-rouge\">x64</code>), at least five for ARM64 (<code class=\"language-plaintext highlighter-rouge\">aarch64</code>, <code class=\"language-plaintext highlighter-rouge\">arm64</code>, <code class=\"language-plaintext highlighter-rouge\">armv8</code>, Maven’s <code class=\"language-plaintext highlighter-rouge\">aarch_64</code>, and Homebrew’s <code class=\"language-plaintext highlighter-rouge\">arm64</code> with an underscore separator), three for macOS (<code class=\"language-plaintext highlighter-rouge\">darwin</code>, <code class=\"language-plaintext highlighter-rouge\">macos</code>/<code class=\"language-plaintext highlighter-rouge\">osx</code>, <code class=\"language-plaintext highlighter-rouge\">macosx</code>, plus Homebrew’s version-specific names), and two for Windows (<code class=\"language-plaintext highlighter-rouge\">win32</code>, <code class=\"language-plaintext highlighter-rouge\">windows</code>/<code class=\"language-plaintext highlighter-rouge\">win</code>). RubyGems is interesting here because it uses both ARM64 names: <code class=\"language-plaintext highlighter-rouge\">arm64-darwin</code> on macOS (following Apple’s convention) but <code class=\"language-plaintext highlighter-rouge\">aarch64-linux</code> on Linux (following the kernel’s convention). Two different names for the same architecture within a single ecosystem, while Conan sidesteps the entire format question by not using strings at all.</p>\n\n<h3 id=\"why-everything-diverges\">Why everything diverges</h3>\n\n<p>The architecture naming splits trace back to who each ecosystem inherited from. Go took <code class=\"language-plaintext highlighter-rouge\">amd64</code> from Plan 9 and Debian, both of which used AMD’s name since AMD designed the 64-bit extension to x86. Node got <code class=\"language-plaintext highlighter-rouge\">x64</code> from V8, which followed the Windows SDK convention. Python’s <code class=\"language-plaintext highlighter-rouge\">x86_64</code> comes straight from <code class=\"language-plaintext highlighter-rouge\">uname -m</code> on Linux via <code class=\"language-plaintext highlighter-rouge\">sysconfig.get_platform()</code>. Debian itself uses <code class=\"language-plaintext highlighter-rouge\">amd64</code> as the architecture name but <code class=\"language-plaintext highlighter-rouge\">x86_64-linux-gnu</code> as the multiarch tuple, because the two serve different purposes.</p>\n\n<p>The structural differences run deeper and trace to what each ecosystem actually ships. Go statically links by default, so it never needed a vendor or ABI field, while Python wheels contain compiled C extensions that link against system libraries and ended up encoding the glibc version out of necessity. Most npm packages are pure JavaScript, which is why Node’s platform strings never grew libc or OS version fields. Rust curates its triple list with a tier system because it wants to guarantee that specific targets work with specific levels of CI coverage. Conan gave up on strings entirely in favor of structured key-value settings, avoiding the parsing and separator problems but making it harder to use where a single identifier is expected, like a filename or URL path. .NET’s RIDs put OS first (<code class=\"language-plaintext highlighter-rouge\">linux-x64</code> rather than <code class=\"language-plaintext highlighter-rouge\">x64-linux</code>) because the runtime’s fallback graph cares more about OS compatibility than architecture when selecting assets.</p>\n\n<h3 id=\"dimensions\">Dimensions</h3>\n\n<p>A platform identifier that fully describes a compilation target seems to need at least five dimensions: CPU architecture (x86_64, aarch64, riscv64), operating system (linux, darwin, windows), OS version (macOS 11+, sometimes implicit), ABI or calling convention (gnu, musl, msvc, eabihf), and libc implementation and version (glibc 2.17, musl 1.2, Linux-specific but critical for binary compatibility). Five is a lower bound. Zig’s ABI survey suggests the real number is higher once you start cataloguing calling convention variations across architectures, and none of these dimensions account for CPU feature levels (AVX2, SSE4.2) that matter for optimized builds.</p>\n\n<p>Different ecosystems cover different subsets depending on what problems they need to solve. Go and Node get by with just arch and OS, while Python needs four dimensions because wheels contain compiled C extensions that care about OS version and glibc compatibility. Conan’s structured settings cover four or five dimensions depending on how you count compiler metadata, and Rust sits somewhere in between with three or four. The GNU/LLVM triple format has slots for all five but doesn’t enforce consistency in how they’re filled. Zig’s quadruple proposal is the most explicit attempt I’ve seen, with the fourth component separating the libc choice (API) from the calling convention (ABI), though the RISC-V and PowerPC examples in the proposal suggest that even this may not be enough without the <code class=\"language-plaintext highlighter-rouge\">+feature</code> extension syntax.</p>\n\n<h3 id=\"prior-art\">Prior art</h3>\n\n<p><a href=\"https://github.com/archspec/archspec\">archspec</a>, extracted from <a href=\"https://spack.io/\">Spack</a>, models CPU microarchitecture naming as a directed acyclic graph. Its <a href=\"https://github.com/archspec/archspec-json/blob/master/cpu/microarchitectures.json\">JSON database</a> tracks which microarchitectures are compatible with which, including feature sets like AVX2 and SSE4.2 and x86-64 microarchitecture levels (v2, v3, v4). It’s probably the most rigorous treatment of the “which CPU can run binaries compiled for which other CPU” question, but it’s silent on OS, libc, and ABI.</p>\n\n<p>Python’s manylinux system (<a href=\"https://peps.python.org/pep-0513/\">PEP 513</a>, <a href=\"https://peps.python.org/pep-0600/\">PEP 600</a>) took a different slice of the problem, encoding glibc version into wheel platform tags. Four PEPs across five years to get from <code class=\"language-plaintext highlighter-rouge\">manylinux1</code> to the general <code class=\"language-plaintext highlighter-rouge\">manylinux_x_y</code> pattern. Ruby’s <a href=\"https://traveling.engineer/posts/goals-for-binary-gems/\">binary gems RFC</a> arrived at nearly the same set of dimensions: Ruby ABI, OS, OS version, CPU architecture, libc implementation, libc version. The proposed <code class=\"language-plaintext highlighter-rouge\">.gem2</code> filename format mirrors Python’s wheel naming, and I haven’t found evidence that either project drew directly from the other. Independent convergence on the same dimensions is arguably stronger evidence that those dimensions are the right ones than if one had simply copied the other’s homework.</p>\n\n<p>Zig’s <a href=\"https://github.com/ziglang/zig/issues/20690\">target quadruple proposal</a> goes deeper on ABI enumeration than anything else I’ve found, cataloging calling convention variations across RISC-V, PowerPC, MIPS, and LoongArch. It’s focused on compiler targets rather than package management, so it doesn’t touch the libc version compatibility question that Python and Ruby spent years on. The Bytecode Alliance’s <a href=\"https://crates.io/crates/target-lexicon\">target-lexicon</a> crate parses and matches Rust/LLVM triples specifically, and the <a href=\"https://crates.io/crates/platforms\">platforms</a> crate maintains the tier list, but neither attempts to generalize across ecosystems.</p>\n\n<h3 id=\"user-agents\">User agents</h3>\n\n<p>Platform strings remind me of browser user agent strings, which went through a similar process of rational local decisions producing global incoherence. <a href=\"https://www.rfc-editor.org/rfc/rfc1945\">RFC 1945</a> defined the User-Agent header in 1996 with a simple grammar: product name, slash, version. NCSA Mosaic sent <code class=\"language-plaintext highlighter-rouge\">NCSA_Mosaic/2.0 (Windows 3.1)</code>. Netscape Navigator, codenamed <a href=\"https://en.wikipedia.org/wiki/Mozilla_(mascot)\">“Mozilla”</a> (a portmanteau of “Mosaic” and “Godzilla”), sent <code class=\"language-plaintext highlighter-rouge\">Mozilla/1.0 (Win3.1)</code>. Netscape supported frames; Mosaic didn’t. Web developers started checking for “Mozilla” in the user agent and sending frames-based pages only to browsers that matched.</p>\n\n<p>When Internet Explorer 3 shipped with frame support, it couldn’t get the frames-based pages because it wasn’t Mozilla. Microsoft’s solution was to declare IE “<a href=\"https://webaim.org/blog/user-agent-string-history/\">Mozilla compatible</a>”: <code class=\"language-plaintext highlighter-rouge\">Mozilla/2.0 (compatible; MSIE 3.02; Windows 95)</code>. Since most sniffers only checked the prefix, IE passed and got the right pages. Then Konqueror’s KHTML engine was being blocked by sites that sniffed for Gecko, so it added <code class=\"language-plaintext highlighter-rouge\">(KHTML, like Gecko)</code> to its string. Apple forked KHTML to make WebKit and Safari needed to pass checks for both Gecko and KHTML, so Safari’s user agent claimed to be Mozilla, said its engine was “like Gecko,” and referenced KHTML. When Chrome shipped in 2008 using WebKit, it inherited all of this and <a href=\"https://humanwhocodes.com/blog/2010/01/12/history-of-the-user-agent-string/\">added its own token</a>:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US) AppleWebKit/525.13\n    (KHTML, like Gecko) Chrome/0.2.149.27 Safari/525.13\n</code></pre></div></div>\n\n<p>Every token except <code class=\"language-plaintext highlighter-rouge\">Chrome</code> is a compatibility claim. It’s not Mozilla, not Safari, and its engine descends from KHTML but is no longer KHTML. Chrome has since <a href=\"https://www.chromium.org/updates/ua-reduction/\">frozen most of the string</a> to reduce fingerprinting, replacing it with structured <a href=\"https://wicg.github.io/ua-client-hints/\">Client Hints</a> that servers can request individually. But the old string persists because too much code parses it.</p>\n\n<p>Platform strings aren’t adversarial in the same way, but they share the path-dependency. Every tool that works across ecosystems maintains its own mapping between formats. <a href=\"https://github.com/evanw/esbuild/blob/main/lib/npm/node-platform.ts\">esbuild</a> maps Node’s <code class=\"language-plaintext highlighter-rouge\">process.platform</code>/<code class=\"language-plaintext highlighter-rouge\">process.arch</code> to package names, <a href=\"https://cibuildwheel.pypa.io/\">cibuildwheel</a> maps Python platform tags to CI matrix entries, and <a href=\"https://github.com/rake-compiler/rake-compiler\">rake-compiler-dock</a> maps RubyGems platforms to GCC cross-compilation targets. These mappings are maintained independently, and discrepancies between them surface as bugs in specific platform combinations.</p>\n\n<p>In the spirit of <a href=\"https://xkcd.com/927/\">XKCD 927</a>, I’ve started building <a href=\"https://github.com/git-pkgs/platforms\">git-pkgs/platforms</a> as an attempt at a shared translation layer. The <a href=\"https://github.com/git-pkgs/platforms/blob/main/SPEC.md\">spec</a> defines canonical names and parse/format rules, and the <a href=\"https://github.com/git-pkgs/platforms/tree/main/data\">mapping data</a> lives in three JSON files (<code class=\"language-plaintext highlighter-rouge\">arches.json</code>, <code class=\"language-plaintext highlighter-rouge\">oses.json</code>, <code class=\"language-plaintext highlighter-rouge\">platforms.json</code>) that could be consumed by any language without taking a Go dependency. Writing the mapping data has been a good way to discover just how many special cases exist: RubyGems using <code class=\"language-plaintext highlighter-rouge\">arm64</code> on macOS but <code class=\"language-plaintext highlighter-rouge\">aarch64</code> on Linux, Rust calling RISC-V <code class=\"language-plaintext highlighter-rouge\">riscv64gc</code> while everyone else uses <code class=\"language-plaintext highlighter-rouge\">riscv64</code>, Debian spelling little-endian MIPS as <code class=\"language-plaintext highlighter-rouge\">mipsel</code> while Go uses <code class=\"language-plaintext highlighter-rouge\">mipsle</code>.</p>\n\n<h3 id=\"alignment\">Alignment</h3>\n\n<p>The same platform identification problem keeps getting solved because the answers don’t seem to travel well. Python’s manylinux and Ruby’s binary gems RFC converge on the same dimensions but use different names, Zig’s ABI research seems directly relevant to Rust’s target specification work but lives in a different issue tracker, and archspec’s microarchitecture DAG could probably inform platform matching beyond Spack but as far as I can tell nobody else uses it.</p>\n\n<p>Even <a href=\"https://github.com/package-url/purl-spec\">PURL</a>, which solved the “which package” identity problem across ecosystems, punts on platform. Each PURL type defines its own qualifiers: <code class=\"language-plaintext highlighter-rouge\">pkg:deb</code> uses <code class=\"language-plaintext highlighter-rouge\">arch</code>, <code class=\"language-plaintext highlighter-rouge\">pkg:gem</code> uses <code class=\"language-plaintext highlighter-rouge\">platform</code>, <code class=\"language-plaintext highlighter-rouge\">pkg:conda</code> uses <code class=\"language-plaintext highlighter-rouge\">subdir</code>, and <code class=\"language-plaintext highlighter-rouge\">pkg:npm</code> has no platform qualifier at all. The values use whatever conventions each ecosystem already has, with no normalization. There’s been <a href=\"https://github.com/package-url/purl-spec/issues/186\">ongoing pressure</a> from the security community to standardize <code class=\"language-plaintext highlighter-rouge\">arch</code> and <code class=\"language-plaintext highlighter-rouge\">platform</code> qualifiers across types so that vulnerability scanners don’t need the massive mapping files that tools like <code class=\"language-plaintext highlighter-rouge\">cibuildwheel</code> currently maintain, but the discussions have been open since 2022 without resolution. The one standard that was supposed to unify package identity across ecosystems left platform identification as an exercise for each type definition.</p>\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:triple\">\n      <p>The name “triple” stuck even after a fourth field got added. <code class=\"language-plaintext highlighter-rouge\">x86_64-pc-linux-gnu</code> has four components but everyone still calls it a triple. See <a href=\"https://mcyoung.xyz/2025/04/14/target-triples/\">“What the Hell Is a Target Triple?”</a> for more on this naming. <a href=\"#fnref:triple\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>",
    "description": "An M1 Mac is aarch64-apple-darwin, arm64-darwin, darwin/arm64, or macosx_11_0_arm64 depending on which tool you ask.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-17T10:00:00+00:00",
    "fetched_at": "2026-02-17T12:22:09.194918",
    "url_hash": "73b168bf007d8d89864a00f10d17580b"
  },
  {
    "title": "Weekly Update 491",
    "link": "https://www.troyhunt.com/weekly-update-491/",
    "content": "<img src=\"https://www.troyhunt.com/content/images/2026/02/Splash-Template.jpg\" alt=\"Weekly Update 491\"><p>Well, the ESP32 Bluetooth bridge experiment was a complete failure. Not the radios themselves, they&apos;re actually pretty cool, but there&apos;s just no way I could get the Yale locks to be reliably operated by them. At a guess, BLE is a bit too passive to detect state changes, and unless it was awake and communicating, it just had no idea what was happening with the locks. So, I&apos;ve now silenced all lock-related alerts and am focusing on making the wifi network as reliable as possible in the hope the locks actually become responsive. If that doesn&apos;t work, those <a href=\"https://www.aqarastore.com.au/products/aqara-smart-lock-u400-with-m100-kit?ref=troyhunt.com\" rel=\"noreferrer\">Aqara U400s</a> look <em>really</em> sweet...</p>\n<!--kg-card-begin: html-->\n<div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 491\"></a></div><div style=\"width: 175px; display: inline-block; margin-right: 3px;\"><a href=\"https://www.youtube.com/playlist?list=PL7LAAxaabizMAXnJe0s3xjQ30q12EVmjt&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2024/09/Watch-and-Listen-on-YouTube.svg\" alt=\"Weekly Update 491\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 491\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 491\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/gHAhdBwV6lc\" title=\"YouTube video player\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen loading=\"lazy\" spellcheck=\"false\"></iframe></div>\n<!--kg-card-end: html-->\n",
    "description": "Well, the ESP32 Bluetooth bridge experiment was a complete failure. Not the radios themselves, they&apos;re actually pretty cool, but there&apos;s just no way I could get the Yale locks to be reliably operated by them. At a guess, BLE is a bit too passive to detect",
    "is_fulltext": true,
    "source": "Troy Hunt",
    "pub_date": "Tue, 17 Feb 2026 05:09:12 GMT",
    "fetched_at": "2026-02-17T12:22:35.856089",
    "url_hash": "a9da2f7eeb68ce456d51d9a26a22dbd6"
  }
]