[
  {
    "title": "Patch Tuesday, February 2026 Edition",
    "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
    "content": "<p><strong>Microsoft</strong> today released updates to fix more than 50 security holes in its <strong>Windows</strong> operating systems and other software, including patches for a whopping six &#8220;zero-day&#8221; vulnerabilities that attackers are already exploiting in the wild.</p>\n<p><img decoding=\"async\" class=\" wp-image-60331 aligncenter\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate.png\" alt=\"\" width=\"749\" height=\"496\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate.png 923w, https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate-768x508.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate-782x518.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /></p>\n<p>Zero-day #1 this month is <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21510\" target=\"_blank\" rel=\"noopener\">CVE-2026-21510</a>, a security feature bypass vulnerability in <strong>Windows Shell</strong> wherein a single click on a malicious link can quietly bypass Windows protections and run attacker-controlled content without warning or consent dialogs. CVE-2026-21510 affects all currently supported versions of Windows.</p>\n<p>The zero-day flaw <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21513\" target=\"_blank\" rel=\"noopener\">CVE-2026-21513</a> is a security bypass bug targeting <strong>MSHTML</strong>, the proprietary engine of the default Web browser in Windows. <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21514\" target=\"_blank\" rel=\"noopener\">CVE-2026-21514</a> is a related security feature bypass in <strong>Microsoft Word.</strong></p>\n<p>The zero-day <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21533\" target=\"_blank\" rel=\"noopener\">CVE-2026-21533</a> allows local attackers to elevate their user privileges to &#8220;SYSTEM&#8221; level access in <strong>Windows Remote Desktop Services</strong>. <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21519\" target=\"_blank\" rel=\"noopener\">CVE-2026-21519</a> is a zero-day elevation of privilege flaw in the <strong>Desktop Window Manager</strong> (DWM), a key component of Windows that organizes windows on a user’s screen. Microsoft fixed a different zero-day in DWM <a href=\"https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/\" target=\"_blank\" rel=\"noopener\">just last month</a>.</p>\n<p>The sixth zero-day is <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2026-21525\" target=\"_blank\" rel=\"noopener\">CVE-2026-21525</a>, a potentially disruptive denial-of-service vulnerability in the <strong>Windows Remote Access Connection Manager</strong>, the service responsible for maintaining VPN connections to corporate networks.<span id=\"more-73188\"></span></p>\n<p><strong>Chris Goettl</strong> at <strong>Ivanti</strong> reminds us Microsoft has issued several out-of-band security updates since January&#8217;s Patch Tuesday. On January 17, Microsoft pushed a fix that resolved a credential prompt failure when attempting remote desktop or remote application connections. On January 26, Microsoft patched a zero-day security feature bypass vulnerability (<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21509\" target=\"_blank\" rel=\"noopener\">CVE-2026-21509</a>) in <strong>Microsoft Office</strong>.</p>\n<p><strong>Kev Breen</strong> at <strong>Immersive</strong> notes that this month&#8217;s Patch Tuesday includes several fixes for remote code execution vulnerabilities affecting <strong>GitHub Copilot</strong> and multiple integrated development environments (IDEs), including <strong>VS Code</strong>, <strong>Visual Studio</strong>, and <strong>JetBrains</strong> products. The relevant CVEs are <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21516\" target=\"_blank\" rel=\"noopener\">CVE-2026-21516</a>, <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21523\" target=\"_blank\" rel=\"noopener\">CVE-2026-21523</a>, and <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21256\" target=\"_blank\" rel=\"noopener\">CVE-2026-21256</a>.</p>\n<p>Breen said the AI vulnerabilities Microsoft patched this month stem from a command injection flaw that can be triggered through prompt injection, or tricking the AI agent into doing something it shouldn&#8217;t &#8212; like executing malicious code or commands.</p>\n<p>&#8220;Developers are high-value targets for threat actors, as they often have access to sensitive data such as API keys and secrets that function as keys to critical infrastructure, including privileged AWS or Azure API keys,&#8221; Breen said. &#8220;When organizations enable developers and automation pipelines to use LLMs and agentic AI, a malicious prompt can have significant impact. This does not mean organizations should stop using AI. It does mean developers should understand the risks, teams should clearly identify which systems and workflows have access to AI agents, and least-privilege principles should be applied to limit the blast radius if developer secrets are compromised.&#8221;</p>\n<p>The <strong>SANS Internet Storm Center</strong> has a <a href=\"https://isc.sans.edu/diary/Microsoft%20Patch%20Tuesday%20-%20February%202026/32700\" target=\"_blank\" rel=\"noopener\">clickable breakdown</a> of each individual fix this month from Microsoft, indexed by severity and CVSS score. Enterprise Windows admins involved in testing patches before rolling them out should keep an eye on <a href=\"https://www.askwoody.com/2026/february-2026-security-updates/\" target=\"_blank\" rel=\"noopener\">askwoody.com</a>, which often has the skinny on wonky updates. Please don’t neglect to back up your data if it has been a while since you&#8217;ve done that, and feel free to sound off in the comments if you experience problems installing any of these fixes.</p>\n",
    "description": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
    "is_fulltext": true,
    "source": "Krebs on Security",
    "pub_date": "Tue, 10 Feb 2026 21:49:53 +0000",
    "fetched_at": "2026-02-11T12:25:45.726893",
    "url_hash": "d39cb96c8d24a487942391ee9863e958"
  },
  {
    "title": "Last year, all my non-programmer friends built apps",
    "link": "https://idiallo.com/blog/my-non-programmer-friends-built-apps?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>Last year, all my non-programmer friends were building apps. Yet today, those apps are nowhere to be found.</p>\n\n<p>Everyone followed the ads. They signed up for Lovable and all the fancy app-building services that exist. My LinkedIn feed was filled with PMs who had discovered new powers. Some posted bullet-point lists of \"things to do to be successful with AI.\" \"Don't work hard, work smart,\" they said, as if it were a deep insight.</p>\n\t\t\t<p>I must admit, I was a bit jealous. With a full-time job, I don't get to work on my cool side project, which has collected enough dust to turn into a dune. There's probably a little mouse living inside. I'll call him Muad'Dib. </p>\n\n<p>What was I talking about? Right. The apps.</p>\n\n<p>Today, my friends are silent. I still see the occasional post on LinkedIn, but they don't garner the engagement they used to. The app-building AI services still exist, but their customers have paused their subscriptions. Here's a conversation I had recently.</p>\n\n<p>A friend had \"vibe-coded\" an Android app. A platform for building communities around common interests. Biking enthusiasts could start a biking community. Cooking fans could gather around recipes. It was a neat idea. While using the app on his phone, swiping through different pages and watching the slick animations, I felt a bit jealous. Then I asked: \"So where is the data stored?\"</p>\n\n<p>\"It's stored on the app,\" he replied.</p>\n\n<p>\"I mean, <em>all</em> the user data,\" I pressed. \"Do you use a database on AWS, or any service like that?\"</p>\n\n<p>We went back and forth while I tried to clarify my question. His vibe-knowing started to show its limits. I felt some relief, my job was safe for now. Joking aside, we talked about servers, app architecture, and even GDPR compliance. These weren't things the AI builder had prepared him for.</p>\n\n<p>This conversation happens often now when I check in on friends who vibe-coded their way into developing an app or website. They felt on top of the world when they were getting started. But then they got stuck. An error message they couldn't debug. The service generating gibberish. Requests the AI couldn't understand. How do you build the backend of an app when you don't know what a backend is? And when the tool asks you to sign up for Google Cloud and start paying monthly fees, what are you supposed to do?</p>\n\n<p>Another friend wanted to build a newsletter. Right now, ChatGPT told him to set up WordPress and learn about SMTP. These are all good things to learn, but the \"S\" in SMTP is a lie. It's not that simple. I've been trying to explain to him why the email he is sending from the command line is not reaching his gmail.</p>\n\n<p>The AI services that promise to build applications are great at making a storefront you don't want to modify. The moment you start customizing, you run into problems. That's why all Lovable websites look exactly the same. These services continue to exist. The marketing is still effective. But few people end up with a product that actually solves their problems.</p>\n\n<p>My friends spent money on these services. They were excited to see a polished brochure. The problem is, they didn't know what it takes to actually run an app.</p>\n\n<p>The AI tools are amazing at generating the visible 20% of an app. But the remaining invisible 80% is where the actual work is. The infrastructure, the security, maintenance, scaling issues, and then the actual cost. The free tier on AWS doesn't last forever. And neither does your enthusiasm when you start paying $200/month for a hobby project. </p>\n\n<p>My friends' experiments weren't failures. They learned something valuable. Some now understand why developers get paid what they do. Some even started taking programming bootcamp. But the rest have moved on. Their app sits dormant in an abandoned github repo. Their domain will probably expire this year.</p>\n\n<p>They're back to their day jobs, a little wiser about the difference between a demo and a product. Their LinkedIn profiles are quieter now, they have stopped posting about \"working smart, not hard.\"</p>\n\n<p>As for me, I should probably check on Muad'Dib. That side project isn't going to build itself. AI or no AI.</p>\n\t\t\t\n\t\t\t\t",
    "description": "Last year, all my non-programmer friends were building apps. Yet today, those apps are nowhere to be found. Everyone followed the ads. They signed up for Lovable and all the fancy app-building services that exist. My LinkedIn feed was filled with PMs who had discovered new powers. Some posted bullet-point lists of \"things to do to be successful with AI.\" \"Don't work hard, work smart,\" they said, as if it were a deep insight. I must admit, I was a bit jealous. With a full-time job, I don't get to",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Wed, 11 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-11T12:25:49.220372",
    "url_hash": "e2467b571f2994acfacc5ba140e352a0"
  },
  {
    "title": "Pluralistic: Europe takes a big step towards a post-dollar world (11 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/11/post-dollar-world/",
    "content": "<p><!--\nTags:\npayment processing, dollar clearing, eu, post-american world, weaponized dollars, forex, Christine Lagarde, digital euro, cbdc, european payments initiative, epi, europa, visa, mastercard, henry farrell, abraham newman, underground empire, wero, payment sovereignty, digital sovereignty, monnet, ecb, finance\n\nSummary:\nEurope takes a big step towards a post-dollar world; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/11/post-dollar-world/\n\nTitle:\nPluralistic: Europe takes a big step towards a post-dollar world (11 Feb 2026) post-dollar-world\n\nBullet:\n&#x1f686;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/11Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#de-dollarization\">Europe takes a big step towards a post-dollar world</a>: Recapturing $24t worth of transactions from Visa/Mastercard.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#retro\">Object permanence</a>: API for Congress; Steampunk fetish mask; Hillary x AOL login screen; Suffragist Valentines; Musk x Intuit vs the American people.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12407\"></span></p>\n<hr/>\n<p><a name=\"de-dollarization\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"An old-fashioned credit-card imprinter; its handle is a cracked and dirty American flag. Under the slip is a gold Trump Card. Looming over the imprinter is the top half of Trump's face, brooding and squint-eyed; it has been altered to increase its orangeness, to add bloodshot sclera to his eyes, and to add liver spots. At its bottom, the face merges with a bubbling, hellish cauldron of smoke and flame.\" src=\"https://i0.wp.com/craphound.com/images/euro-payments.jpg?w=840&#038;ssl=1\"/></p>\n<h1>Europe takes a big step towards a post-dollar world (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#de-dollarization\">permalink</a>)</h1>\n<p>There's a reason every decentralized system eventually finds its way onto a platform: platforms solve real-world problems that platform users struggle to solve for themselves.</p>\n<p>I've written before about the indie/outsider author Crad Kilodney, who wrote, edited, typeset and published chapbooks of his weird and wonderful fiction, and then sold his books from Toronto street-corners with a sign around his neck reading VERY FAMOUS CANADIAN AUTHOR BUY MY BOOKS (or, if he was feeling spicy, simply: MARGARET ATWOOD):</p>\n<p><a href=\"https://pluralistic.net/2024/02/19/crad-kilodney-was-an-outlier/#intermediation\">https://pluralistic.net/2024/02/19/crad-kilodney-was-an-outlier/#intermediation</a></p>\n<p>Crad was a hell of a writer and a bit of a force of nature, but there are plenty of writers I want to hear from who are never going to publish their own books, much less stand on a street-corner selling them with a MARGARET ATWOOD sign around their necks. Publishers, editors, distributors and booksellers all do important work, allowing writers to get on with their writing, taking all the other parts of the publishing process off their shoulders.</p>\n<p>That's the value of platforms. The <em>danger</em> of platforms is when they grow so powerful that they usurp the relationship between the parties they are supposed to be facilitating, locking them in and then extracting value from them (someone should coin a word to describe this process!):</p>\n<p><a href=\"https://pluralistic.net/2024/11/07/usurpers-helpmeets/#disreintermediation\">https://pluralistic.net/2024/11/07/usurpers-helpmeets/#disreintermediation</a></p>\n<p>Everyone needs platforms: writers, social media users, people looking for a romantic partner. What's more, the <em>world</em> needs platforms. Say you want to connect all 200+ countries on Earth with high-speed fiber lines; you can run a cable from each country to every other country (about 21,000 cables, many of them expensively draped across the ocean floor), or you can pick one country (preferably one with both Atlantic and Pacific coasts) and run all your cables there, and then interconnect them.</p>\n<p>That's America, the world's global fiber hub. The problem is, America isn't just a platform for fiber interconnections &#8211; it's a Great Power that uses its position at the center of the world's fiber networks to surveil and disrupt the world's communications networks:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Edward_Snowden\">https://en.wikipedia.org/wiki/Edward_Snowden</a></p>\n<p>That's a classic enshittification move on a geopolitical scale. It's not the only one America's made, either.</p>\n<p>Consider the US dollar. The dollar is to global commerce what America's fiber head-ends are to the world's data network: a site of essential, (nominally) neutral interchange that is actually a weapon that the US uses to gain advantage over its allies and to punish its enemies:</p>\n<p><a href=\"https://pluralistic.net/2023/10/10/weaponized-interdependence/#the-other-swifties\">https://pluralistic.net/2023/10/10/weaponized-interdependence/#the-other-swifties</a></p>\n<p>The world's also got about 200 currencies. For parties in one country to trade with those in another country, the buyer needs to possess a currency the seller can readily spend. The problem is that setting up 21,000 pairwise exchange markets from every currency to every other currency is expensive and cumbersome &#8211; traders would have to amass reserves of hundreds of rarely used currencies, or they would have to construct long, brittle, expensive, high-risk chains that convert, say, Thai baht into Icelandic kroner to Brazilian reals and finally into Costa Rican colones.</p>\n<p>Thanks to a bunch of complicated maneuvers following World War II, the world settled on the US dollar as its currency platform. Most important international transactions use \"dollar clearing\" (where goods are priced in USD irrespective of their country of origin) and buyers need only find someone who will convert their currency to dollars in order to buy food, oil, and other essentials.</p>\n<p>There are two problems with this system. The first is that America has never treated the dollar as a neutral platform; rather, American leaders have found subtle, deniable ways to use \"dollar dominance\" to further America's geopolitical agenda, at the expense of other dollar users (you know, \"enshittification\"). The other problem is that America has become steadily <em>less</em> deniable and subtle in these machinations, finding all kinds of \"exceptional circumstances\" to use the dollar against dollar users:</p>\n<p><a href=\"https://pluralistic.net/2025/11/26/difficult-multipolarism/#eurostack\">https://pluralistic.net/2025/11/26/difficult-multipolarism/#eurostack</a></p>\n<p>America's unabashed dollar weaponization has been getting worse for years, but under Trump, the weaponized dollar has come to constitute an existential risk to the rest of the world, sending them scrambling for alternatives. As November Kelly says, Trump inherited a poker game that was rigged in his favor, but he still flipped over the table because he resents having to pretend to play at all:</p>\n<p><a href=\"https://pluralistic.net/2026/01/26/i-dont-want/#your-greenback-dollar\">https://pluralistic.net/2026/01/26/i-dont-want/#your-greenback-dollar</a></p>\n<p>Once Trump tried to steal Greenland, it became apparent that the downsides of the dollar far outweigh its upsides. Last month, Christine Lagarde (president of the European Central Bank) made a public announcement on a radio show that Europe \"urgently\" needed to build its own payment system to avoid the American payment duopoly, Visa/Mastercard:</p>\n<p><a href=\"https://davekeating.substack.com/p/can-europe-free-itself-from-visamastercard\">https://davekeating.substack.com/p/can-europe-free-itself-from-visamastercard</a></p>\n<p>Now, there's plenty of reasons to want to avoid Visa/Mastercard, starting with cost: the companies have raised their prices by more than 40% since the pandemic started (needless to say, updating database entries has not gotten 40% more expensive since 2020). This allows two American companies to impose a tax on the entire global economy, collecting swipe fees and other commissions on $24t worth of the world's transactions every year:</p>\n<p><a href=\"https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html\">https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html</a></p>\n<p>But there's another reason to get shut of Visa/Mastercard: Trump controls them. He can order them to cut off payment processing for any individual or institution that displeases him. He's already done this to punish the International Criminal Court for issuing a genocide arrest warrant for Benjamin Netanyahu, and against a Brazilian judge for finding against the criminal dictator Jair Bolsonaro (Trump also threatened to have the judge in Bolsonaro's case assassinated). What's more, Visa/Mastercard have a record of billions (trillions?) of retail transactions taking place between non-Americans, which Trump's officials can access for surveillance purposes, or just to conduct commercial espionage to benefit American firms as a loyalty bonus for the companies that buy the most $TRUMP coins.</p>\n<p>Two days after Lagarde's radio announcement, 13 European countries announced the formation of \"EuroPA,\" an alliance that will facilitate regionwide transactions that bypass American payment processors (as well as Chinese processors like Alipay):</p>\n<p><a href=\"https://news.europawire.eu/european-payment-leaders-sign-mou-to-create-a-sovereign-pan-european-interoperable-payments-network/eu-press-release/2026/02/02/15/34/11/168858/\">https://news.europawire.eu/european-payment-leaders-sign-mou-to-create-a-sovereign-pan-european-interoperable-payments-network/eu-press-release/2026/02/02/15/34/11/168858/</a></p>\n<p>As <em>European Business Magazine</em> points out, EuroPA is the latest in a succession of attempts to build a European payments network:</p>\n<p><a href=\"https://europeanbusinessmagazine.com/business/europes-24-trillion-breakup-with-visa-and-mastercard-has-begun/\">https://europeanbusinessmagazine.com/business/europes-24-trillion-breakup-with-visa-and-mastercard-has-begun/</a></p>\n<p>There's Wero, a 2024 launch from the 16-country European Payments Initiative, which currently boasts 47m users and 1,100 banks in Belgium, France and Germany, who've spent €7.5b through the network:</p>\n<p><a href=\"https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html\">https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html</a></p>\n<p>Wero launched as a peer-to-peer payment system that used phone numbers as identifiers, but it expanded into retail at the end of last year, with several large retailers (such as Lidl) signing on to accept Wero payments.</p>\n<p>Last week, Wero announced an alliance with EuroPA, making another 130m people eligible to use the service, which now covers 72% of the EU and Norway. They're rolling out international peer-to-peer payments in 2026, and retail/ecommerce payments in 2027.</p>\n<p>These successes are all the more notable for the failures they follow, like Monnet (born 2008, died 2012). Even the EPI has been limping along since its founding, only finding a new vigor on the heels of Trump threatening EU member states with military force if he wasn't given Greenland.</p>\n<p>As <em>EBM</em> writes, earlier efforts to build a regional payment processor foundered due to infighting among national payment processors within the EU, who jealously guarded their own turf and compulsively ratfucked one another. This left Visa/Mastercard as the best (and often sole) means of conducting cross-border commerce. This produced a \"network effect\" for Visa/Mastercard: since so many Europeans had an American credit card in their wallets, European merchants had to support them; and since so many EU merchants supported Visa/Mastercard, Europeans had to carry them in their wallets.</p>\n<p>Network effects are pernicious, but not insurmountable. The EU is attacking this problem from multiple angles &#8211; not just through EuroPA, but also through the creation of the Digital Euro, a Central Bank Digital Currency (CBDC). Essentially, this would give any European who signs up an account with the ECB, the federal bank of the Eurozone. Then, using an app or a website, any two Digital Euro customers could transfer funds to one another using the bank's own ledgers, instantaneously and at zero cost.</p>\n<p><em>EBM</em> points out that there's a critical difficulty in getting EuroPA off the ground: because it is designed to be cheap to use, it doesn't offer participating banks the windfall profits that Visa/Mastercard enjoy, which might hold back investment in EuroPA infrastructure.</p>\n<p>But banks are used to making small amounts of money from a <em>lot</em> of people, and with the Digital Euro offering a \"public option,\" the private sector EuroPA system will have a competitor that pushes it to continuously improve its systems.</p>\n<p>It's true that European payment processing has been slow and halting until now, but that was when European businesses, governments and households could still pretend that the dollar &#8211; and the payment processing companies that come along with it &#8211; was a neutral platform, and not a geopolitical adversary.</p>\n<p>If there's one thing the EU has demonstrated over the past three years, it's that geopolitical threats from massive, heavily armed mad empires can break longstanding deadlocks. Remember: Putin's invasion of Ukraine and the end of Russian gas moved the EU's climate goals in ways that beggar belief: the region went from 15 years behind on its solar rollout to ten years <em>ahead</em> of schedule in just a handful of months:</p>\n<p><a href=\"https://pluralistic.net/2026/02/05/contingency/#this-too-shall-pass\">https://pluralistic.net/2026/02/05/contingency/#this-too-shall-pass</a></p>\n<p>This despite an all-out blitz from the fossil fuel lobby, one of the most powerful bodies in the history of civilization.</p>\n<p>Crises precipitate change, and Trump precipitates crises.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Killing in the name of… nothing <a href=\"https://www.theverge.com/policy/849609/charlie-kirk-shooting-ideology-literacy-politics\">https://www.theverge.com/policy/849609/charlie-kirk-shooting-ideology-literacy-politics</a></p>\n</li>\n<li>\n<p>Best gas masks <a href=\"https://www.theverge.com/policy/868571/best-gas-masks\">https://www.theverge.com/policy/868571/best-gas-masks</a></p>\n</li>\n<li>\n<p>As Was The Style At The Time: How We Became Cruel <a href=\"https://www.oblomovka.com/wp/2026/02/09/as-was-the-style-at-the-time-how-we-became-cruel/\">https://www.oblomovka.com/wp/2026/02/09/as-was-the-style-at-the-time-how-we-became-cruel/</a></p>\n</li>\n<li>\n<p>Remove Your Ring Camera With a Claw Hammer <a href=\"https://www.hamiltonnolan.com/p/remove-your-ring-camera-with-a-claw\">https://www.hamiltonnolan.com/p/remove-your-ring-camera-with-a-claw</a></p>\n</li>\n<li>\n<p>The truth about covering tech at Bezos’s Washington Post <a href=\"https://geoffreyfowler.substack.com/p/washington-post-layoffs-bezos-tech-reporting\">https://geoffreyfowler.substack.com/p/washington-post-layoffs-bezos-tech-reporting</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#retro\">permalink</a>)</h1>\n<p>#15yrsago Realtime API for Congress <a href=\"https://web.archive.org/web/20110211101723/http://sunlightlabs.com/blog/2011/the-real-time-congress-api/\">https://web.archive.org/web/20110211101723/http://sunlightlabs.com/blog/2011/the-real-time-congress-api/</a></p>\n<p>#15yrsago Steampunk fetish mask with ear-horn <a href=\"https://bob-basset.livejournal.com/156159.html\">https://bob-basset.livejournal.com/156159.html</a></p>\n<p>#10yrsago Facebook’s “Free Basics” and colonialism: an argument in six devastating points <a href=\"https://web.archive.org/web/20160211182436/https://www.theatlantic.com/technology/archive/2016/02/facebook-and-the-new-colonialism/462393/\">https://web.archive.org/web/20160211182436/https://www.theatlantic.com/technology/archive/2016/02/facebook-and-the-new-colonialism/462393/</a></p>\n<p>#10yrsago UK surveillance bill condemned by a Parliamentary committee, for the third time <a href=\"https://web.archive.org/web/20250523013320/https://www.wired.com/story/technology-ip-bill-surveillance-committee/\">https://web.archive.org/web/20250523013320/https://www.wired.com/story/technology-ip-bill-surveillance-committee/</a></p>\n<p>#10yrsago Haunted by a lack of young voter support, Hillary advertises on the AOL login screen <a href=\"https://web.archive.org/web/20160211080839/http://www.weeklystandard.com/hillary-reaches-base-with-aol-login-page-ad/article/2001023\">https://web.archive.org/web/20160211080839/http://www.weeklystandard.com/hillary-reaches-base-with-aol-login-page-ad/article/2001023</a></p>\n<p>#10yrsago Celebrate V-Day like an early feminist with these Suffragist Valentines <a href=\"https://web.archive.org/web/20160216100606/https://www.lwv.org/blog/votes-women-vintage-womens-suffrage-valentines\">https://web.archive.org/web/20160216100606/https://www.lwv.org/blog/votes-women-vintage-womens-suffrage-valentines</a></p>\n<p>#10yrsago Elements of telegraphic style, 1928 <a href=\"https://writeanessayfor.me/telegraph-office-com\">https://writeanessayfor.me/telegraph-office-com</a></p>\n<p>#10yrsago Disgraced ex-sheriff of LA admits he lied to FBI, will face no more than 6 months in prison <a href=\"https://web.archive.org/web/20160211041117/https://www.latimes.com/local/lanow/la-me-ln-ex-l-a-county-sheriff-baca-jail-scandal-20160210-story.html\">https://web.archive.org/web/20160211041117/https://www.latimes.com/local/lanow/la-me-ln-ex-l-a-county-sheriff-baca-jail-scandal-20160210-story.html</a></p>\n<p>#5yrsago Apple puts North Dakota on blast <a href=\"https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#manorial-apple\">https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#manorial-apple</a></p>\n<p>#5yrsago Catalytic converter theft <a href=\"https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#ccscrap\">https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#ccscrap</a></p>\n<p>#5yrsago Adam Curtis on criti-hype <a href=\"https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#hypernormal\">https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#hypernormal</a></p>\n<p>#5yrsago Dependency Confusion <a href=\"https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#extra-index-url\">https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#extra-index-url</a></p>\n<p>#1yrago Musk steals a billion dollars from low-income Americans and sends it to Intuit <a href=\"https://pluralistic.net/2025/02/11/doubling-up-on-paperwork/#rip-freefile\">https://pluralistic.net/2025/02/11/doubling-up-on-paperwork/#rip-freefile</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18<br />\n<a href=\"https://tanner.utah.edu/center-events/cory-doctorow/\">https://tanner.utah.edu/center-events/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#recent\">permalink</a>)</h1>\n<ul>\n<li>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025</p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1027 words today, 26735 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links Europe takes a big step towards a post-dollar world: Recapturing $24t worth of transactions from Visa/Mastercard. Hey look at this: Delights to delectate. Object permanence: API for Congress; Steampunk fetish mask; Hillary x AOL login screen; Suffragist Valentines; Musk x Intuit vs the American people. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' ",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Wed, 11 Feb 2026 10:09:05 +0000",
    "fetched_at": "2026-02-11T12:25:50.830480",
    "url_hash": "4580ea9ccb274ead82a7cfc472496a5e"
  },
  {
    "title": "Communities are not fungible",
    "link": "https://www.joanwestenberg.com/communities-are-not-fungible/",
    "content": "<img src=\"https://www.joanwestenberg.com/content/images/2026/02/Gemini_Generated_Image_ml841fml841fml84.jpeg\" alt=\"Communities are not fungible\"><p>There&apos;s a default assumption baked into how Silicon Valley builds products, and it tracks against how urban planners redesign neighbourhoods: that communities are interchangeable, and if you &quot;lose&quot; one, you can manufacture a replacement; that the value of a group of people who share space and history can be captured in a metric and deployed at scale.</p><p>Economists have a word for assets that can be swapped one-for-one without loss of value: fungible. A dollar is fungible. A barrel of West Texas Intermediate crude is fungible. </p><p>...A mass of people bound together by years of shared context, inside jokes and collective memory is not.</p><p>And yet we keep treating communities as though they are.</p><p>When a platform migrates its user base to a new architecture, the implicit promise is that the community will survive the move. When a city demolishes a public housing block and offers residents vouchers for market-rate apartments across town, the implicit promise is that they&apos;ll rebuild what they had.</p><p>These promises are always broken, and the people making them either don&apos;t understand why, or they&apos;re relying on the rest of us being too blind to see it.</p><h2 id=\"what-robert-moses-got-wrong\">What Robert Moses got wrong...</h2><p>Robert Moses displaced an estimated 250,000 people over the course of his career, razing entire neighbourhoods to make way for expressways and public works projects. The defence of Moses, then and now, is utilitarian: more people benefited from the infrastructure than were harmed by its construction. The calculus assumed that the displaced residents could form equivalent communities elsewhere, and the relationships severed by a highway cutting through a block were replaceable with relationships formed in a new location. Jane Jacobs spent much of her career arguing that this was catastrophically wrong. The old neighbourhood was not a collection of individuals who happened to live near each other; it was a living organism with its own immune system and its own way of metabolising change. When Moses bulldozed it, he killed a community and scattered the remains.</p><p>Jacobs understood that the value of a community isn&apos;t in the people as discrete units. The value is in the specific, unreproducible web of relationships between them. You can move every single resident of a street to the same new street in the same new suburb and you will not get the same community, because community is a function of time and ten thousand microtransactions of reciprocity that nobody tracks and nobody can mandate.</p><h2 id=\"and-what-economists-miss\">...and what economists miss</h2><p>In a model, agents are interchangeable. Consumer A and Consumer B have different preference curves, yes, but they respond to the same incentive structures in predictable ways. Community is what you get when agents stop being interchangeable to each other. When Alice doesn&apos;t need &quot;a neighbour&quot; but needs <em>that</em> neighbour, the one who watched her kids that time, the one who knows she&apos;s allergic to peanuts. The relationship is specific, and specificity is the enemy of fungibility.</p><p>This is why so many attempts to &quot;build community&quot; from scratch end up producing something that looks like community but functions like a mailing list. The startup that launches a Discord server and calls it a community // the coworking space that holds a monthly mixer and calls it a community etc. What they&apos;ve actually built is a directory of loosely affiliated strangers who share a single contextual overlap.</p><p>That&apos;s a starting condition for community, but it&apos;s not community itself, and the difference is like the difference between a pile of lumber and a house. The raw materials are necessary but wildly insufficient.</p><h2 id=\"when-platforms-die-communities-dont-migrate\">When platforms die, communities don&apos;t migrate</h2><p>The internet has run this experiment dozens of times now, and the results are consistent. When a platform dies or degrades, its community does not simply migrate to the next platform, it fragments, and the ones who do arrive at the new place find that the social dynamics are different, the norms have shifted, and a substantial number of the people who made the old place feel like home are gone. LiveJournal&apos;s Russian acquisition scattered its English-speaking community across Dreamwidth and eventually Twitter. Each successor captured a fraction of the original user base and none of them captured the culture. The community that existed on LiveJournal in 2006 is extinct and cannot be reassembled. The specific conditions that created it, a particular moment in internet history when blogging was new and social media hadn&apos;t yet been colonised by algorithmic feeds and engagement optimisation, no longer exist.</p><p>You can see the pattern in Vine&apos;s death and the migration to Snapchat x TikTok, with Twitter&apos;s degradation and the scattering to Threads, Bluesky and Mastodon. In every case, the platform&apos;s architects // successors assumed that the product was the platform and the community was an emergent feature that would re-emerge given similar conditions. They had the relationship exactly backwards. The community was the product and the platform was the container, and when the container breaks, the product spills and evaporates, and some of it is lost forever.</p><h2 id=\"dunbars-layers-the-archaeology-of-trust\">Dunbar&apos;s layers + the archaeology of trust</h2><p>Robin Dunbar&apos;s research on social group sizes tells us that humans maintain relationships in rough layers: about five intimate relationships, fifteen close ones, fifty good friends, and a hundred and fifty meaningful acquaintances. These aren&apos;t arbitrary numbers; they mirror cognitive and emotional bandwidth constraints that are probably neurological in origin. What Dunbar&apos;s model implies about community is underappreciated. If a community is a network of overlapping Dunbar layers, then each member&apos;s experience of the community is unique, shaped by where they sit in the web. There is no &quot;the community&quot; in any objective sense. There are as many communities as there are members, each one a different cross-section of the same social graph, and this means that when you lose members, you lose entire subjective communites that existed literally nowhere else.</p><p>When a Roman town was abandoned, the physical structures decayed at different rates. Stone walls lasted centuries while textiles vanished in years. The social structure of a community decays the same way when it&apos;s disrupted. The institutional relationships, the stone walls, might survive: people will still know each other&apos;s names and professional roles. The close friendships might last a while, held together by active effort. But the ambient trust, the willingness to lend a tool without being asked or to tolerate a minor annoyance because you&apos;ve built up enough goodwill to absorb it, that&apos;s the textile, and it goes first. Once it&apos;s gone, what&apos;s left = a skeleton that looks like a community but has lost the capacity to function like one.</p><h2 id=\"why-build-a-new-one-doesnt-work\">Why &quot;build a new one&quot; doesn&apos;t work</h2><p>There&apos;s a fantasy popular among technologists and policymakers that community can be engineered. That if you identify the right variables and apply the right interventions, you can produce community on demand. This fantasy has a name in the urbanist literature: it&apos;s called &quot;new town syndrome,&quot; after the observation that Britain&apos;s postwar new towns, carefully designed with all the amenities a community could need, produced widespread anomie and social isolation in their early decades. Stevenage had shops, schools, parks and pubs. What it didn&apos;t have was history. The residents had no shared past and no slowly accumulated social capital. They had proximity without context, and proximity without context is a crowd.</p><p>The same problem pops up in every domain where someone tries to instantiate community from a blueprint. Corporate culture initiatives and neighbourhood revitalisation programs tend to optimise for the visible markers of community, events and shared spaces, while ignoring the invisible substrate that makes those markers meaningful. It&apos;s like building an elaborate birdhouse and assuming birds will come, and when they don&apos;t, the birdhouse builders typically conclude that they need a better birdhouse, rather than questioning wether birdhouses are how you get birds.</p><h2 id=\"you-cant-rerun-the-history\">You can&apos;t rerun the history</h2><p>The destruction of a community is largely irreversible. You can rebuild a building and you can replant a forest and, given enough decades, get something that resembles the original ecosystem. But a community that took twenty years to develop its particular structure of norms and mutual knowledge cannot be regrown in twenty years, because the conditions that shaped it no longer exist. The people are older, the context has changed, and the specific convergance of circumstances that brought those particular individuals together in that particular configuration at that particular time is gone. Communities are path-dependent in the strongest possible sense: their current state is a function of their entire history, and you can&apos;t rerun the history.</p><p>Ursula K. Le Guin wrote in <em>The Dispossessed</em> about the tension between a society that valued radical freedom and the structures that emerged organically to make collective life possible. Her protagonist, Shevek, discovers that even in a society designed to prevent the accumulation of power, informal hierarchies and social obligations develop on their own, shaped by nothing more than time and proximity. Le Guin understood that community structure isn&apos;t designed, it&apos;s deposited, like sediment, by the slow accumulation of interactions that nobody planned and nobody controls.</p><h2 id=\"so-what-do-we-actually-owe-existing-communities\">So what do we actually owe existing communities?</h2><p>If communities are non-fungible, if they can&apos;t be replaced once destroyed, then every decision that disrupts an existing community carries a cost that is systematically undervalued. The cost doesn&apos;t show up in a spreadsheet because it&apos;s not a line item, it&apos;s the loss of a particular, specific, irreproducible social configuration that provided its members with things that can&apos;t be purchased on the open market: ambient trust and the comfort of being known.</p><p>Displacement - whether physical or digital - is more expensive than anyone budgets for. The burden of proof should fall on the displacer, not the displaced, to demonstrate that the benefits of disruption outweigh the destruction of social capital that took years or decades to accumulate. And the glib promise of &quot;we&apos;ll build something even better&quot; should be treated with the same scepticism as a contractor who promises to replace your load-bearing wall with something decorative. It is, to be frank, bullshit. </p><p>Communities are not resources to be optimised and they&apos;re not user bases to be migrated. They&apos;re the accumulated residue of people choosing, over and over again, to remain in a relationship with each other under specific conditions that will never, ever recur in exactly the same way. </p><p>Treating them as fungible is idiotic, and we have been far too willing to let it happen unchallenged.</p>",
    "description": "There&apos;s a default assumption baked into how Silicon Valley builds products, and it tracks against how urban planners redesign neighbourhoods: that communities are interchangeable, and if you &quot;lose&quot; one, you can manufacture a replacement; that the value of a group of people who share space and",
    "is_fulltext": true,
    "source": "Westenberg.",
    "pub_date": "Wed, 11 Feb 2026 04:18:45 GMT",
    "fetched_at": "2026-02-11T12:26:13.417170",
    "url_hash": "3ca93ad32f055faad7e3387b8af466d2"
  },
  {
    "title": "Package Management Consulting",
    "link": "https://nesbitt.io/2026/02/11/package-management-consulting.html",
    "content": "<p>I’m now taking on consulting work. If you’re building or running a package manager, registry, or dependency tooling, I can probably help.</p>\n\n<p>Over fifteen years I’ve built <a href=\"https://libraries.io\">Libraries.io</a>, <a href=\"https://ecosyste.ms\">Ecosyste.ms</a>, <a href=\"https://github.com/andrew/git-pkgs\">git-pkgs</a>, the <a href=\"https://manifest.fm\">Manifest podcast</a>, co-organised the <a href=\"https://fosdem.org/2025/schedule/track/package-management/\">Package Management devroom at FOSDEM</a>, and contributed to <a href=\"https://brew.sh\">Homebrew</a>. I’ve written integrations for dozens of package managers, tracked billions of dependency relationships, and watched the same design mistakes repeat across ecosystems for a decade. That pattern recognition is what I bring to consulting engagements.</p>\n\n<h2 id=\"what-i-can-help-with\">What I can help with</h2>\n\n<p><strong>Package manager design &amp; architecture.</strong> If you’re building a package manager, registry, or dependency resolver, or trying to fix one, I can help you avoid the mistakes that RubyGems, npm, and PyPI learned the hard way. I’ve documented the design patterns, tradeoffs, and failure modes across dozens of ecosystems in my <a href=\"/package-managers/\">cross-ecosystem package manager documentation</a>. Namespace design, version constraint semantics, lockfile formats, registry APIs, lifecycle hooks, trust models.</p>\n\n<p><strong>Software supply chain security.</strong> I’ve found and catalogued dependency confusion attacks, typosquatting campaigns, <a href=\"https://en.wikipedia.org/wiki/Slopsquatting\">slopsquatting</a> (a term I popularized), malicious maintainer takeovers, and protestware incidents across every major ecosystem. Trusted publishing, SBOM generation and enrichment, vulnerability scanning strategy. I know what actually works and what’s security theatre.</p>\n\n<p><strong>Package management governance.</strong> Registries aren’t just technical systems. They make political choices about naming, ownership, deletion, and dispute resolution. I contribute to <a href=\"https://openssf.org/community/alpha-omega/\">Alpha-Omega</a>, <a href=\"https://openssf.org/\">OpenSSF</a>, <a href=\"https://cyclonedx.org/\">CycloneDX</a>, and <a href=\"https://chaoss.community/\">CHAOSS</a> working groups. Whether you’re a registry operator designing policies, a foundation setting ecosystem standards, or a company navigating the governance landscape of your dependencies, I can help.</p>\n\n<p><strong>Open source ecosystem intelligence.</strong> Ecosyste.ms tracks 13+ million packages across 50+ registries, 290 million repositories, and 24 billion dependencies, the largest public dependency graph available. I can help you understand your dependency landscape, identify critical infrastructure in your supply chain, or build tooling on top of this data.</p>\n\n<p><strong>Internal dependency strategy.</strong> For enterprise teams: audit your dependency practices, evaluate package manager choices, design internal registry architecture, set procurement policies, or build a supply chain security programme from scratch.</p>\n\n<p><strong>Open source strategy.</strong> I’ve <a href=\"https://github.com/andrew\">built and maintained</a> open source for over fifteen years: <a href=\"https://octobox.io\">octobox</a>, <a href=\"https://github.com/sass/node-sass\">node-sass</a>, <a href=\"https://24pullrequests.com\">24 Pull Requests</a>, <a href=\"https://github.com/splitrb/split\">Split</a>, and contributions to <a href=\"https://brew.sh\">Homebrew</a>. I’ve designed web applications that scale to millions of users. If you’re launching projects, building contributor communities, or making sustainability decisions, I’ve seen what works and what doesn’t.</p>\n\n<p><strong>Research &amp; analysis.</strong> Guest lectures, technical reports, ecosystem comparisons, landscape surveys. I’ve presented at <a href=\"https://fosdem.org\">FOSDEM</a> and <a href=\"https://ssl.engineering.nyu.edu/\">NYU Secure Systems Lab</a>, spoken at the <a href=\"https://nesbitt.io/posts/\">Software Mentions in OpenAlex workshop</a>, and contributed to research with <a href=\"https://www.softwareheritage.org/\">Software Heritage</a>, <a href=\"https://chaoss.community/\">CHAOSS</a>, and <a href=\"https://openssf.org/\">OpenSSF</a>.</p>\n\n<h2 id=\"how-it-works\">How it works</h2>\n\n<p>Typically an initial call to understand what you’re dealing with, then either a short engagement (a few days of focused work) or ongoing advisory. I’m flexible on structure.</p>\n\n<p>I’m based in the UK and work remotely. I’ve worked at <a href=\"https://github.com\">GitHub</a> and <a href=\"https://tidelift.com\">Tidelift</a>. Past clients include package registry operators, open source foundations (CHAOSS, OpenSSF), enterprise platform teams, and academic research groups (NYU, Software Heritage).</p>\n\n<p>Get in touch at <a href=\"mailto:andrew@nesbitt.io\">andrew@nesbitt.io</a> or on <a href=\"https://mastodon.social/@andrewnez\">Mastodon</a>. More detail on my <a href=\"/consulting/\">consulting page</a>.</p>",
    "description": "I'm now available for consulting on package management, software supply chain security, and open source infrastructure.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-11T10:00:00+00:00",
    "fetched_at": "2026-02-11T12:26:14.772976",
    "url_hash": "4da5f4ce52f87ceac13071ad7be475b3"
  }
]