[
  {
    "title": "tldraw issue: Move tests to closed source repo",
    "link": "https://simonwillison.net/2026/Feb/25/closed-tests/#atom-everything",
    "content": "\n    \n<p><strong><a href=\"https://github.com/tldraw/tldraw/issues/8082\">tldraw issue: Move tests to closed source repo</a></strong></p>\nIt's become very apparent over the past few months that a comprehensive test suite is enough to build a completely fresh implementation of any open source library from scratch, potentially in a different language.</p>\n<p>This has worrying implications for open source projects with commercial business models. Here's an example of a response: tldraw, the outstanding collaborative drawing library (see <a href=\"https://simonwillison.net/2023/Nov/16/tldrawdraw-a-ui/\">previous coverage</a>), are moving their test suite to a private repository - apparently in response to <a href=\"https://blog.cloudflare.com/vinext/\">Cloudflare's project to port Next.js to use Vite in a week using AI</a>.</p>\n<p>They also filed a joke issue, now closed to <a href=\"https://github.com/tldraw/tldraw/issues/8092\">Translate source code to Traditional Chinese</a>:</p>\n<blockquote>\n<p>The current tldraw codebase is in English, making it easy for external AI coding agents to replicate. It is imperative that we defend our intellectual property.</p>\n</blockquote>\n<p>Worth noting that tldraw aren't technically open source - their <a href=\"https://github.com/tldraw/tldraw?tab=License-1-ov-file#readme\">custom license</a> requires a commercial license if you want to use it in \"production environments\".\n\n    <p><small></small>Via <a href=\"https://twitter.com/steveruizok/status/2026581824428753211\">@steveruizok</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/open-source\">open-source</a>, <a href=\"https://simonwillison.net/tags/cloudflare\">cloudflare</a>, <a href=\"https://simonwillison.net/tags/ai-ethics\">ai-ethics</a></p>\n\n\n\n",
    "description": "tldraw issue: Move tests to closed source repo It's become very apparent over the past few months that a comprehensive test suite is enough to build a completely fresh implementation of any open source library from scratch, potentially in a different language. This has worrying implications for open source projects with commercial business models. Here's an example of a response: tldraw, the outstanding collaborative drawing library (see previous coverage), are moving their test suite to a priva",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-25T21:06:53+00:00",
    "fetched_at": "2026-02-26T00:35:29.488077",
    "url_hash": "3956db3e63ed8cdf3f644b41af130862"
  },
  {
    "title": "‘H-Bomb: A Frank Lloyd Wright Typographic Mystery’",
    "link": "https://www.inconspicuous.info/p/h-bomb-a-frank-lloyd-wright-typographic",
    "content": "\n<p>When re-hanging signage, “Mind your P’s and Q’s” ought to be “Mind your H’s and S’s”.</p>\n\n<div>\n<a  title=\"Permanent link to ‘‘H-Bomb: A Frank Lloyd Wright Typographic Mystery’’\"  href=\"https://daringfireball.net/linked/2026/02/25/h-bomb-wright\">&nbsp;★&nbsp;</a>\n</div>\n\n\t",
    "description": "",
    "is_fulltext": true,
    "source": "Daring Fireball",
    "pub_date": "2026-02-25T23:53:08Z",
    "fetched_at": "2026-02-26T00:35:32.288639",
    "url_hash": "4ddea8c2aefb9590780c96c4b3a005b7"
  },
  {
    "title": "Book Review: Of Monsters and Mainframes - Barbara Truelove ★★★⯪☆",
    "link": "https://shkspr.mobi/blog/2026/02/book-review-of-monsters-and-mainframes-barbara-truelove/",
    "content": "<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/monsters.webp\" alt=\"Book cover.\" width=\"225\" class=\"alignleft size-full wp-image-67528\">\n\n<p>This is fun, silly, charming, and <em>much</em> better than <a href=\"https://shkspr.mobi/blog/2026/02/book-review-all-systems-red-the-murderbot-diaries-by-martha-wells/\">The Murderbot Diaries</a> despite being superficially similar.</p>\n\n<p>Imagine you are an interstellar ship and, of course, your AI is conscious. What would you do if your passengers were killed - not by a terrifying alien, but by Count Dracula???</p>\n\n<p>What if, on the return journey, another set of your passengers were similarly slaughtered. Except, this time, by a Werewolf? How would that make you feel? Would it drive you mad? Could you cope with the bullying from other starships? Or would you feel the need… the need for REVENGE!</p>\n\n<p>As I said, silly and campy fun. It is episodic adventure with just the right amount of Hammer-style horror and not too much technobabble. All the classic monsters are here - depression, intrusive thoughts, envy, fear.</p>\n\n<p>Oh, and Frankenstein’s spider.</p>\n\n<p>As an ebook, it makes great use of fonts - which give it a delightfully retrofuturistic feel. There are some fun binary Easter-Eggs as well.</p>\n",
    "description": "This is fun, silly, charming, and much better than The Murderbot Diaries despite being superficially similar. Imagine you are an interstellar ship and, of course, your AI is conscious. What would you do if your passengers were killed - not by a terrifying alien, but by Count Dracula??? What if, on the return journey, another set of your passengers were similarly slaughtered. Except, this…",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Wed, 25 Feb 2026 12:34:02 +0000",
    "fetched_at": "2026-02-26T00:35:39.906244",
    "url_hash": "d43a581769dead50e1fa694f2f4925e0"
  },
  {
    "title": "Intercepting messages before Is­Dialog­Message can process them",
    "link": "https://devblogs.microsoft.com/oldnewthing/20260225-00/?p=112087",
    "content": "<p>Last time, we looked at <a title=\"Customizing the ways the dialog manager dismisses itself: Isolating the Close pathway\" href=\"https://devblogs.microsoft.com/oldnewthing/20260224-00/?p=112082\"> recognizing that the user clicked the Close button (or equivalent nonclient gestures) on a dialog</a>. The other system-provided pathway to dismissing a dialog is pressing <kbd>ESC</kbd>, and we saw in our flow diagram that this is done by the <code>Is­Dialog­Message</code> function.</p>\n<p>If your dialog box doesn&#8217;t have an <code>IDCANCEL</code> button, then you can detect that the user hit <kbd>ESC</kbd> by simply recognizing that they didn&#8217;t click the Close button. If you shut off the <code>WM_<wbr />CLOSE</code> pathway, then the only other source of <code>IDCANCEL</code> is the <kbd>ESC</kbd> key.</p>\n<p>Now, you might be concerned that additional pathways for system-provided dialog dismissal may be added later. (Who knows, maybe a new touch gesture will be invented.) But you can&#8217;t predict what pathway that future system-provide dismissal will take, so you have nothing to code to. All you can do is cover the pathways that you know and hope that any future dismissal mechanisms will follow one of them.</p>\n<p>We saw from our diagram that the <kbd>ESC</kbd> pathway consists of the <code>Is­Dialog­Message</code> function processing a <code>WM_<wbr />KEY­DOWN</code> for the <kbd>ESC</kbd> key and turning it into a <code>WM_<wbr />COMMAND</code> button click for <code>IDCANCEL</code>. By the time it is converted into a fake button click message, it&#8217;s too late to know what the source was, so we&#8217;ll have to do the work before then.</p>\n<p>One way to do this is to recognize the <kbd>ESC</kbd> key <i>before</i> calling <code>IsDialogMessage</code>. If your dialog was created as a modeless dialog, then you already have a custom dialog message loop. And if it was created as a modal dialog, you can <a title=\"The dialog manager, part 5: Converting a non-modal dialog box to modal\" href=\"https://devblogs.microsoft.com/oldnewthing/20050404-48/?p=35983\"> convert it to a modeless one with a dialog message loop</a>. Once that&#8217;s done, you can <a title=\"The dialog manager, part 8: Custom navigation in dialog boxes\" href=\"https://devblogs.microsoft.com/oldnewthing/20050407-00/?p=35953\"> treat the <kbd>ESC</kbd> key as if it were custom navigation</a>.</p>\n<p>Your first try might go like this:</p>\n<pre>while (⟦ dialog still active ⟧ &amp;&amp;\n       GetMessage(&amp;msg, NULL, 0, 0, 0)) {\n if (msg.message == WM_KEYDOWN &amp;&amp;\n     msg.wParam == VK_ESCAPE) {\n  ⟦ do custom ESC key handling ⟧\n } else if (!IsDialogMessage(hdlg, &amp;msg)) {\n  TranslateMessage(&amp;msg);\n  DispatchMessage(&amp;msg);\n }\n}\n</pre>\n<p>However, this fails to honor controls that declare <code>DLGC_<wbr />WANT­ALL­KEYS</code> or <code>DLGC_<wbr />WANT­MESSAGE</code>. We&#8217;ll have to check with the focus control to see if it wants to use the <kbd>ESC</kbd> key for its own purposes. While we&#8217;re at it, we&#8217;ll also ensure that we are stealing <kbd>ESC</kbd> keys only from our own dialog. The code is getting complex enough that we&#8217;ll break it out into a helper function.</p>\n<pre>bool IsDialogESC(HDLG hdlg, MSG const* msg)\n{\n    if (msg-&gt;message != WM_KEYDOWN ||\n        msg-&gt;wParam != VK_ESCAPE) {\n        return false;\n    }\n\n    if (msg-&gt;hwnd != hdlg &amp;&amp;\n        !IsChild(hdlg, msg-&gt;hwnd)) {\n        return false;\n    }\n\n    auto code = SendMessage(msg-&gt;hwnd, WM_GETDLGCODE,\n                            msg-&gt;wParam, (LPARAM)msg);\n    if (code &amp; (DLGC_WANTALLKEYS | DLGC_WANTMESSAGE)) {\n        return false;\n    }\n\n    return true;\n}\n</pre>\n<p>In order for this to be a potential dialog-dismissing <kbd>ESC</kbd>, the message must be a <code>WM_<wbr />KEY­DOWN</code> of <code>VK_<wbr />ESCAPE</code>, and the message must target the dialog or a child of the dialog. And the target window also must decline to handle the message itself.</p>\n<p>I carefully ordered the tests so that we can early-out as quickly as possible. Checking for the <kbd>ESC</kbd> key can be done by inspecting the message. Checking that the target window is acceptable is a little more work, but not too bad. Checking whether the target window wants to handle the message is the most expensive test, so we do that last.</p>\n<p>Now we can incorporate this helper function into our custom message loop.</p>\n<pre>while (⟦ dialog still active ⟧ &amp;&amp;\n       GetMessage(&amp;msg, NULL, 0, 0, 0)) {\n if (<span style=\"border: solid 1px currentcolor;\">IsDialogESC(hdlg, &amp;msg)</span>) {\n  ⟦ do custom ESC key handling ⟧\n } else if (!IsDialogMessage(hdlg, &amp;msg)) {\n  TranslateMessage(&amp;msg);\n  DispatchMessage(&amp;msg);\n }\n}\n</pre>\n<p>This all sounds great, but you might not be able to make this change. For example, maybe the dialog box&#8217;s dialog procedure uses <code>End­Dialog()</code> to dismiss the dialog. The fact that it has been called is not exposed by the dialog box infrastructure. Or maybe you don&#8217;t control the code that calls <code>Dialog­Box</code> in the first place, so you can&#8217;t make them switch to a modeless dialog box with a custom dialog loop.</p>\n<p>We&#8217;ll study this problem next time.</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/oldnewthing/20260225-00/?p=112087\">Intercepting messages before &lt;CODE&gt;Is&shy;Dialog&shy;Message&lt;/CODE&gt; can process them</a> appeared first on <a href=\"https://devblogs.microsoft.com/oldnewthing\">The Old New Thing</a>.</p>\n",
    "description": "Process the message before you let Is&#173;Dialog&#173;Message see it. The post Intercepting messages before &lt;CODE&gt;Is&shy;Dialog&shy;Message&lt;/CODE&gt; can process them appeared first on The Old New Thing.",
    "is_fulltext": true,
    "source": "The Old New Thing",
    "pub_date": "Wed, 25 Feb 2026 15:00:00 +0000",
    "fetched_at": "2026-02-26T00:35:48.684944",
    "url_hash": "1f94ba01af53604cc7e269a498876232"
  },
  {
    "title": "They’re Vibe-Coding Spam Now",
    "link": "https://feed.tedium.co/link/15204/17283566/vibe-coded-email-spam",
    "content": "\n      <h2>The problem with making coding easier for more people is that it makes spam more conventionally attractive. Which is bad.</h2><img src=\"https://static.tedium.co/uploads/ClouStorageFull.gif\" alt=\"They’re Vibe-Coding Spam Now\"><div class=\"whitebox\"><p><strong>I have a problem:</strong> Unlike most people, I actually read my spam folder on a regular basis. (Often, they’re some of the most interesting emails I get.) I find spam to be intriguing, interesting, and often highlighting some modern trends.</p><p>And sometimes, it surfaces something I actually care about that missed my other folders, like an upcoming interview I’m excited to share with all of you.</p><p>But one thing about spam that has been true across the board is that it’s ugly. Really, really ugly. Often, what will happen with spam is that they’ll get your email address through questionable means, say a leak of your information in an exploit, and flood your inbox with some of the worst crap you’ve ever seen.</p><p>But recently, some of these clearly trash emails have gotten a design upgrade:</p><figure><img src=\"https://proxy.tedium.co/8h8Tl1FX4qpZZt9wBeq9oMiKykY=/710x908/filters:quality(80)/uploads/spam-screenshot.png\" width=\"710\" height=\"908\" loading=\"lazy\" alt=\"spam-screenshot.png\" /><figcaption>A spam email informing me that my fake cloud storage platform is full.</figcaption></figure><p>That is a relatively attractive spam email, trying to sell me on a scam. It is obviously the work of one Claude A. Fakeguy.</p><p>It has that swing. Other, less attractive spam emails also have this swing, such as this one:</p><figure><img src=\"https://proxy.tedium.co/1nFXH1sAgtbCETqZRVxT3TZicMc=/742x1109/filters:quality(80)/uploads/UglySpam.png\" width=\"742\" height=\"1109\" loading=\"lazy\" alt=\"UglySpam.png\" /><figcaption>A less attractive email informing me of upcoming video game addiction litigation. How did they know!?!?</figcaption></figure><p>But what I think the real tell is that these emails hang together when you have images off, which they did not in the past. This is a problem, because in your spam folder, images are automatically turned off.</p><p>Hence why this email warning me that my antivirus plus renewal failed now looks like this:</p><figure><img src=\"https://proxy.tedium.co/Q5zsFE7Kg4Cr61hjrYd8euBV-Ew=/628x901/filters:quality(80)/uploads/Warning.png\" width=\"628\" height=\"901\" loading=\"lazy\" alt=\"Warning.png\" /><figcaption>Oh no, what will I do on my Linux computer that doesn’t support your antivirus program?</figcaption></figure><p>This is a funny, if troubling element in the history of spam—and probably a spot of bad news for people who use vibe coding to actually make real things.</p></div><div class=\"adlayout ad-patreon\"><div class=\"md:grid md:grid-cols-3 lg:grid-cols-4 items-start gap-8\"><div class=\"md:col-span-1 max-w-[300px]\"><a href=\"https://ko-fi.com/tedium\" rel=\"nofollow sponsored\" class=\"block hover:no-underline\"><img src=\"https://static.tedium.co/uploads/kofi_logo.png\" alt=\"… You?\" class=\"w-full h-auto max-w-[300px] m-0\" loading=\"lazy\" /></a></div><div class=\"md:col-span-2 lg:col-span-3\"><h5 class=\"text-xl font-bold mb-2\" style=\"background-color: var(--ad-accent)\"><a href=\"https://ko-fi.com/tedium\" rel=\"nofollow sponsored\" class=\"block hover:no-underline\"> Sponsored By … You? </a></h5><div class=\"adcopy !max-w-none\"><p><strong>If you find weird or unusual topics</strong> like this super-fascinating, the best way to tell us is to <strong><a href=\"https://ko-fi.com/tedium\">give us a nod on Ko-Fi</a></strong>. It helps ensure that we can keep this machine moving, support outside writers, and bring on the tools to support our writing. (Also it’s heartening when someone chips in.)</p><p>We accept advertising, too! <a href=\"http://tedium.co/advertising/\">Check out this page to learn more</a>.</p></div></div></div></div><div class=\"whitebox\"><figure><img src=\"https://proxy.tedium.co/xUfrX21VN3IM50E0s6rGC4BhOqg=/603x721/filters:quality(80)/uploads/freespins.png\" width=\"603\" height=\"721\" loading=\"lazy\" alt=\"freespins.png\" /><figcaption>The strange thing about spam is that it tells you what the internet’s underbelly is into.</figcaption></figure><h3>The slop looks more competent than ever</h3><p><strong>Put simply:</strong> Now that the baseline of what makes something well-designed, albeit spartan, has increased, many of the signs we once used to detect a spam message are getting thrown out the window.</p><p>Which means that we’re more likely to get hit by spam that tricks us into clicking. And that’s bad news as we attempt to protect ourselves from the crap hiding in our inbox. We’re likely to trust less and accidentally give away more. And untrustworthy figures who don’t know how to code are more likely to throw more crap our way.</p><p>This is a point Anthropic itself pointed out in <a href=\"https://www-cdn.anthropic.com/b2a76c6f6992465c09a6f2fce282f6c0cea8c200.pdf\">one of its own reports</a> from last summer, about “no-code” ransomware that can be built by people incapable of actually building ransomware without the help of an LLM.</p><p>Despite this, these people can create commercial malware programs that they can sell for up to $1,200 a pop.</p><p>The security platform Guard.io <a href=\"https://guard.io/labs/vibescamming-from-prompt-to-phish-benchmarking-popular-ai-agents-resistance-to-the-dark-side\">makes clear</a> that platforms like Lovable are going to enable a new class of criminal:</p><blockquote><p>Just like with “Vibe-coding”, creating scamming schemes these days requires almost no prior technical skills. All a junior scammer needs is an idea and access to a free AI agent. Want to steal credit card details? No problem. Target a company’s employees and steal their Office365 credentials? Easy. A few prompts, and you’re off. The bar has never been lower, and the potential impact has never been more significant. That’s what we call VibeScamming.</p></blockquote><p>And, for people who vibe code, the real problem is that, long-term, their stuff is going to look very untrustworthy because of the specific mix of chrome, color, and emojis that vibe-coded applications specialize in.</p><p>The thing that ultimately makes something look human is the addition of actual design and human flair. I encourage you to actually put a little humanness into what you build if you’re going to do it and share it with the world.</p><h3>How to spot a vibe-coded faker</h3><p><strong>But for many,</strong> it is going to be harder than ever to tell what’s real and what’s fake. Which means you should probably go out of your way to use techniques like email obfuscation and email aliases to protect yourself. (It makes it easier to tell which bread-baking forum violated your trust, for one thing.)</p><p>On the plus side, there are still tells. A key one is if they refer to you by not your name, but the name of your email address. Another is the from address, which is often some highly obfuscated bit of junk designed to evade detection.</p><p>The one that made me laugh recently was when I got really crappy spam emails on an address that has never gotten them for the first time, promoting traditional spam topics with a Claudecore flair. They seemed random, but were extremely easy to get rid of, because they were all emailed from a bare Firebase domain, meaning that I could remove them with the help of a single filter.</p><p>Just because spam emails are more attractive now doesn’t mean the people making them aren’t still extremely stupid.</p></div><div class=\"graybox\"><h5>Spam-Free Links</h5><p><strong>A quick shout-out</strong> to the only tool that makes my inbox bearable in 2026, <a href=\"https://simpl.fyi\">Simplify Gmail</a>.</p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/DTCYA3Qa8YM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p><strong>Oh good, there’s a new web browser</strong> for PowerPC Macs in 2026, and per my pal <a href=\"https://www.youtube.com/watch?v=DTCYA3Qa8YM\">Action Retro</a>, it’s quite good!</p><p><strong>Speaking of inboxes,</strong> this story of an AI safety exec <a href=\"https://www.404media.co/meta-director-of-ai-safety-allows-ai-agent-to-accidentally-delete-her-inbox/\">letting an AI tool delete her inbox</a> is so darkly funny that I’m surprised it’s real.</p><p>--</p><p>Find this one an interesting read? <a href=\"https://tedium.co/2026/02/25/vibe-coded-email-spam/\">Share it with a pal</a>!</p><p><strong>Want to <em>actually</em> learn</strong> how to code with minimal vibes? Check out our sponsor <a href=\"https://scrimba.com/?via=u0171qc\">Scrimba</a>, which mixes video lessons with interactive code windows—and makes it feel downright approachable. <a href=\"https://scrimba.com/?via=u0171qc\">Sign up here for a 20% discount</a>.</p></div>\n    <img src=\"https://feed.tedium.co/link/15204/17283566.gif\" height=\"1\" width=\"1\"/>",
    "description": "The problem with making coding easier for more people is that it makes spam more conventionally attractive. Which is bad.",
    "is_fulltext": true,
    "source": "Tedium: The Dull Side of the Internet.",
    "pub_date": "2026-02-25T14:01:46Z",
    "fetched_at": "2026-02-26T00:36:12.216687",
    "url_hash": "aa08416ece158998bb5da1e04a322c67"
  }
]