[
  {
    "title": "Apple Announces F1 Broadcast Details, and a Surprising Netflix Partnership",
    "link": "https://sixcolors.com/post/2026/02/apple-announces-f1-details-and-a-surprising-netflix-partnership/",
    "content": "\n<p>Jason Snell, writing at Six Colors:</p>\n\n<blockquote>\n  <p>Perhaps the most surprising announcement on Thursday was that\nApple and Netflix, which have had a rather stand-offish\nrelationship when it comes to video programming, <a href=\"https://www.netflix.com/tudum/articles/formula-1-apple-netflix-drive-to-survive\">have struck a\ndeal to swap some Formula One-related content</a>. Formula One’s\ngrowing popularity in the United States is due, perhaps in large\npart, to the high-profile success of the Netflix docuseries “Drive\nto Survive.” The latest season of that series, debuting Friday,\nwill premiere simultaneously on both Netflix and Apple TV.\nPresumably, in exchange for that non-exclusive, Apple will also\nnon-exclusively allow Netflix to broadcast the Canadian Grand Prix\nin May. (Insert obligatory wish that Apple and Netflix would bury\nthe hatchet and enable Watch Now support in the TV app for Netflix\ncontent.)</p>\n</blockquote>\n\n<p>What a crazy cool partnership.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Apple Announces F1 Broadcast Details, and a Surprising Netflix Partnership’\"  href=\"https://daringfireball.net/linked/2026/02/26/apple-f1-netflix\">&nbsp;★&nbsp;</a>\n</div>\n\n\t",
    "description": "",
    "is_fulltext": true,
    "source": "Daring Fireball",
    "pub_date": "2026-02-27T01:30:26Z",
    "fetched_at": "2026-02-27T12:19:24.331768",
    "url_hash": "247f865b07b7b45a8f1bc652d97ba12d"
  },
  {
    "title": "xkcd 2347",
    "link": "https://nesbitt.io/2026/02/27/xkcd-2347.html",
    "content": "<p>I made an <a href=\"https://nesbitt.io/xkcd-2347/\">interactive version</a> of <a href=\"https://xkcd.com/2347/\">xkcd 2347</a>, the dependency comic, where you can drag blocks out of the tower and watch everything above them collapse.</p>\n\n<p><img src=\"/images/xkcd.gif\" alt=\"xkcd 2347 interactive game\" /></p>\n\n<p><a href=\"https://brm.io/matter-js/\">Matter.js</a> handles the physics and <a href=\"https://roughjs.com/\">Rough.js</a> gives it the hand-drawn xkcd look. Each reload generates a different tower from a seeded PRNG that picks a taper profile, varies the block sizes and row widths, and drifts the whole thing slightly off-center as it goes up. The project names are randomly assembled from parts that sound like real packages – things like <code class=\"language-plaintext highlighter-rouge\">node-flux.js</code> or <code class=\"language-plaintext highlighter-rouge\">libcrypt-fast</code> or <code class=\"language-plaintext highlighter-rouge\">hyper-mux@3.12.7</code> – though about one in five times you’ll get an actual name like left-pad or log4j instead. Reload enough times and you might run into some unusual tower shapes, and the <a href=\"https://en.wikipedia.org/wiki/Konami_Code\">Konami code</a> does what you’d hope.</p>\n\n<p>The info button shows the tower’s seed, which you can share as a <code class=\"language-plaintext highlighter-rouge\">?seed=</code> URL parameter, basically a way to say “look at this disaster” and have someone else see the exact same precarious arrangement.</p>\n\n<p>Some ways this could go further:</p>\n\n<ul>\n  <li>Upload an SBOM and build the tower from your actual dependency tree, with block sizes based on how many other packages depend on each one</li>\n  <li>Pull real dependency data from <a href=\"https://ecosyste.ms\">ecosyste.ms</a> so you can see what your project’s tower looks like before you start pulling blocks out</li>\n  <li>Use the phone’s accelerometer to let you tilt and topple the tower</li>\n</ul>\n\n<p><a href=\"https://github.com/andrew/nesbitt.io/tree/master/xkcd-2347\">Source on GitHub</a>.</p>",
    "description": "An interactive version of the dependency comic.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-27T10:00:00+00:00",
    "fetched_at": "2026-02-27T12:19:58.512394",
    "url_hash": "43e763a29a987ad36f05adc84398989d"
  },
  {
    "title": "The Insane Stupidity of UBI",
    "link": "https://geohot.github.io//blog/jekyll/update/2026/02/27/the-insane-stupidity-of-ubi.html",
    "content": "<p>Thinking that UBI will solve anything comes from a misunderstanding about money. <a href=\"/blog/jekyll/update/2025/02/24/money-is-the-map.html\">Money is a map, not a territory</a>. All <a href=\"https://basicincome.stanford.edu/experiments-map/\">UBI experiments</a> have been small scale, and of course UBI works at a small scale. No shit you can give a few people money and it’s all good and they are happy. Because the people they are buying from aren’t also on UBI. But once you add in the U part…</p>\n\n<p>What do you plan to buy with your free government dollars? Want to buy eggs? Sorry, the egg people stopped making eggs, they are living free on UBI. Want to buy a house? Who built it? Nobody, because they all were getting UBI and didn’t want to build houses anymore. They write poems now. There’s still old houses available, but the price for them has 20xed, well outside of what you can afford.</p>\n\n<p>Belief in UBI comes from a fallacy that the economy is some natural thing. I see supermarket. Supermarket has eggs for $5. I get $10,000 UBI. I can buy 2,000 eggs. Of course this isn’t what happens. Like most things politicians invent, nobody considered <a href=\"https://en.wikipedia.org/wiki/Perverse_incentive\">the second order effects</a>, and you will not be getting 2,000 eggs with your UBI. Cause everyone got the UBI and bought the eggs. Either no more eggs or price of eggs goes up. And even worse, many people quit work once they got the UBI. So now less eggs are made. And your whole UBI check gets you 6 or 7 eggs instead of 2,000, if that.</p>\n\n<hr />\n<p><br /></p>\n\n<p>The root of this stupidity is that <em>people see themselves apart from society</em>. They don’t know where stuff comes from, it might as well be the stuff fairy that puts it on the supermarket shelves and sets prices. If the stuff fairy was real, UBI might make sense. But we live in a society. We work for each other. At least the adults do. There already is UBI in the world for some people, it’s called allowance. It’s for children and high-end prostitutes.</p>\n\n<p>It reminds me of the <a href=\"https://malcolminthemiddle.fandom.com/wiki/Malcolm_Holds_His_Tongue\">episode of Malcolm in the Middle</a> where Malcolm dates this dumb hot girl, and she suggests solving poverty by making every 1 dollar bill into a million dollar bill. Have the UBI people considered that idea?</p>\n\n<p>What comes first, actually trying UBI or the end of democracy?</p>\n\n<hr />\n<p><br /></p>\n\n<p>(what you actually want is for everything to be cheap to produce. but sorry, <a href=\"https://x.com/SemiAnalysis_/status/2026719180284666046\">6 citizens “have concerns”</a> and now we have six more weeks of expensive memory. I’m glad <a href=\"https://en.wikipedia.org/wiki/ChangXin_Memory_Technologies\">the</a> <a href=\"https://en.wikipedia.org/wiki/Yangtze_Memory_Technologies\">Chinese</a> are ramping up memory production)</p>",
    "description": "Thinking that UBI will solve anything comes from a misunderstanding about money. Money is a map, not a territory. All UBI experiments have been small scale, and of course UBI works at a small scale. No shit you can give a few people money and it’s all good and they are happy. Because the people they are buying from aren’t also on UBI. But once you add in the U part…",
    "is_fulltext": true,
    "source": "the singularity is nearer",
    "pub_date": "2026-02-27T00:00:00+08:00",
    "fetched_at": "2026-02-27T12:20:05.402842",
    "url_hash": "d0ce5c7bb4c7dd1892bb26eb05316cc0"
  }
]