[
  {
    "title": "Quoting Kellan Elliott-McCrea",
    "link": "https://simonwillison.net/2026/Feb/25/kellan-elliott-mccrea/#atom-everything",
    "content": "\n    <blockquote cite=\"https://laughingmeme.org/2026/02/09/code-has-always-been-the-easy-part.html\"><p>It’s also reasonable for people who entered technology in the last couple of decades because it was good job, or because they enjoyed coding to look at this moment with a real feeling of loss. That feeling of loss though can be hard to understand emotionally for people my age who entered tech because we were addicted to feeling of agency it gave us. The web was objectively awful as a technology, and genuinely amazing, and nobody got into it because programming in Perl was somehow aesthetically delightful.</p></blockquote>\n<p class=\"cite\">&mdash; <a href=\"https://laughingmeme.org/2026/02/09/code-has-always-been-the-easy-part.html\">Kellan Elliott-McCrea</a>, Code has <em>always</em> been the easy part</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/perl\">perl</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/kellan-elliott-mccrea\">kellan-elliott-mccrea</a>, <a href=\"https://simonwillison.net/tags/agentic-engineering\">agentic-engineering</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/deep-blue\">deep-blue</a></p>\n\n\n\n",
    "description": "It’s also reasonable for people who entered technology in the last couple of decades because it was good job, or because they enjoyed coding to look at this moment with a real feeling of loss. That feeling of loss though can be hard to understand emotionally for people my age who entered tech because we were addicted to feeling of agency it gave us. The web was objectively awful as a technology, and genuinely amazing, and nobody got into it because programming in Perl was somehow aesthetically d",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-25T03:30:32+00:00",
    "fetched_at": "2026-02-25T12:22:30.360913",
    "url_hash": "d550b18b96bfc24e53d620d3818e3f5b"
  },
  {
    "title": "When access to knowledge is no longer the limitation",
    "link": "https://idiallo.com/blog/access-to-knowledge-is-no-longer-a-limitation?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>Let's do this thought experiment together. I have a little box. I'll place the box on the table. Now I'll open the little box and put all the arguments against large language models in it. I'll put all the arguments, including my own. Now, I'll close the box and leave it on the table.</p>\n\t\t\t<p>Now that that is out of the way, we are left with all the positives. All the good things that come from having the world's information at our fingertips. I can ask any question and get an answer almost instantly. Well, not all questions. The East has its sensitivities around a certain square, and the West about a certain island, but I digress.</p>\n\n<p>I can learn any subject I want to learn. I can take the work of any philosopher and ELI5 it. I can finally understand \"The World as Will and Representation\" by Schopenhauer. A friend gifted me a copy when I was still in my twenties, it's been steadily collecting dust ever since. But now I can turn to the book and ask questions until I thoroughly understand it. No need to read it cover to cover.</p>\n\n<p>In fact, last year I decided I wanted to learn about batteries. I first went to the Battery University website and started to read lesson by lesson. But I had questions. How was I going to get them answered? The StackExchange network <a href=\"https://idiallo.com/blog/we-were-never-good-programmers\">is not what it used to be</a>, so I turned to ChatGPT. It had all the answers. I learned and read so much about batteries that I am tempted to start a battery company.</p>\n\n<p>My twin boys are at that age where they suffer from the infinite WHYs. Why does it rain? Why does the earth spin? why does California still use the Highway Gothic font on some freeway signs? I do not have answers to these questions off the top of my head, but I have access to the infinite knowledge machine, so of course my kids know the answers now.</p>\n\n<p>Just the other day, I had a shower-thought about cars. \"Are cars just a slab of metal on wheels?\" And now I learned that the answer is \"essentially yes.\" But then I kept reading on the subject and learned about all those little devices and pieces of mechanical technologies that exist that I had never heard of. For example, the sway bar link. Did you know about it? Did you know that it reduces body roll and maintains stability during turns? Fascinating.</p>\n\n<p>Ever since LLMs made their public debut in 2022, we've been gifted with this knowledge base that we can interact with on demand, day and night, at work or at home. The possibilities seem endless. I can learn or understand any codebase without being familiar with the programming language. And yet it feels like something is missing.</p>\n\n<p>The more I access this knowledge, the more I feel the little box on my table is starting to open. Now this is just my opinion, but I'm starting to believe that the sum of all parts is still just one. Let me explain.</p>\n\n<p>In 2022, the Japanese Prime Minister Shinzo Abe was shot and killed. It came as a shock to me, Japan is not a country known for gun violence. So in December of that year, I decided to learn more about him, about Japan, and about their stance on guns. With the holiday season and the rolling code freeze at work, I spent a good amount of time just reading through Wikipedia, some translated Japanese forums, and some official documents. A whole lot of material. Long story short, I still don't have a definitive answer as to why exactly he was killed, but I came away with a richer understanding of the story and the perspectives of the people around him.</p>\n\n<p>Reading more material is not going to give me a definitive answer, but it helps paint a richer picture of the event. I spent enough time with the subject to appreciate the knowledge I gathered over those weeks.</p>\n\n<p>When you ask ChatGPT why Shinzo Abe was shot, it will give you a satisfying answer. It will be correct, it will include some of the nuance, and will probably ask you if you want to learn more. The answer satisfies your curiosity and you move on... to your next question.</p>\n\n<p>It could be the chat interface. Even though the words on the page clearly ask you \"if you want to know more,\" somehow you are more keen on starting a new subject. And rare are the times we go back and re-read the material we have been provided with.</p>\n\n<p>With the books I've \"read\" through an LLM by asking multiple questions, I can hardly tell you that I understand them. Yes, I know the gist of it but it doesn't replace the knowledge you build by reading a book at a steady pace. You save a whole bunch of time by using an LLM, but the knowledge is fleeting. Reading original sources is slow, but you get to better immerse yourself in the subject.</p>\n\n<p>It seems like reading through an LLM removes the friction of learning, but in doing so it makes knowledge shallow and disposable. The problem is the way we process information as humans. We don't become experts by learning from summaries. The effort of learning is part of the process.</p>\n\n<p>Those endless questions my children have, there is a snack-like quality to the answers I give them. Because the answers are so easy to get, we treat them like a social media feed. I scroll through and one post is about batteries, the next is about sway bars, and somehow I land on California highways.</p>\n\n<p>Having the world's information at your fingertips is a gift, but knowing the gist of everything is not the same as understanding something deeply. We do not form character by reading the gist of it. Instead, character comes from the hunt for information. The limitation of a manual process forces us to focus, to dwell on a subject, until we truly internalize it.</p>\n\n<p>You can hardly spot a hallucination unless it concerns material that you already have knowledge in. Wait a minute. What's happening here. Ah! I see. The box has crept back open.</p>\n\t\t\t\n\t\t\t\t",
    "description": "Let's do this thought experiment together. I have a little box. I'll place the box on the table. Now I'll open the little box and put all the arguments against large language models in it. I'll put all the arguments, including my own. Now, I'll close the box and leave it on the table. Now that that is out of the way, we are left with all the positives. All the good things that come from having the world's information at our fingertips. I can ask any question and get an answer almost instantly. W",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Wed, 25 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-25T12:22:35.523549",
    "url_hash": "41859d85cbc2d4e1611d8cf8dbf4bfe8"
  },
  {
    "title": "Pluralistic: The whole economy pays the Amazon tax (25 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/25/most-favored-nation/",
    "content": "<p><!--\nTags:\nstates rights, amazon, price fixing, most favored nation, mfn, affordability, k-shaped economy,antitrust, trustbusting,\n\nSummary:\nThe whole economy pays the Amazon tax; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/25/most-favored-nation/\n\nTitle:\nPluralistic: The whole economy pays the Amazon tax (25 Feb 2026) most-favored-nation\n\nBullet:\n&#x1f9de;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/25Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#price-fixing\">The whole economy pays the Amazon tax</a>: You can't shop your way out of a monopoly.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#retro\">Object permanence</a>: Math denial; Disney v young Tim Burton; Make v Sony; American oligarchs' wealth (2011); New Librarian of Congress;  The Mauritanian; Bossware.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12468\"></span></p>\n<hr/>\n<p><a name=\"price-fixing\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A giant pile of money bags; climbing out of it is the bear from the California state flag. The background is an Amazon box, with the smile logo pointing in the opposite direction to the bear's motion.\" src=\"https://i0.wp.com/craphound.com/images/amazon-cal-price-fixing.jpg?w=840&#038;ssl=1\"/></p>\n<h1>The whole economy pays the Amazon tax (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#price-fixing\">permalink</a>)</h1>\n<p>Selling on Amazon is a tough business. Sure, you can reach a <em>lot</em> of customers, but this comes at a very high price: the junk fees that Amazon extracts from its sellers amount to <em>50-60%</em> of the price you pay.</p>\n<p>That's a hell of a lot of money to hand over to a middleman, but it's not like vendors have much choice. The vast majority of America's affluent households are Prime subscribers (depending on how you define \"affluent household\" it's north of 90%). Prime households prepay for a year's worth of shipping, so it's only natural that they start their shopping on Amazon, where they've already paid the delivery costs. And because Amazon reliably meets or beats the prices you'd pay elsewhere, Prime subscribers who find a product on Amazon overwhelmingly <em>stop</em> their shopping at Amazon, too.</p>\n<p>At this point you might be thinking a couple things:</p>\n<p>I. Why not try to sell the <em>non</em>-affluent households, who are far less likely to subscribe to Prime? and</p>\n<p>II. If Amazon has the lowest prices, what's the problem if everyone shops there?</p>\n<p>The answers to these two questions are intimately related, as it happens.</p>\n<p>Let's start with selling to non-affluent households &#8211; basically, the bottom 90% of American earners. The problem here is that everyone who isn't in that top 10% is pretty goddamned <em>broke</em>. It's not just decades of wage stagnation and hyperinflation in health, housing and education costs. It's also that every economic crisis of this century has resulted in a \"K-shaped\" recovery, in which \"economic recovery\" means that rich people are doing fine, while everyone else is worse off than they were before the crisis.</p>\n<p>For decades, America papered over the K-shaped hole in its economy with debt. First it was credit cards. Then it was gimmicky mortgages &#8211; home equity lines of credit, second mortgages and reverse mortgages. Then it was payday lenders. Then it was \"buy-now/pay-later\" services that let you buy lunch at Chipotle on an installment plan that is nominally interest-free, but is designed to trap the unwary and unlucky with <em>massive</em> penalties if you miss a single payment.</p>\n<p>This produced a median American who isn't just cash-poor &#8211; they are cash-<em>negative</em>, drowning in debt. And &#8211; with the exception of a brief Biden intercession &#8211; every presidential administration of the 21st century has enacted policies that favor creditors over debtors. Bankruptcy is harder to declare, and creditors can hit you with effectively unlimited penalties and confiscation of your property and wages once your cash is gone. Trump has erased all the small mercies of the Biden years &#8211; for example, he just forced 8,000,000 student borrowers back into repayment:</p>\n<p><a href=\"https://prospect.org/2025/12/16/gop-forcing-eight-million-student-loan-borrowers-into-repayment/\">https://prospect.org/2025/12/16/gop-forcing-eight-million-student-loan-borrowers-into-repayment/</a></p>\n<p>The average American worker has $955 saved for retirement:</p>\n<p><a href=\"https://finance.yahoo.com/news/955-saved-for-retirement-millions-are-in-that-boat-150003868.html\">https://finance.yahoo.com/news/955-saved-for-retirement-millions-are-in-that-boat-150003868.html</a></p>\n<p>There's plenty to worry about in a K-shaped economy &#8211; big things like \"political instability\" and \"cultural chaos\" (the fact that most people are broke has a lot to do with the surging fortunes of gambling platforms). But from a seller's perspective, the most important impact of the K-shaped economy is that only rich people buy stuff. Selling to the bottom 90% is a losing proposition because they're increasingly too broke to buy <em>anything</em>:</p>\n<p><a href=\"https://pluralistic.net/2025/12/16/k-shaped-recovery/#disenshittification-nations\">https://pluralistic.net/2025/12/16/k-shaped-recovery/#disenshittification-nations</a></p>\n<p>Combine the fact that the richest 10% of Americans all start their shopping on Amazon with the fact that no one else can afford to buy anything, and it's easy to see why merchants would stay on Amazon, even when junk fees hit 60%.</p>\n<p>Which brings us to the second question: if Amazon has the best prices, what's the problem with everyone shopping there?</p>\n<p>The answer is to be found in the California Attorney General's price-fixing lawsuit against Amazon:</p>\n<p><a href=\"https://oag.ca.gov/news/press-releases/attorney-general-bonta-exposes-amazon-price-fixing-scheme-driving-costs\">https://oag.ca.gov/news/press-releases/attorney-general-bonta-exposes-amazon-price-fixing-scheme-driving-costs</a></p>\n<p>The suit's been running for a long time, but the AG's office just celebrated a milestone &#8211; they've finished analyzing the internal memos they forced Amazon to disgorge through civil law's \"discovery\" process. These internal docs verify an open &#8211; and very dirty &#8211; secret about Amazon: the company uses its power to push up prices <em>across the entire economy</em>.</p>\n<p>Here's how that works: sellers <em>have</em> to sell on Amazon, and that means they're losing $0.50-$0.60 on every dollar. The obvious way to handle this is by raising prices. But Amazon knows that its power comes from offering buyers prices that are as low or lower than the prices at all its competitors.</p>\n<p>Amazon <em>could</em> ban its sellers from raising prices, but if they did that, they'd have to accept a smaller share of every sale (otherwise most of their sellers would go broke from selling at a loss on Amazon). So instead, Amazon imposes a business practice called \"most favored nation\" (MFN) pricing on its sellers.</p>\n<p>Under an MFN arrangement, sellers are allowed to raise their prices on Amazon, but when they do, they must raise their prices <em>everywhere else, too</em>: at Walmart, at Target, at mom and pop indie stores, and at their own factory outlet store. Remember: Amazon doesn't have to have <em>low</em> prices to win, it just needs to have <em>the same prices as everyone else</em>. So long as prices rise throughout the economy, Amazon is fine, and it can continue to hike its junk fees on sellers, knowing that they will pay those fees by raising prices on Amazon and everywhere else their products are sold.</p>\n<p>Like I say, this isn't really a secret. MFN terms were the basis of DC Attorney General Ken Racine's case against Amazon, five years ago:</p>\n<p><a href=\"https://pluralistic.net/2021/06/01/you-are-here/#prime-facie\">https://pluralistic.net/2021/06/01/you-are-here/#prime-facie</a></p>\n<p>Amazon's not the only company that does this. Under the Biden administration, the FTC brought a lawsuit against Pepsi because Pepsi and Walmart had rigged the market so that when Walmart raised its prices, Pepsi would force everyone else who carried Pepsi products to raise their prices even more. Walmart still had the lowest prices, but <em>everything everywhere</em> got more expensive, both at Walmart and everywhere else:</p>\n<p><a href=\"https://www.thebignewsletter.com/p/secret-documents-show-pepsi-and-walmart\">https://www.thebignewsletter.com/p/secret-documents-show-pepsi-and-walmart</a></p>\n<p>Trump's FTC dropped the Pepsi/Walmart case, and Amazon wriggled out of the DC case, but the California AG's office has a lot more resources than DC can muster. This is a timely reminder that America's antitrust laws can be enforced at the state level as well as by the federal authorities. Trump might be happy to let Amazon steal from Americans so long as Jeff Bezos neuters the <em>Washington Post</em>, writes a check for $1m to sit on the inaugural dais, and makes a garbage movie about Melania; but that doesn't stop California AG Rob Bonta from going after Amazon for ripping off Californians (and, in so doing, develop the evidentiary record and precedent that will allow every other state AG to go after Amazon).</p>\n<p>The fact that Amazon's monopoly lets it control prices across the economy highlights the futility of trying to fix the Amazon problem by shopping elsewhere. A \"boycott\" isn't you <em>shopping really hard</em>, it's an organized movement with articulated demands, a theory of change, and a backbone of solidarity. \"Conscious consumption\" is a dead-end:</p>\n<p><a href=\"https://jacobin.com/2026/02/individual-boycotts-collective-action-ice/\">https://jacobin.com/2026/02/individual-boycotts-collective-action-ice/</a></p>\n<p>Obviously, Californians have more to worry about than getting ripped off by Amazon (like getting murdered or kidnapped by ICE agents who want to send us all to a slave labor camp in El Salvador), but the billions that Amazon steals from American buyers and sellers are the source of the millions that Bezos uses to support Trump's fascist takeover of America. Without billionaires who would happily support concentration camps in their back yards if it means saving a dollar on their taxes, fascism would still be a fringe movement.</p>\n<p>That's why, when we hold new Nuremberg trials for Trump and his collaborators, we should also unwind every merger that was approved under Trump:</p>\n<p><a href=\"https://pluralistic.net/2026/02/10/miller-in-the-dock/#denazification\">https://pluralistic.net/2026/02/10/miller-in-the-dock/#denazification</a></p>\n<p>The material support for Trump's ideology of hate, violence and terror comes from Trump's program of unregulated corporate banditry. A promise to claw back every stolen dime might cool the ardor of Trump's corporate supporters, and even if it doesn't, zeroing out their bank-balances after Trump is gone will be an important lesson for future would-be billionaire collaborators.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>One Year In: The Good and The (Mostly) Bad and Ugly of Trump Antitrust and Consumer Protection <a href=\"https://economicpopulist.substack.com/p/one-year-in-the-good-and-the-mostly\">https://economicpopulist.substack.com/p/one-year-in-the-good-and-the-mostly</a></p>\n</li>\n<li>\n<p>2025 State of Clutter Report <a href=\"https://yorba.co/state-of-clutter\">https://yorba.co/state-of-clutter</a></p>\n</li>\n<li>\n<p>A.I. Isn't People <a href=\"https://www.todayintabs.com/p/a-i-isn-t-people\">https://www.todayintabs.com/p/a-i-isn-t-people</a></p>\n</li>\n<li>\n<p>Color Game <a href=\"https://dialed.gg/\">https://dialed.gg/</a></p>\n</li>\n<li>\n<p>Paediatricians’ blood used to make new treatments for RSV and colds <a href=\"https://www.newscientist.com/article/2516079-paediatricians-blood-used-to-make-new-treatments-for-rsv-and-colds/\">https://www.newscientist.com/article/2516079-paediatricians-blood-used-to-make-new-treatments-for-rsv-and-colds/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#retro\">permalink</a>)</h1>\n<p>#20yrsago Princeton prof explains watermarks’ failures <a href=\"https://blog.citp.princeton.edu/2006/02/24/how-watermarks-fail/\">https://blog.citp.princeton.edu/2006/02/24/how-watermarks-fail/</a></p>\n<p>#20yrsago Palm Beach County voting machines generated 100K anomalies in 2004 <a href=\"https://web.archive.org/web/20060225172632/https://www.bbvforums.org/cgi-bin/forums/board-auth.cgi?file=/1954/19421.html\">https://web.archive.org/web/20060225172632/https://www.bbvforums.org/cgi-bin/forums/board-auth.cgi?file=/1954/19421.html</a></p>\n<p>#15yrsago Sharing the power in Tahrir Square <a href=\"https://www.flickr.com/photos/47421217@N08/5423296010/\">https://www.flickr.com/photos/47421217@N08/5423296010/</a></p>\n<p>#15yrsago 17-year-old Tim Burton’s rejection from Walt Disney Productions <a href=\"https://web.archive.org/web/20110226083118/http://www.lettersofnote.com/2011/02/giant-zlig.html\">https://web.archive.org/web/20110226083118/http://www.lettersofnote.com/2011/02/giant-zlig.html</a></p>\n<p>#15yrsago Rare Alan Turing papers bought by Bletchley Park Trust <a href=\"https://web.archive.org/web/20110225145556/https://www.bletchleypark.org.uk/news/docview.rhtm/635610\">https://web.archive.org/web/20110225145556/https://www.bletchleypark.org.uk/news/docview.rhtm/635610</a></p>\n<p>#15yrsago Sony considered harmful to makers, innovators and hackers <a href=\"https://web.archive.org/web/20151013140820/http://makezine.com/2011/02/24/sonys-war-on-makers-hackers-and-innovators/\">https://web.archive.org/web/20151013140820/http://makezine.com/2011/02/24/sonys-war-on-makers-hackers-and-innovators/</a></p>\n<p>#15yrsago MPAA: record-breaking box-office year is proof that piracy is killing movies <a href=\"https://arstechnica.com/tech-policy/2011/02/piracy-once-again-fails-to-get-in-way-of-record-box-office/\">https://arstechnica.com/tech-policy/2011/02/piracy-once-again-fails-to-get-in-way-of-record-box-office/</a></p>\n<p>#15yrsago Super-wealthy clothes horses and their sartorial habits <a href=\"https://web.archive.org/web/20110217045201/http://online.wsj.com/article/SB10001424052748704409004576146420210142748.html\">https://web.archive.org/web/20110217045201/http://online.wsj.com/article/SB10001424052748704409004576146420210142748.html</a></p>\n<p>#15yrsago Visualizing the wealth of America’s super-rich ruling class <a href=\"https://www.motherjones.com/politics/2011/02/income-inequality-in-america-chart-graph/\">https://www.motherjones.com/politics/2011/02/income-inequality-in-america-chart-graph/</a></p>\n<p>#10yrsago Obama’s new Librarian of Congress nominee is a rip-snortin’, copyfightin’, surveillance-hatin’ no-foolin’ LIBRARIAN <a href=\"https://www.youtube.com/watch?v=iU8vXDoBB5s\">https://www.youtube.com/watch?v=iU8vXDoBB5s</a></p>\n<p>#10yrsago Math denialism: crypto backdoors and DRM are the alternative medicine of computer science <a href=\"https://www.theguardian.com/technology/2016/feb/24/the-fbi-wants-a-backdoor-only-it-can-use-but-wanting-it-doesnt-make-it-possible\">https://www.theguardian.com/technology/2016/feb/24/the-fbi-wants-a-backdoor-only-it-can-use-but-wanting-it-doesnt-make-it-possible</a></p>\n<p>#10yrsago Uganda’s corrupt president just stole another election, but he couldn’t steal the Internet <a href=\"https://web.archive.org/web/20160225095947/https://motherboard.vice.com/read/uganda-election-day-social-media-blackout-backlash-mobile-payments\">https://web.archive.org/web/20160225095947/https://motherboard.vice.com/read/uganda-election-day-social-media-blackout-backlash-mobile-payments</a></p>\n<p>#10yrsago Archbishop of St Louis says Girl Scout Cookies encourage sin <a href=\"https://www.theguardian.com/us-news/2016/feb/23/girl-scouts-cookies-missouri-catholics-st-louis-archbishop\">https://www.theguardian.com/us-news/2016/feb/23/girl-scouts-cookies-missouri-catholics-st-louis-archbishop</a></p>\n<p>#10yrsago After appointed city manager illegally jacked up prices, Flint paid the highest water rates in America <a href=\"https://eu.freep.com/story/news/local/michigan/flint-water-crisis/2016/02/16/study-flint-paid-highest-rate-us-water/80461288/\">https://eu.freep.com/story/news/local/michigan/flint-water-crisis/2016/02/16/study-flint-paid-highest-rate-us-water/80461288/</a></p>\n<p>#10yrsago Baidu browser isn’t just a surveillance tool, it’s a remarkably sloppy one <a href=\"https://citizenlab.ca/research/privacy-security-issues-baidu-browser/\">https://citizenlab.ca/research/privacy-security-issues-baidu-browser/</a></p>\n<p>#5yrsago Why Brits can no longer order signed copies of my books <a href=\"https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#brexit-books\">https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#brexit-books</a></p>\n<p>#5yrsago Court rejects TSA qualified immunity <a href=\"https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#junk-touching\">https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#junk-touching</a></p>\n<p>#5yrsago The Mauritanian <a href=\"https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#gwb-and-gitmo\">https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#gwb-and-gitmo</a></p>\n<p>#5yrsago EVs as distributed storage grid <a href=\"https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#mobile-batteries\">https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#mobile-batteries</a></p>\n<p>#5yrsago Bossware and the shitty tech adoption curve <a href=\"https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#bossware\">https://pluralistic.net/2021/02/24/gwb-rumsfeld-monsters/#bossware</a></p>\n<p>#1yrsago How an obscure advisory board lets utilities steal $50b/year from ratepayers <a href=\"https://pluralistic.net/2025/02/24/surfa/#mark-ellis\">https://pluralistic.net/2025/02/24/surfa/#mark-ellis</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Oslo (remote): Seminar og lansering av rapport om «enshittification», Feb 27<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Montreal: Bronfman Lecture (McGill) Apr 10<br />\n<a href=\"https://www.eventbrite.ca/e/artificial-intelligence-the-ultimate-disrupter-tickets-1982706623885\">https://www.eventbrite.ca/e/artificial-intelligence-the-ultimate-disrupter-tickets-1982706623885</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#recent\">permalink</a>)</h1>\n<ul>\n<li>Making The Internet Suck Less (Thinking With Mitch Joel)<br />\n<a href=\"https://www.sixpixels.com/podcast/archives/making-the-internet-suck-less-with-cory-doctorow-twmj-1024/\">https://www.sixpixels.com/podcast/archives/making-the-internet-suck-less-with-cory-doctorow-twmj-1024/</a></p>\n</li>\n<li>\n<p>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/25/most-favored-nation/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1020 words today, 37190 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links The whole economy pays the Amazon tax: You can't shop your way out of a monopoly. Hey look at this: Delights to delectate. Object permanence: Math denial; Disney v young Tim Burton; Make v Sony; American oligarchs' wealth (2011); New Librarian of Congress; The Mauritanian; Bossware. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All t",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Wed, 25 Feb 2026 11:07:59 +0000",
    "fetched_at": "2026-02-25T12:22:37.588314",
    "url_hash": "326e26415723e5983329fdecf4eca9f0"
  },
  {
    "title": "Trig of inverse trig",
    "link": "https://www.johndcook.com/blog/2026/02/25/trig-of-inverse-trig/",
    "content": "<p>I ran across an old article [1] that gave a sort of multiplication table for trig functions and inverse trig functions. Here&#8217;s my version of the table.</p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/trig_of_inverse.svg\" width=\"336\" height=\"1219\" /></p>\n<p>I made a few changes from the original. First, I used LaTeX, which didn&#8217;t exist when the article was written in 1957. Second, I only include sin, cos, and tan; the original also included csc, sec, and cot. Third, I reversed the labels of the rows and columns. Each cell represents a trig function applied to an inverse trig function.</p>\n<p>The third point requires a little elaboration. The table represents function composition, not multiplication, but is expressed in the format of a multiplication table. For the composition <em>f</em>( <em>g</em>(<em>x</em>) ), do you expect <em>f</em> to be on the side or top? It wouldn&#8217;t matter if the functions commuted under composition, but they don&#8217;t. I think it feels more conventional to put the outer function on the side; the author make the opposite choice.</p>\n<p>The identities in the table are all easy to prove, so the results aren&#8217;t interesting so much as the arrangement. I&#8217;d never seen these identities arranged into a table before. The matrix of identities is not symmetric, but the 2 by 2 matrix in the upper left corner is because</p>\n<p style=\"padding-left: 40px;\">sin(cos<sup>−1</sup>(<em>x</em>)) = cos(sin<sup>−1</sup>(<em>x</em>)).</p>\n<p>The entries of the third row and third column are not symmetric, though they do have some similarities.</p>\n<p>You can prove the identities in the sin, cos, and tan rows by focusing on the angles θ, φ, and ψ below respectively because θ = sin<sup>−1</sup>(<em>x</em>), φ = cos<sup>−1</sup>(<em>x</em>), and ψ = tan<sup>−1</sup>(<em>x</em>). This shows that the square roots in the table above all fall out of the Pythagorean theorem.</p>\n<p><img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/sin_arcsin.png\" width=\"291\" height=\"241\" /></p>\n<p><img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/tan_arctan2.png\" width=\"289\" height=\"234\" /></p>\n<p>[1] G. A. Baker. Multiplication Tables for Trigonometric Operators. The American Mathematical Monthly, Vol. 64, No. 7 (Aug. &#8211; Sep., 1957), pp. 502–503.</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/25/trig-of-inverse-trig/\">Trig of inverse trig</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "I ran across an old article [1] that gave a sort of multiplication table for trig functions and inverse trig functions. Here&#8217;s my version of the table. I made a few changes from the original. First, I used LaTeX, which didn&#8217;t exist when the article was written in 1957. Second, I only include sin, cos, [&#8230;] The post Trig of inverse trig first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Wed, 25 Feb 2026 11:00:54 +0000",
    "fetched_at": "2026-02-25T12:22:56.574001",
    "url_hash": "8498907bfff583caa4dbd1ae07771824"
  },
  {
    "title": "Everything is awesome (why I'm an optimist)",
    "link": "https://www.joanwestenberg.com/everything-is-awesome-why-im-an-optimist/",
    "content": "<img src=\"https://www.joanwestenberg.com/content/images/2026/02/ChatGPT-Image-Feb-25--2026--12_03_25-PM.png\" alt=\"Everything is awesome (why I&apos;m an optimist)\"><p>February is the month the internet decided we&apos;re all going to die.</p><p>In the span of about two weeks, Matt Shumer&apos;s <a href=\"https://shumer.dev/something-big-is-happening?ref=joanwestenberg.com\">Something Big is Happening</a> racked up over 80 million views on X with its breathless comparison of AI to the early days of COVID, telling his non-tech friends and family that we&apos;re in the &quot;this seems overblown&quot; phase of something much, much bigger than a pandemic. Before anyone had finished arguing about that, Citrini Research published <a href=\"https://www.citriniresearch.com/p/2028gic?ref=joanwestenberg.com\">THE 2028 GLOBAL INTELLIGENCE CRISIS</a> (all caps) a fictional dispatch from June 2028 in which unemployment has hit 10.2%, the S&amp;P 500 has crashed 38% from its highs, and the consumer economy has been hollowed out by what they coined &quot;Ghost GDP&quot;: output that shows up in the national accounts but never circulates through the real economy, because, as Citrini helpfully observed, machines spend zero dollars on discretionary goods. Michael Burry signal-boosted it. <a href=\"https://www.bloomberg.com/news/articles/2026-02-23/software-payments-shares-tumble-after-citrini-post-on-ai-risks?ref=joanwestenberg.com\">Bloomberg covered it</a>. IBM fell 13%. Software and payments stocks shed over $200 billion in market cap in a single day, apparently because a Substack post called upon them by name and investors decided that constituted news.</p><p>The doom loop Citrini described is simple: AI capabilities improve, companies need fewer workers, white-collar layoffs increase, displaced workers spend less, margin pressure pushes firms to invest more in AI, AI capabilities improve. Repeat until civilization unravels. Shumer, meanwhile, told people to get their financial houses in order because the permanent underclass is imminent. </p><p>Both pieces went stratospherically viral, and both, I believe, are entirely wrong about where this is heading.</p><p>I want to make a case for optimism. </p><p>For anyone who read those pieces and felt the dread, whether you&apos;re building AI and worrying about what it means, or you&apos;ve absorbed the pessimist consensus and started treating decline as a foregone conclusion, or you&#x2019;re in the bucket of people Shumer insists are fucked; I&apos;m going to argue that the pessimists have the best narratives and the worst track record. The doom scenarios require assumptions that don&apos;t survive contact with economic history, and the psychological posture you bring to this moment actually matters for how it turns out.</p><h2 id=\"why-the-doom-loop-feels-so-right\">Why the doom loop feels so right</h2><p>The central mechanism of the Citrini thesis: when you make intelligence abundant and cheap, you destroy the income that 70% of GDP depends on. A single GPU cluster in North Dakota generating the output previously attributed to 10,000 white-collar workers in midtown Manhattan is, in their framing, &quot;more economic pandemic than economic panacea.&quot; The velocity of money flatlines. The consumer economy withers. Ghost GDP accumulates in the national accounts while real humans stop being able to pay their mortgages.</p><p>Noah Smith, writing on <a href=\"https://www.noahpinion.blog/p/the-citrini-post-is-just-a-scary?ref=joanwestenberg.com\">Noahpinion</a> the day after the selloff, called it &quot;a scary bedtime story&quot; and pointed out that Citrini doesn&apos;t use an explicit macroeconomic model, so you can&apos;t actually see what assumptions are driving the doom spiral. Smith noted that none of the analysts whose job it is to track Visa and Mastercard stock had apparently thought about AI disruption until a blogger spelled it out for them, which tells you more about sentiment-driven trading than it does about macroeconomics. The economist Gerard MacDonell described the entire piece as &quot;allegorical&quot; but pointed out that it ignores a basic economic principle: production generates income.</p><p>Ben Thompson, on Stratechery, has been making a version of this counterargument for months, most forcefully in his January piece <a href=\"https://stratechery.com/2026/ai-and-the-human-condition/?ref=joanwestenberg.com\">AI and the Human Condition</a>, where he argued that even if AI does all of the jobs, humans will still want humans, creating an economy for labor precisely because it is labor. Thompson&apos;s framing cuts to something the doom narratives consistently miss. They model AI exclusively as labor substitution: the same economy, minus humans. Every section of the Citrini piece is about replacing workers and squeezing margins on existing activity. What they don&apos;t model is what the freed-up surplus creates. As Thompson put it in <a href=\"https://stratechery.com/2026/another-viral-ai-doomer-article-the-fundamental-error-doordashs-ai-advantages/?ref=joanwestenberg.com\">his analysis of the Citrini selloff</a>, this is the real error: a refusal to believe in human choice and markets.</p><p>It&apos;s an error that has been made, in nearly identical form, about every major technological transformation in modern history. Every single time, the pessimists looked at what was being destroyed and extrapolated catastrophe, while failing to imagine what would be created, because the thing that would be created hadn&apos;t been invented yet.</p><h2 id=\"catastrophists-keep-being-wrong\">Catastrophists keep being wrong</h2><p>In 1810, 81% of the American workforce was employed in agriculture. Two hundred years later, it&apos;s about 1%. If you had shown someone in 1810 a chart of agricultural employment decline and asked them to model the economic consequences, the only rational projection would have been apocalypse. Where would 80% of the population find work? What would they do? How would anyone eat if the farmers were all displaced by machines?</p><p>The answer, of course, is that entirely new categories of work were created that no one in 1810 could have conceived of, and these new jobs paid dramaticaly more than subsistance farming. Factory work, office work, services, knowledge work, the entire apparatus of modernity: none of it was visible from the vantage point of the pre-industrial economy. The transition was brutal and uneven. The handloom weavers of England suffered. Dickens documented the squalor of early industrialization in prose that still makes you flinch. But the trajectory was real, and the people projecting permanent immiseration from the displacement of agricultural labor were, in the fullest sense, catastrophically wrong.</p><p>Tom Lee of Fundstrat made this point with a specific example that I find clarifying. The invention of flash-frozen food in the early 1900s disrupted farming, taking agriculture from 30-40% of employment down to its current sliver. The economy didn&apos;t collapse. It reallocated value elsewhere, into industries and occupations that the frozen food pioneers couldn&apos;t have imagined. And today, I can&apos;t name a single family that subsists on frozen TV dinners. </p><p>The Citrini scenario expects you to believe that AI will be the first major technological revolution in which this reallocation mechanism fails entirely. Where every previous wave of automation freed up human labor and capital to flow into new, higher-value activities, this time the loop... <em>stops</em>. The surplus accrues to the owners of compute, consumers lose purchasing power, and the negative feedback loop has no natural brake. It&apos;s worth sitting with how strong a claim that is. It requires every previous pattern of technological adaptation to be wrong, or at least irrelevant. And when you look at the actual data, there are signs that white-collar job postings have stabilized, layoff mentions on earnings calls remain well below early 2023 peaks, and forward-looking labor indicators show no sign of the displacement spiral that the doom thesis predicts.</p><p>Does that mean AI won&apos;t disrupt specific industries and jobs? Obviously it will. Some of those disruptions will be painful and dislocating for the people caught in them. But there&apos;s an enormous gap between &quot;this technology will cause serious labor market disruption that we need to manage&quot; and &quot;this technology will cause a self-reinforcing economic death spiral from which there is no recovery.&quot; Citrini is arguing the latter, while the evidence supports the former.</p><h2 id=\"why-vivid-scenarios-beat-boring-probabilities\">Why vivid scenarios beat boring probabilities</h2><p>There&apos;s a reason the doom narratives go viral while the measured counterarguments get a polite nod // a fraction of the engagement. It has nothing to do with the quality of the underlying analysis. It has everything to do with how human brains process information.</p><p>Daniel Kahneman&apos;s work on the availability heuristic showed that we judge the probability of events by how easily we can imagine them. Dystopia is easy to imagine. We have an extraordinarily rich cultural tradition of imagining technological nightmare scenarios in exquisite detail. Orwell did it brilliantly. Every season of Black Mirror does it competently. The Terminator gave us the visual grammar for AI catastrophe decades before anyone had a working language model. When Citrini describes a world where the unemployment rate hits 10.2% and the S&amp;P crashes 38%, you can picture it. You can feel the dread. Hollywood has been training you to feel exactly this dread for your entire life.</p><p>Now try to imagine the positive scenarios. Try to picture, in concrete sensory detail, a world where AI helps us solve protein folding problems across thousands of neglected tropical diseases, where it accelerates materials science research by orders of magnitude, where it makes high-quality legal and medical advice accessible to people who currently can&apos;t afford it, where it enables forms of creative expression and economic activity that we can&apos;t yet name because they don&apos;t exist yet. It&apos;s fuzzy and abstract. You can state it intellectually, but you can&apos;t feel it the way you can feel the unemployment spiral.</p><p>This asymmetry isn&apos;t trivial. The <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=5637576&amp;ref=joanwestenberg.com\">Ifo Institute</a> has published research showing that investors are willing to pay more for economic narratives than for raw forecasts, and that pessimistic narratives command higher prices among certain investor types. As <a href=\"https://klementoninvesting.substack.com/p/why-pessimists-make-more-money?ref=joanwestenberg.com\">Joachim Klement</a> put it in his response to the Citrini selloff: investors value narratives more than actual recession forecasts. Stories travel faster than spreadsheets.</p><p>Shumer&apos;s piece is a narrative construction, and a questionable piece of analysis. He opens with the COVID comparison: remember February 2020, when a few people were talking about a virus and everyone thought it was overblown? He positions himself as the insider who sees what&apos;s coming, who&apos;s been &quot;giving the polite, cocktail-party version&quot; but can&apos;t hold back the truth any longer. <a href=\"https://carvao.substack.com/p/the-problem-with-techs-latest-something?ref=joanwestenberg.com\">Paulo Carvao</a>, writing in Forbes, noted that it reads at times like a sales pitch. It&#x2019;s a used-car pitch at that. The Guardian pointed out that Shumer &quot;previously excited the internet by announcing the release of the world&apos;s &apos;top open-source model,&apos; which it was not.&quot; (To be clear: this is a kinder way of saying <a href=\"https://x.com/jawestenberg/status/2021782902342922514?s=20&amp;ref=joanwestenberg.com\" rel=\"noreferrer\">it was fraud.</a>)</p><p>But criticism doesn&apos;t travel like fear does. Fear is a better story. And so the doom narratives accumulate cultural mass while the boring, incremental, statistically-grounded counterarguments remain niche reading for economists and strategists.</p><h2 id=\"we-remember-disasters-not-the-ones-we-dodged\">We remember disasters, not the ones we dodged</h2><p>Humans are spectacular at remembering disasters, passed down in every format from the written word to the oral tradition. We are (for obvious reasons) terrible at remembering the disasters that didn&apos;t happen. In 1962, during the Cuban Missile Crisis, a Soviet submarine officer named Vasili Arkhipov refused to authorize the launch of a nuclear torpedo, overriding two other officers who wanted to fire. The world didn&apos;t end. Most people today have never heard of Arkhipov. Everyone knows about Hiroshima and Nagasaki. The bomb that fell is seared into collective memory. The bomb that didn&apos;t fall is a footnote.</p><p>The Y2K bug was going to crash civilization; then billions of dollars of engineering work fixed it, and everyone retroactively decided it was never a real threat. The ozone layer was going to disintegrate; then the Montreal Protocol worked better than almost anyone predicted, and ozone depletion feels like a quaint 1990s worry. Acid rain was dissolving the forests of North America; then sulfur dioxide regulations cut emissions drastically, and the whole issue evaporated from public consciousness. Every one of these was a genuine threat. Every one was met by human ingenuity and institutional coordination. Every one was subsequently memory-holed, because success is boring and failure is vivid.</p><p>We&apos;re running our forecasting models on a dataset that systematically excludes our wins. It should be entirely unsurprising that the forecasts come out somewhat bearish.</p><h2 id=\"ben-thompson-as-usual-gets-it-right\">Ben Thompson (as usual) gets it right</h2><p>Thompson&apos;s core insight is that humans want humans. He points to the agricultural revolutions: in the pre-Neolithic era, zero percent of humans worked in agriculture. By 1810, 81%. By today, 1%. Machines replaced human agricultural labor entirely, and rather than the economy collapsing, entirely new categories of work were created that paid dramatically more. This cycle played out again with industrialization, with computing, with the internet. Every time, the displacement was real, and every time, new forms of human-valued work emerged that couldn&apos;t have been predicted.</p><p>Citrini called DoorDash &quot;the poster child&quot; for AI disruption, imagining vibe-coded competitors fragmenting the market overnight. Thompson flips it: DoorDash is the poster child for why the article is absurd. DoorDash didn&apos;t always exist. It was built, and it wins through the active choice of customers, restaurants, and drivers. The doom thesis treats it as a static rent-extraction layer sitting on top of human laziness, but DoorDash created its market from scratch and generated new jobs for millions of drivers along the way. What the Citrini analysis lacks, Thompson argued, is any belief in human choice or markets. If your starting assumption is that things are as they are, you can only envision breaking them.</p><p>Citrini predicted AI would collapse real estate commissions by eliminating information asymmetry. But the internet already did that. You can look up every house for sale right now, with full history and photos. Real estate agents still exist, which is one of the better arguments that humans are resourceful at giving themselves work to do even in fields where they arguably shouldn&apos;t need to.</p><p>In a world of AI abundance, the things humans create will become more valuable precisely because they&apos;re human. AI art will make human art more desirable, not less, because provenance matters. AI-generated content will make human-generated content worth more, because the imperfections and idiosyncrasies are features. </p><p>Is this optimistic? Yes. Could it be wrong? Sure it could. But it&apos;s grounded in a real observation about human psychology that the doom models don&apos;t account for. Citrini&apos;s Ghost GDP thesis assumes that when AI replaces human labor, the value simply evaporates from the consumer economy. Thompson&apos;s counterargument is that humans will create new forms of value that are specifically human, and that demand for those forms of value will intensify as machine-generated alternatives become ubiquitous. The history of technological disruption suggests Thompson has the stronger case.</p><h2 id=\"pessimism-as-a-self-fulfilling-prophecy\">Pessimism as a self-fulfilling prophecy</h2><p>What actually worries me is the second-order effects of the doom narrative itself.</p><p>When the smartest, most technically capable people in a field become convinced that the field is heading toward catastrophe, several things happen. Some leave the field entirely, removing exactly the talent you&apos;d want steering the ship. Some stay but adopt a posture of resigned inevitability, which is functionally identical to apathy. Some decide that since disaster is coming, they might as well accelerate and cash out. And a vocal minority become so consumed by existential risk that they advocate for extreme countermeasures that would concentrate power in ways that create entirely new categories of danger.</p><p>Robert Oppenheimer (in the wake of his famous invocation of the Bhagavad Gita) spent the years after the Manhattan Project arguing passionately for international cooperation on nuclear governance. He didn&apos;t say &quot;we should never have done this.&quot; He said, essentially, &quot;this is incredibly powerful, and we need to build institutions that can handle it.&quot; He was an optimist in the meaningful sense: he believed better outcomes were achievable if people worked to achieve them. He was right about that, because we&apos;re still here.</p><p>The most effective people working on AI safety and governance right now are, almost without exception, optimists. They work on alignment because they believe alignment is solvable. They push for better governance becuase they believe governance can work. The ones who&apos;ve concluded that the problem is unsolvable tend to stop doing useful work, for obvious reasons.</p><p>Gramsci wrote about &quot;pessimism of the intellect, optimism of the will.&quot; You look at the world clearly. You see the problems. And then you choose to act as if better outcomes are possible, because that choice is the precondition for achieving them.</p><h2 id=\"nobody-can-see-the-next-economy\">Nobody can see the next economy</h2><p>What both Shumer and Citrini miss is that they&apos;re modeling a future economy using the structure of the present economy. They see AI replacing white-collar workers within the existing economic framework and project the consequences of that replacement within that same framework. But every major technological transformation has changed the framework itself, creating entirely new economic structures that were invisible from the vantage point of the old ones.</p><p>In 1995, if you told someone that one of the largest employers in America would be a company that let strangers sleep in each other&apos;s homes, they would have thought you were insane. If you told them that millions of people would make a living by talking into microphones about their opinions, or recording themselves playing video games, or writing newsletters on the internet, they&apos;d have had you committed. The entire creator economy, the gig economy, the app economy, the SaaS economy that Citrini is now eulogizing: none of it was predictable from the vantage point of 1995. And that&apos;s a 30-year window. The agricultural revolutions played out over centuries.</p><p>What will people do when AI can handle most current white-collar tasks? </p><p>I don&apos;t know. </p><p>And that&apos;s the whole point. </p><p>Nobody knew what displaced agricultural workers would do, either, until they did it. The absence of a visible next chapter isn&apos;t evidence that there won&apos;t be one. It&apos;s evidence that we&apos;re bad at predicting what humans will invent when constraints shift.</p><h2 id=\"choosing-optimism-with-open-eyes\">Choosing optimism with open eyes</h2><p>I&apos;m not saying everything will be fine. I&apos;m not saying the transition will be smooth. I&apos;m not saying that the people displaced by AI won&apos;t suffer, or that we don&apos;t need better policy frameworks to handle the disruption. The distributional concerns at the heart of the Citrini piece are legitimate. If productivity gains accrue primarily to the owners of compute and capital while labor income stagnates, that&apos;s a genuine problem. Labour&apos;s share of GDP has been declining for decades. These are real numbers pointing to real challenges.</p><p>What I am saying is that the leap from &quot;this will be disruptive and we need to manage it carefully&quot; to &quot;this will cause an irreversible economic death spiral&quot; isn&apos;t supported by the evidence, by economic history, or by what we know about how humans respond to technological change. The Citrini scenario requires every adaptive mechanism in the economy to fail simultaneously and completely within roughly two years. That&apos;s a very specific left-tail outcome.</p><p>If you&apos;re building AI systems, if you&apos;re founding companies, if you&apos;re writing code that will shape how people experience the world, your psychological orientation toward the future is a variable that directly shapes // affects outcomes. Pessimistic builders build defensively. They hoard and hedge and make decisions based on fear. Optimistic builders build with ambition. They invest in safety because they believe safety is achievable. They take on hard problems because they believe hard problems have solutions.</p><p>The tech industry is at a hinge point, and the narrative it tells itself will shape what it creates. If the dominant narrative is doom, the best people leave, the remaining people race to extract value before the collapse, and the governance frameworks get built by people who don&apos;t understand the technology. If the dominant narrative is cautious optimism, the best people stay, the work is good, and the institutions get built by people who know what they&apos;re building for.</p><p>Ed Yardeni, the veteran Wall Street strategist, noted in the wake of the Citrini selloff that &quot;the AI story has morphed from a Roaring 2020s productivity booster to an existential threat to our way of life.&quot; He found this striking. I find it absurd. The underlying technology hasn&apos;t changed, and the capabilities haven&apos;t shifted. What changed is the narrative, and narratives are always, <em>always </em>choices.</p><p>I choose optimism. I choose it because the alternative is surrender as sophistication. And because every time I look at the historical record, <em>the full record</em> that includes both the disasters and the averted disasters, both the tragedies and the triumphs, the case for human ingenuity and resilience is stronger than the case against it.</p><p>The doomers may have the best stories.</p><p>I believe the optimists have the best evidence.</p><p>I&apos;ll take the evidence.</p><p>Everything is (going to be) awesome.</p>",
    "description": "February is the month the internet decided we&apos;re all going to die.In the span of about two weeks, Matt Shumer&apos;s Something Big is Happening racked up over 80 million views on X with its breathless comparison of AI to the early days of COVID, telling",
    "is_fulltext": true,
    "source": "Westenberg.",
    "pub_date": "Wed, 25 Feb 2026 01:39:00 GMT",
    "fetched_at": "2026-02-25T12:23:02.193406",
    "url_hash": "723b4130412ff90f7bf770e7d1f20b41"
  },
  {
    "title": "Two Kinds of Attestation",
    "link": "https://nesbitt.io/2026/02/25/two-kinds-of-attestation.html",
    "content": "<p>The word “attestation” now means two unrelated things in open source, and the people using it in each sense don’t seem to be talking to each other much.</p>\n\n<p><a href=\"https://github.blog/security/supply-chain-security/introducing-npm-package-provenance/\">npm</a> and <a href=\"https://blog.pypi.org/posts/2024-11-14-pypi-now-supports-digital-attestations/\">PyPI</a> have both shipped build provenance attestations using <a href=\"https://www.sigstore.dev/\">Sigstore</a> over the past couple of years. When you publish a package from GitHub Actions with trusted publishing configured, the CI environment signs an <a href=\"https://in-toto.io/\">in-toto</a> attestation binding the artifact to the source repository, commit, and workflow that built it, and the signature goes into a public transparency log that anyone downstream can verify without trusting the registry. PyPI has had this on by default for trusted publishers since late 2024, npm generates provenance automatically, and the cost to publishers is close to zero. I wrote about how this fits into the broader <a href=\"/2026/02/24/reproducible-builds-in-language-package-managers/\">reproducible builds</a> picture recently.</p>\n\n<p>Meanwhile the <a href=\"https://digital-strategy.ec.europa.eu/en/library/cyber-resilience-act\">EU Cyber Resilience Act</a>, which grew out of product safety regulation originally written for things like toasters, introduced “open source stewards” as a legal concept, and Article 25 gives the <a href=\"https://commission.europa.eu/\">European Commission</a> power to create voluntary security attestation programmes for them. At FOSDEM this year, Æva Black <a href=\"https://fosdem.org/2026/schedule/event/PTHENV-sustaining-foss-with-attestations/\">presented work with the Eclipse Foundation</a> on what such a programme might look like. The proposed model has manufacturers funding stewards who issue attestations about the projects they support, with a tiered approach where the light tier asks whether a project has functional tests, a vulnerability reporting contact, and an end-of-life policy. Æva noted a maintainer could fill it out in minutes. So this is a checklist about project hygiene, filled out by a human, attesting to things like whether a CONTRIBUTING.md exists, which has almost nothing in common with a cryptographic proof logged in a transparency ledger except that both are called attestations.</p>\n\n<p>Madalin Neag at OpenSSF <a href=\"https://openssf.org/blog/2026/01/21/preserving-open-source-sustainability-while-advancing-cybersecurity-compliance/\">wrote an excellent piece</a> in January working through the details of how steward attestations relate to the projects they cover, since stewards don’t control technical decisions or releases, and a point-in-time attestation may not reflect the state of a component by the time a manufacturer integrates it. These are the kind of design questions that need working out as the delegated act takes shape.</p>\n\n<p>This isn’t the first time naming has caused confusion at the boundary between open source and compliance. The CRA itself calls anyone who places software on the EU market a “manufacturer,” which is product safety language from the world of toasters and power tools. Daniel Stenberg <a href=\"https://daniel.haxx.se/blog/2022/01/24/logj4-security-inquiry-response-required/\">got a taste of what that framing produces</a> when a company sent him a compliance questionnaire demanding he account for Log4j in curl, treating him as a vendor with SLA obligations for a project that has never used Java.</p>\n\n<p>Both SPDX and CycloneDX have a “supplier” field for each component, and SBOM generators routinely fill it with the maintainer’s name, even though the maintainer has no contractual relationship with the consumer and <a href=\"https://www.softwaremaxims.com/blog/not-a-supplier\">is not a supplier</a> in any commercial sense. These words carry legal connotations that don’t match the relationships they’re describing, and now that they’re codified in standards and regulation they’re difficult to undo.</p>\n\n<p>What I keep thinking about is the maintainer who enables trusted publishing, whose CI generates Sigstore provenance on every release, and who then gets contacted by a foundation about a CRA attestation programme asking them to fill out a form about whether they have a security policy. The cryptographic attestation infrastructure already exists and already generates machine-verifiable supply chain metadata at scale, and continuous signals like <a href=\"https://docs.oasis-open.org/csaf/csaf/v2.0/csaf-v2.0.html\">CSAF</a> advisories and <a href=\"https://www.cisa.gov/sites/default/files/2023-04/minimum-requirements-for-vex-508c.pdf\">VEX</a> documents provide ongoing security posture rather than point-in-time snapshots. The Article 25 delegated act hasn’t been written yet and the Commission is still taking input. It would be nice if the two communities compared notes before then, if only so that maintainers don’t end up navigating two unrelated things with the same name.</p>\n\n<p>Naming is hard, but it matters more than usual when the names carry assumptions about what’s actually in place. “Attested” sounds rigorous whether or not it is, and “supplier” implies a contractual relationship that doesn’t exist. Once these words are in standards and regulations, people downstream build processes around what they think the words mean, and unpicking those assumptions later is much harder than getting the names right in the first place. Toaster regulations at least have the advantage that everyone agrees on what a toaster is.</p>",
    "description": "The oldest problem in computer science, but with toasters.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-25T00:00:00+00:00",
    "fetched_at": "2026-02-25T12:23:03.692104",
    "url_hash": "e5500b09a697b8fa458835f76cdcdbd4"
  }
]