[
  {
    "title": "Quoting Thoughtworks",
    "link": "https://simonwillison.net/2026/Feb/14/thoughtworks/#atom-everything",
    "content": "\n    <blockquote cite=\"https://www.thoughtworks.com/content/dam/thoughtworks/documents/report/tw_future%20_of_software_development_retreat_%20key_takeaways.pdf\"><p>The retreat challenged the narrative that AI eliminates the need for junior developers. Juniors are more profitable than they have ever been. AI tools get them past the awkward initial net-negative phase faster. They serve as a call option on future productivity. And they are better at AI tools than senior engineers, having never developed the habits and assumptions that slow adoption.</p>\n<p>The real concern is mid-level engineers who came up during the decade-long hiring boom and may not have developed the fundamentals needed to thrive in the new environment. This population represents the bulk of the industry by volume, and retraining them is genuinely difficult. The retreat discussed whether apprenticeship models, rotation programs and lifelong learning structures could address this gap, but acknowledged that no organization has solved it yet.</p></blockquote>\n<p class=\"cite\">&mdash; <a href=\"https://www.thoughtworks.com/content/dam/thoughtworks/documents/report/tw_future%20_of_software_development_retreat_%20key_takeaways.pdf\">Thoughtworks</a>, findings from a retreat concerning \"the future of software engineering\", conducted under Chatham House rules</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/careers\">careers</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a></p>\n\n\n\n",
    "description": "The retreat challenged the narrative that AI eliminates the need for junior developers. Juniors are more profitable than they have ever been. AI tools get them past the awkward initial net-negative phase faster. They serve as a call option on future productivity. And they are better at AI tools than senior engineers, having never developed the habits and assumptions that slow adoption. The real concern is mid-level engineers who came up during the decade-long hiring boom and may not have develop",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-14T04:54:41+00:00",
    "fetched_at": "2026-02-14T12:14:20.570636",
    "url_hash": "169c162ceb492ba13f2a6aeccdf5ab33"
  },
  {
    "title": "AI twitter's favourite lie: everyone wants to be a developer",
    "link": "https://www.joanwestenberg.com/ai-twitters-favourite-lie-everyone-wants-to-be-a-developer/",
    "content": "<img src=\"https://www.joanwestenberg.com/content/images/2026/02/Gemini_Generated_Image_ourub5ourub5ouru.jpg\" alt=\"AI twitter&apos;s favourite lie: everyone wants to be a developer\"><p>Twitter&apos;s latest consensus on inevitability: now that large language models can write code, everyone will become a software developer.</p><p>People, you see, have problems, and software solves problems, and AI removes the barrier between people and software, <em>therefore everyone will build their own software.</em></p><p>It&apos;s a syllogism, after a fashion, but its premise = so wildly disconnected from how actual humans behave that it borders on fantasy.</p><p><em>Because the average punter does not want to build software.</em></p><p>They don&apos;t want to prompt software.</p><p>They don&#x2019;t want to describe software.</p><p>They don&apos;t particularly want to think about software.</p><p>They want to tap, swipe and scroll with zero friction and next-to-zero cognitive input.</p><p>They want their problems to go away, and they would very much prefer if that happened without them having to open a terminal, a chat window, or anything else that reminds them of work.</p><p>This is damn-near universally applicable.</p><h2 id=\"most-people-are-not-tinkerers\">Most people are not tinkerers</h2><p>There&apos;s a deep assumption embedded in the &quot;everyone will build&quot; thesis, that most people are latent creators held back only by technical barriers. Remove the barriers, and creation floods forth. But we&apos;ve run this before. Desktop publishing tools became accessible in the 1980s with the Macintosh and PageMaker. Did everyone start designing their own newsletters? A handful did, and the rest continued to hire designers or, more commonly, didn&apos;t make newsletters at all. WordPress has made it trivially easy to build a website for over twenty years now, and the vast majority of small business owners still pay someone else to do it, or they use a template and never touch it again.</p><p>The people excited about vibe coding are, almost by definition, people who were already interested in building things, and they&apos;re projecting their own enthusiasm onto a general population that has repeatedley demonstrated a preference for buying solutions over building them.</p><p>And why wouldn&apos;t they prefer that?</p><p>Building things is cognitively expensive, whether or not it&#x2019;s financially viable.</p><p>And even when the technical barrier falls to zero, the conceptualisation barrier remains. You still have to know what you want, specify it clearly, evaluate whether what you got is what you wanted, and iterate if it&#x2019;s not. That&apos;s work // effort and for most people it is accompanied by functionally zero dopamine.</p><h2 id=\"the-spec-problem-nobody-talks-about\">The spec problem nobody talks about</h2><p>An old joke: the hardest part of building software is figuring out what the software should do. This has been true for decades, and AI hasn&apos;t changed it. If anything, AI has made the problem more visible. When the bottleneck was writing code, you could blame the difficulty of ~programming for why your project never got off the ground. Now that an AI can write code in seconds, the bottleneck is clearly, embarrassingly, you // me // us.</p><p>This is the part that the AI manics keep skating past. They demo an app built in ten minutes and declare that software development has been democratized. But the demo is always something with a clear spec: a to-do list, a calculator, a simple game with obvious rules. The rest of the world&#x2019;s problems don&apos;t come pre-decomposed into clean specifications.</p><p>The rest of the world may not even be able to fully articulate what&#x2019;s broken and what they want fixed.</p><h2 id=\"what-people-actually-want\">What people actually want</h2><p>Most folks don&apos;t want to build a custom CRM. </p><p>I do! I might! </p><p>I couldn&apos;t be more excited about what this era unlocks. </p><p>But I am not most people. </p><p>They want to sign up for one that works. They don&apos;t want to create their own budgeting app. They want Mint or YNAB to do the job. The entire SaaS economy exists as proof that people will pay monthly fees to avoid having to build or even <em>configure</em> things themselves.</p><p>And is there anything wrong with that preference?</p><p>The division of labor exists for good reasons, and Adam Smith figured this out in 1776 and he was a good deal smarter than a good many of us.</p><p>What people will actually do with AI is use AI-enhanced versions of existing products, with smarter search and better autocomplete inside the tools they already have. The revolution won&apos;t look like a hundred million people vibe coding custom apps. It&apos;ll look like existing software getting better at understanding what users want and doing it for them, which is what good software has always tried to do.</p><p>The tech industry has a long history of confusing what power users want with what everyone wants. The folks on AI Twitter who are building apps every weekend with Claude and GPT are having a great time, and the tools they&apos;re using are the same ones I&#x2019;m obsessing over most of my waking hours. But we are a self-selected sample of tinkerers and builders, and the conclusions they&apos;re drawing about the general population say more about their own relationship with technology than about anyone else&apos;s. </p><p>Most people, given a magic wand, would not wish for the ability to write software. They&apos;d wish for their sofware to work properly without them having to do fuck-all.</p>",
    "description": "Twitter&apos;s latest consensus on inevitability: now that large language models can write code, everyone will become a software developer.People, you see, have problems, and software solves problems, and AI removes the barrier between people and software, therefore everyone will build their own software.It&apos;s a",
    "is_fulltext": true,
    "source": "Westenberg.",
    "pub_date": "Sat, 14 Feb 2026 01:13:26 GMT",
    "fetched_at": "2026-02-14T12:14:50.604951",
    "url_hash": "35fd6726ee025483153c6f8037aef59a"
  },
  {
    "title": "Package Management Namespaces",
    "link": "https://nesbitt.io/2026/02/14/package-management-namespaces.html",
    "content": "<p>Every package needs a name. The rules for how those names work is one of the most consequential decisions a package manager makes, and one of the hardest to change later. I <a href=\"/2025/12/29/categorizing-package-registries.html\">categorized the approaches</a> previously and touched on the <a href=\"/2025/12/05/package-manager-tradeoffs.html\">tradeoffs</a> briefly.</p>\n\n<h3 id=\"flat-namespaces\">Flat namespaces</h3>\n\n<p>RubyGems, PyPI, crates.io, Hex, Hackage, CRAN, and LuaRocks all use flat namespaces: one global pool of names, first-come-first-served. You pick a name, and if nobody has it, it’s yours.</p>\n\n<p>This gives you <code class=\"language-plaintext highlighter-rouge\">gem install rails</code>, <code class=\"language-plaintext highlighter-rouge\">pip install requests</code>, <code class=\"language-plaintext highlighter-rouge\">cargo add serde</code>. The names are short, memorable, and greppable, with no punctuation to remember and no organization to look up.</p>\n\n<p>At scale, though, good names run out. Someone registers <code class=\"language-plaintext highlighter-rouge\">database</code> on day one and never publishes a real package. Or they publish something, abandon it, and the name sits there forever, pointing at a library last updated in 2013. PyPI has over 600,000 projects. Many of the short, obvious names were claimed years ago by packages with single-digit downloads.</p>\n\n<p>Name scarcity creates pressure, and you end up with <code class=\"language-plaintext highlighter-rouge\">python-dateutil</code> because <code class=\"language-plaintext highlighter-rouge\">dateutil</code> was taken, <code class=\"language-plaintext highlighter-rouge\">beautifulsoup4</code> because <code class=\"language-plaintext highlighter-rouge\">beautifulsoup</code> was the old version, or <code class=\"language-plaintext highlighter-rouge\">pillow</code> because the original <code class=\"language-plaintext highlighter-rouge\">PIL</code> package was abandoned and PyPI doesn’t recycle names. New developers have to learn not just what to install but which of several similar-sounding packages is the right one.</p>\n\n<p>Flat namespaces also make <a href=\"/2025/12/17/typosquatting-in-package-managers.html\">typosquatting</a> straightforward. Someone registers <code class=\"language-plaintext highlighter-rouge\">reqeusts</code> next to <code class=\"language-plaintext highlighter-rouge\">requests</code> and waits. The attack works because there’s nothing between the user’s keystrokes and the registry lookup, no organization to verify and no hierarchy to navigate, just a string match against a flat list.</p>\n\n<p>Some registries add normalization rules to limit this. PyPI treats hyphens, underscores, and dots as equivalent, so <code class=\"language-plaintext highlighter-rouge\">my-package</code> and <code class=\"language-plaintext highlighter-rouge\">my_package</code> resolve to the same thing. crates.io does similar normalization. RubyGems doesn’t, which is why both <code class=\"language-plaintext highlighter-rouge\">stripe</code> and <code class=\"language-plaintext highlighter-rouge\">stripe-ruby</code> can coexist as unrelated packages.</p>\n\n<h3 id=\"scoped-namespaces\">Scoped namespaces</h3>\n\n<p>npm added scopes in 2014. Instead of just <code class=\"language-plaintext highlighter-rouge\">babel-core</code>, you could publish <code class=\"language-plaintext highlighter-rouge\">@babel/core</code>. Packagist has always used <code class=\"language-plaintext highlighter-rouge\">vendor/package</code> format: <code class=\"language-plaintext highlighter-rouge\">symfony/console</code>, <code class=\"language-plaintext highlighter-rouge\">laravel/framework</code>. JSR, Ansible Galaxy, Puppet Forge, and others follow similar patterns.</p>\n\n<p>Scopes split the package name into two parts: who published it, and what they called it. Different organizations can use the same package name without collision, so <code class=\"language-plaintext highlighter-rouge\">@types/node</code> and <code class=\"language-plaintext highlighter-rouge\">@anthropic/node</code> coexist without confusion.</p>\n\n<p>npm’s implementation is interesting because scopes are optional. You can still publish unscoped packages to the flat namespace. So npm actually has two systems running in parallel: a flat namespace for legacy packages and a scoped namespace for newer ones.</p>\n\n<p>Most of the ecosystem’s most-used packages (<code class=\"language-plaintext highlighter-rouge\">express</code>, <code class=\"language-plaintext highlighter-rouge\">lodash</code>, <code class=\"language-plaintext highlighter-rouge\">react</code>) predate scopes and sit in the flat namespace. Scopes are most common for organizational packages (everything under <code class=\"language-plaintext highlighter-rouge\">@angular/</code>, for example) and type definitions (<code class=\"language-plaintext highlighter-rouge\">@types/</code>). And because so much of the ecosystem depends on unscoped names, npm can never require scopes without breaking the world.</p>\n\n<p>Packagist required scopes from the start. Every Composer package is <code class=\"language-plaintext highlighter-rouge\">vendor/package</code>, no exceptions. This avoided the split-namespace problem npm has, but it means you need to know the vendor name. Is it <code class=\"language-plaintext highlighter-rouge\">guzzlehttp/guzzle</code> or <code class=\"language-plaintext highlighter-rouge\">guzzle/guzzle</code>? You have to look it up. And vendor names themselves are first-come-first-served, just pushing the squatting problem up one level. The stakes are higher, though, because squatting a vendor name locks out an entire family of package names rather than just one. Someone could register the <code class=\"language-plaintext highlighter-rouge\">google</code> vendor on Packagist before Google gets there, and that blocks every <code class=\"language-plaintext highlighter-rouge\">google/*</code> package at once.</p>\n\n<p>Scopes also require governance. Who decides that <code class=\"language-plaintext highlighter-rouge\">@babel</code> belongs to the Babel team? npm ties scopes to user accounts and organizations, which means you need account management, ownership transfer procedures, and dispute resolution. When a maintainer leaves a project, their scoped packages might need to move. This is solvable but adds operational overhead that flat registries avoid.</p>\n\n<h3 id=\"hierarchical-namespaces\">Hierarchical namespaces</h3>\n\n<p>Maven Central uses reverse-domain naming: <code class=\"language-plaintext highlighter-rouge\">org.apache.commons:commons-lang3</code>, <code class=\"language-plaintext highlighter-rouge\">com.google.guava:guava</code>. The group ID is supposed to correspond to a domain you control.</p>\n\n<p>The reverse-domain approach ties naming authority to DNS. If you own <code class=\"language-plaintext highlighter-rouge\">example.com</code>, you can publish under <code class=\"language-plaintext highlighter-rouge\">com.example</code>. This defers governance to the existing DNS system rather than requiring the registry to manage name ownership. Maven Central enforces this by requiring you to prove domain ownership, or for projects without their own domain, to use <code class=\"language-plaintext highlighter-rouge\">io.github.username</code> as a fallback.</p>\n\n<p>That fallback is interesting because it quietly undermines the premise: the whole point of reverse-domain naming is that you prove ownership of infrastructure you control, but <code class=\"language-plaintext highlighter-rouge\">io.github.username</code> just defers to GitHub’s namespace. It’s URL-based naming wearing a reverse-domain costume.</p>\n\n<p>Organizations with stable domains get clean namespaces out of this. Apache, Google, and Spring all have clear homes. The trade-off is verbose identifiers. <code class=\"language-plaintext highlighter-rouge\">org.springframework.boot:spring-boot-starter-web</code> is a lot of characters. IDE autocompletion papers over this in Java, but the verbosity is real when reading build files or discussing dependencies.</p>\n\n<p>Domain ownership is also less stable than it looks. Companies get acquired and change domains. Open source projects move between hosting organizations. A package published under <code class=\"language-plaintext highlighter-rouge\">com.sun.xml</code> in 2005 might need to live under <code class=\"language-plaintext highlighter-rouge\">com.oracle.xml</code> after the acquisition, except it can’t, because changing the group ID would break every project that depends on the old one. So old names persist as historical artifacts.</p>\n\n<p>The hierarchy also doesn’t prevent all squatting. Someone could register a domain specifically to claim a Maven namespace. More concerning is domain resurrection: when a domain expires after its owner has already registered a Maven group ID, anyone can buy that domain and potentially claim the namespace. Maven Central <a href=\"https://central.sonatype.org/register/namespace/\">verifies domain ownership</a> when you first register a group ID, requiring a DNS TXT record, but that verification is a point-in-time check.</p>\n\n<p>In January 2024, security firm Oversecured published <a href=\"https://blog.oversecured.com/Introducing-MavenGate-a-supply-chain-attack-method-for-Java-and-Android-applications/\">MavenGate</a>, an analysis of 33,938 domains associated with Maven group IDs. They found that 6,170 of them, roughly 18%, had expired or were available for purchase. The affected group IDs included widely-used libraries like <code class=\"language-plaintext highlighter-rouge\">co.fs2</code>, <code class=\"language-plaintext highlighter-rouge\">net.jpountz.lz4</code>, and <code class=\"language-plaintext highlighter-rouge\">com.opencsv</code>. A new owner of any of those domains could publish new versions under the existing group ID. Existing artifacts on Maven Central are immutable so old versions wouldn’t change, but build files that pull the latest version would pick up the attacker’s release.</p>\n\n<p>Sonatype responded by disabling accounts tied to expired domains and tightening their verification process, but they haven’t announced ongoing domain monitoring. PyPI, facing the same problem with account email domains, <a href=\"https://blog.pypi.org/posts/2025-08-18-preventing-domain-resurrections/\">built automated daily checks</a> in 2025 and found around 1,800 accounts to unverify.</p>\n\n<p>Clojars shows what happens when a registry in the Maven ecosystem takes a different approach. Clojure libraries are distributed as Maven artifacts, but Clojars originally let you use any group ID without verification. You could publish under <code class=\"language-plaintext highlighter-rouge\">hiccup</code> or <code class=\"language-plaintext highlighter-rouge\">ring</code> with no domain proof. This was simpler for the Clojure community, where most libraries are small and maintained by individuals, but it meant Clojars had a much more relaxed namespace than Maven Central.</p>\n\n<p>Since build tools can pull from both registries, the gap created a dependency confusion risk: an attacker could register an unverified group on Clojars that shadows a legitimate Maven Central library. In 2021, after dependency confusion attacks became widely understood, Clojars <a href=\"https://github.com/clojars/clojars-web/wiki/Verified-Group-Names\">started requiring verified group names</a> for new projects, adopting the same reverse-domain convention as Maven Central. Existing projects with unverified groups were grandfathered in, so the old flat names still exist alongside the new hierarchical ones.</p>\n\n<h3 id=\"url-based-identifiers\">URL-based identifiers</h3>\n\n<p>Go modules use import paths that are URLs: <code class=\"language-plaintext highlighter-rouge\">github.com/gorilla/mux</code>, <code class=\"language-plaintext highlighter-rouge\">golang.org/x/crypto</code>. There’s no registration step. The URL points to a repository, and the module system fetches code from there (or from the Go module proxy, which caches it).</p>\n\n<p>This model sidesteps the registry as naming authority entirely. You publish code to a repository and the URL is the identifier, with no approval step required. Name collisions don’t arise because URLs are globally unique by construction, and owning the repo means owning the name.</p>\n\n<p>Names become tied to hosting infrastructure, though. When <code class=\"language-plaintext highlighter-rouge\">github.com/user/repo</code> is the package identity, a GitHub org rename breaks every downstream consumer. Go addressed this with the module proxy, which caches modules so they survive repo disappearance, but the name still reflects the original location even if the code has moved. Import paths like <code class=\"language-plaintext highlighter-rouge\">github.com/golang/lint</code> that redirect to <code class=\"language-plaintext highlighter-rouge\">golang.org/x/lint</code> create confusion about which is canonical. And your package identity depends on a third party either way: GitHub controls the <code class=\"language-plaintext highlighter-rouge\">github.com</code> namespace, so if they ban your account or the organization renames, your package identity changes. You’ve traded one governance dependency for another, a hosting platform instead of a registry.</p>\n\n<p>“No registration step” has its own consequences. Without a registry to mediate names, there’s no obvious place to check for existing packages, no search, no download counts, no centralized vulnerability database. Go built most of these features separately with pkg.go.dev and the module proxy. The URL-based naming stayed, but the surrounding infrastructure converged toward what registries provide anyway, just assembled differently.</p>\n\n<p>Deno launched with raw URL imports and eventually built <a href=\"https://jsr.io\">JSR</a>, a scoped registry with semver resolution, because URL imports created <a href=\"https://deno.com/blog/http-imports\">problems they couldn’t solve</a> at the URL layer: duplicated dependencies when the same package was imported from slightly different URLs, version management scattered across every import statement, and reliability issues when hosts went offline. You can start without a registry, but the things registries do (search, versioning, deduplication, availability) keep needing to be solved, and solving them piecemeal tends to reconverge on something registry-shaped.</p>\n\n<h3 id=\"swift-package-manager\">Swift Package Manager</h3>\n\n<p>Apple hired Max Howell to build SwiftPM in 2015. He’d created Homebrew and used both CocoaPods and Carthage heavily, so he arrived with strong opinions about how a language package manager should work. As he told <a href=\"https://changelog.com/podcast/232\">The Changelog</a>: “I’d been involved with CocoaPods and Carthage and used them heavily, and obviously made Homebrew, so I had lots of opinions about how a package manager should be.” He was drawn to decentralization, something he wished Homebrew had from the start.</p>\n\n<p>Carthage had already demonstrated the approach in the Apple ecosystem, launching in 2014 as a deliberate reaction against CocoaPods’ centralized registry, using bare Git URLs with no registry at all. SwiftPM followed the same path, using Git repository URLs as package identifiers with no central registry.</p>\n\n<p>Go made the same choice but then spent years building infrastructure around it: a module proxy that caches source in immutable storage so deleted repos still resolve, a checksum database (<code class=\"language-plaintext highlighter-rouge\">sum.golang.org</code>) that uses a transparency log to guarantee every user gets identical content for a given version, and pkg.go.dev for search and discovery.</p>\n\n<p>SwiftPM doesn’t have any of this yet. Every <code class=\"language-plaintext highlighter-rouge\">swift package resolve</code> clones directly from the Git host. If a repo disappears, resolution fails with no fallback. SwiftPM records a fingerprint per package version the first time it downloads it, but that fingerprint lives on your machine only. There’s no global database to verify that what you downloaded matches what everyone else got, no way to detect a targeted attack serving different content to different users.</p>\n\n<p>A <a href=\"https://checkmarx.com/blog/chainjacking-the-new-supply-chain-attack/\">2022 Checkmarx study</a> found thousands of packages across Go and Swift vulnerable to repo-jacking, where an attacker registers an abandoned GitHub username and recreates a repo that existing packages still point to. Go’s proxy mitigates this because cached modules don’t re-fetch from the source, but SwiftPM has no such layer.</p>\n\n<p>The pieces to fix this are partly in place. Apple defined a <a href=\"https://github.com/swiftlang/swift-evolution/blob/main/proposals/0292-package-registry-service.md\">registry protocol</a> (SE-0292, shipped in Swift 5.7) and built client support for it in SwiftPM, including package signing. The client tooling is ready, the protocol is specified, and the ecosystem is still small enough that introducing a namespace layer wouldn’t require the kind of painful migration that npm or PyPI face. The <a href=\"https://swiftpackageindex.com\">Swift Package Index</a>, community-run and Apple-sponsored, already tracks around 12,000 packages. What’s missing is the public registry service itself and the integrity infrastructure around it, and the window for adding these before the ecosystem’s size makes it much harder is not open forever.</p>\n\n<h3 id=\"the-migration-problem\">The migration problem</h3>\n\n<p>As I wrote about in <a href=\"/2026/01/23/package-management-is-a-wicked-problem.html\">Package Management is a Wicked Problem</a>, once PyPI accepted namespace-less package names, that was permanent. If PyPI added mandatory namespaces tomorrow, every existing <code class=\"language-plaintext highlighter-rouge\">requirements.txt</code>, every tutorial, every CI script would need updating. The new system would have to support both namespaced and un-namespaced packages indefinitely. You haven’t replaced the flat namespace, you’ve just added a layer on top of it.</p>\n\n<p>npm’s experience shows what this looks like in practice. Scoped packages have been available since 2014, but most of the ecosystem still uses flat names. The existence of scopes didn’t make <code class=\"language-plaintext highlighter-rouge\">express</code> become <code class=\"language-plaintext highlighter-rouge\">@expressjs/express</code> because too much already depends on the existing name. Scopes ended up being used primarily for new packages and organizational groups rather than as a migration path for the existing namespace.</p>\n\n<p>NuGet went through a partial migration. It added package ID prefix reservation in 2017, letting Microsoft reserve the <code class=\"language-plaintext highlighter-rouge\">Microsoft.*</code> prefix. But this is a bolt-on: the underlying namespace is still flat, and the prefixes are just a verified badge on the registry UI. It helps users identify official packages but doesn’t change the naming model.</p>\n\n<p>PyPI is threading this needle right now with <a href=\"https://peps.python.org/pep-0752/\">PEP 752</a>, which proposes letting organizations reserve package name prefixes. Google could reserve <code class=\"language-plaintext highlighter-rouge\">google-cloud-</code>, Apache could reserve <code class=\"language-plaintext highlighter-rouge\">apache-airflow-providers-</code>, and future uploads matching those prefixes would require authorization from the namespace owner. Like NuGet’s approach, it requires no installer changes and leaves existing packages unaffected. It only applies going forward, though, and the thousands of existing packages with no organizational prefix remain as they are.</p>\n\n<p>Cargo and crates.io are attempting something more ambitious. The Rust community has been discussing namespaces since at least 2014, and after several earlier proposals that leaned toward npm-style user or org scopes, they settled on <a href=\"https://rust-lang.github.io/rfcs/3243-packages-as-optional-namespaces.html\">RFC 3243</a> (“Packages as Optional Namespaces”), authored by Manish Goregaokar, who had been working on the problem since at least 2018 when the first “packages as namespaces” pre-RFC appeared.</p>\n\n<p>The approach treats existing crate names as potential namespace roots: if you own the <code class=\"language-plaintext highlighter-rouge\">serde</code> crate, you can publish <code class=\"language-plaintext highlighter-rouge\">serde::derive</code>, and only owners of <code class=\"language-plaintext highlighter-rouge\">serde</code> can create crates in that namespace. Ownership flows down automatically. The <code class=\"language-plaintext highlighter-rouge\">::</code> separator was chosen after extensive debate because it aligns with Rust’s existing path syntax, so <code class=\"language-plaintext highlighter-rouge\">serde::derive::Deserialize</code> reads naturally in Rust source. An earlier proposal used <code class=\"language-plaintext highlighter-rouge\">/</code> but that conflicted with Cargo’s feature syntax.</p>\n\n<p>The design is carefully scoped. Namespaces are optional, so the flat namespace stays and nothing breaks. It’s framed around projects rather than organizations, with the primary use cases being things like <code class=\"language-plaintext highlighter-rouge\">serde::derive</code> or <code class=\"language-plaintext highlighter-rouge\">tokio::macros</code> rather than org-level grouping. Only single-level nesting is supported for now. And they explicitly chose not to do NuGet-style prefix reservation because in a flat namespace where <code class=\"language-plaintext highlighter-rouge\">serde-derive</code> already exists, reserving the <code class=\"language-plaintext highlighter-rouge\">serde-</code> prefix would create confusion about whether existing <code class=\"language-plaintext highlighter-rouge\">serde-*</code> crates are actually owned by <code class=\"language-plaintext highlighter-rouge\">serde</code>.</p>\n\n<p>The migration challenges are real even with this careful design. A crate like <code class=\"language-plaintext highlighter-rouge\">tokio-macros</code> already exists in the flat namespace, and transitioning it to <code class=\"language-plaintext highlighter-rouge\">tokio::macros</code> means a new name that every downstream consumer would need to update. The RFC suggests maintaining re-export crates during transition, but there’s no alias mechanism yet. Some projects face an even harder version of this problem: the <code class=\"language-plaintext highlighter-rouge\">async-std</code> project manages a family of <code class=\"language-plaintext highlighter-rouge\">async-*</code> crates, but someone else owns the <code class=\"language-plaintext highlighter-rouge\">async</code> crate, so they can’t use it as their namespace root.</p>\n\n<p>The RFC was accepted and became an official Rust project goal for 2025, led by Ed Page on the Cargo team. As of late 2025, Cargo support is partially implemented but compiler support is still in progress, requiring coordination across the lang, compiler, and crates.io teams. It’s the most carefully designed attempt at retrofitting namespaces onto a flat registry that I’m aware of, and the fact that it’s taking years of design and implementation work for a well-resourced community with strong governance shows how hard this problem is once a flat namespace is established.</p>\n\n<p>If you’re starting a registry today, you don’t have to require namespaces from day one, but you could reserve the separator character and the ownership semantics so that namespaces can be added later without conflicting with existing names. The reason crates.io can use <code class=\"language-plaintext highlighter-rouge\">::</code> is that no existing crate name contains it. If they’d allowed colons in crate names from the start, this whole approach would have been foreclosed. Keeping your options open costs almost nothing at launch and can save years of design work later.</p>",
    "description": "Comparing namespace models across npm, Maven, Go, Swift, and crates.io.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-14T00:00:00+00:00",
    "fetched_at": "2026-02-14T12:14:56.476361",
    "url_hash": "a9f2043b6b1f5ce9c64771476ed56d17"
  },
  {
    "title": "How the hell are you supposed to have a career in tech in 2026?",
    "link": "https://anildash.com/2026/01/05/a-tech-career-in-2026/",
    "content": "\n        \n      <p>The number one question I get from my friends, acquaintances, and mentees in the technology industry these days is, by far, variations on the basic theme of, “what the hell are we supposed to do now?”</p>\n<p>There have been mass layoffs that leave more tech workers than ever looking for new roles in the worst market we’ve ever seen. Many of the most talented, thoughtful and experienced people in the industry are feeling worried, confused, and ungrounded in a field that no longer looks familiar.</p>\n<p>If you’re outside the industry, you may be confused — isn’t there an AI boom that’s getting hundreds of billions of dollars in investments? Doesn’t that mean the tech bros are doing great? What you may have missed is that half a million tech workers have been laid off in the years since ChatGPT was released; the same attacks on marginalized workers and DEI and “woke” that the tech robber barons launched against the rest of society were aimed at their own companies first.</p>\n<p>So the good people who actually <em>make</em> the technology we use every day, the real innovators and creators and designers, are reacting to the unprecedented disconnect between the contemporary tech industry and the fundamentals that drew so many people toward it in the first place. Many of the biggest companies have abandoned the basic principle of making technology that actually <em>works</em>. So many new products fail to deliver on even the basic capabilities that the companies are promising that they will provide.</p>\n<p>Many leaders at these companies have run full speed towards moral and social cowardice, abandoning their employees and customers to embrace rank hatred and discrimination in ways that they pretended to be fighting against just a few years ago. Meanwhile, unchecked consolidation has left markets wildly uncompetitive, leaving consumers suffering from the effects of categories without any competition or investment — which we know now as “enshittification”. And the full-scale shift into corruption and crony capitalism means that winners in business are decided by whoever is shameless enough to offer the biggest bribes and debase themselves with the <a href=\"https://www.anildash.com/2025/09/09/how-tim-cook-sold-out-steve-jobs/\">most humiliating display</a> of groveling. It’s a depressing shift for people who, earlier in their careers, often actually <em>were</em> part of inventing the future.</p>\n<p>So where do we go from here?</p>\n<h2>You’re not crazy.</h2>\n<p>The first, and most important, thing to know is that <em>it’s not just you</em>. Nearly everyone in tech I have this conversation with feels very isolated about it, and they’re often embarrassed or ashamed to discuss it. They think that everyone else who has a job in tech is happy or comfortable at their current employers, or that the other people looking for work are getting calls back or are being offered interviews in response to their job applications. But I’m here to tell you: it is grim right now. About as bad as I’ve seen. And I’ve been around a long time.</p>\n<p>Every major tech company has watched their leadership abandon principles that were once thought sacrosanct. I’ve heard more people talk about losing respect for executives they trusted, respected, even <em>admired</em> in the last year than at any time I can remember. In smaller companies and other types of organizations, the challenges have been more about the hard choices that come from dire resource constraints or being forced to make ugly ethical compromises for pragmatic reasons. The net result is tons of people who have lost pride and conviction in their work. They’re going through the motions for a paycheck, because they know it’s a tough job market out there, which is a miserable state of affairs.</p>\n<p>The public narrative is dominated by the loud minority of dudes who are content to appease the egos of their bosses, sucking up to the worse impulses of those in charge. An industry that used to pride itself on publicly reporting security issues and openly disclosing vulnerabilities now circles its wagons to gang up on people who suggest that an AI tool shouldn’t tell children to harm themselves, that perhaps it should be possible to write a law limiting schools from deploying AI platforms that are known to tell kids to end their own lives. People in tech endure their bosses using slurs at work, making jokes about sexual assault, consorting with leaders who have directly planned the murder of journalists, engaging in open bribery in blatant violation of federal law and their own corporate training on corruption, and have to act like it’s normal.</p>\n<p>But it’s not the end of the world. The forces of evil have not yet triumphed, and all hope is not lost. There are still things we can do.</p>\n<h2>Taking back control</h2>\n<p>It can be easy to feel overwhelmed at such an unprecedented time in the industry, especially when there’s so much change happening. But there are concrete actions you can take to have agency over your own career, and to insulate yourself from the bad actors and maximize your own opportunities — even if some of those bad actors are your own bosses.</p>\n<h3>Understanding systems</h3>\n<p>One of the most important things you can do is to be clear about your own place, and your own role, within the systems that you are part of. A major factor in the changes that bosses are trying to effect with the deployment of AI is shifting the role of workers within the systems in their organization to make them more replaceable.</p>\n<p>If you’re a coder, and you think your job is to make really good code in a particular programming language, you might double down on getting better at the details of that language. But that’s almost certainly misunderstanding the system that your company thinks you’re part of, where the code is just a means to the end of creating a final product. In that system-centric view, the programming language, and indeed all of the code itself, doesn’t really matter; the person who is productive at causing all of that code to be created reliably and efficiently is the person who is going to be valued, or at least who is most likely to be kept around. That may not be satisfying or reassuring if you truly love coding, but at least this perspective can help you make informed decisions about whether or not that organization is going to make choices that respect the things you value.</p>\n<p>This same way of understanding systems can apply if you’re a designer or a product manager or a HR administrator or anything else. As I’ve covered before, <a href= \"https://anildash.com/2024/05/28/systems-the-purpose-of-a-system/\">the purpose of a system is what it does</a>, and that truth can provide some hard lessons if we find it’s in tension with the things we <em>want</em> to be doing for an organization. The system may not value the things we do, or it may not value them enough; the way they phrase this to avoid having to say it directly is by describing something as “inefficient”. Then, the question you have to ask yourself is, can you care about this kind of work or this kind of program at one level higher up in the system? Can it still be meaningful to you if it’s slightly more abstract? Because that may be the requirement for navigating the expectations that technology organizations will be foisting on everyone through the language of talking about “adopting AI”.</p>\n<h3>Understanding power</h3>\n<p>Just as important as understanding systems is understanding <em>power</em>. In the workplace, power is something real. It means being able to control how money is spent. It means being able to make decisions. It means being able to hire people, or fire them. Power is being able to say no.</p>\n<p>You probably don’t have enough power; that’s why you have worries. But you almost certainly have more power than you think, it’s just not as obvious how to wield it. The most essential thing to understand is that you will need to collaborate with your peers to exercise collective power for many of the most significant things you may wish to achieve.</p>\n<p>But even at an individual level, a key way of understanding power in your workplace is to consider the systems that you are part of, and then to reckon with which ones you can meaningfully change from your current position. Very often, people will, in a moment of frustration, say “this place couldn’t run without me!” And companies will almost always go out of their way to prove someone wrong if they hear that message.</p>\n<p>On the other hand, if you identify a system for operating the organization that no one else has envisioned, you’ve already <em>demonstrated</em> that this part of the organization couldn’t run without you, and you don’t need to say it or prove it. There is power in the mere action of creating that system. But a lot depends on where you have both the positional authority and the social permission to actually accomplish that kind of thing.</p>\n<p>So, if you’re dissatisfied with where you are, but have not decided to leave your current organization, then your first orders of business in this new year should be to consolidate power through building alliances with peers, and by understanding which fundamental systems of your organization you can define or influence, and thus be in control of. Once you’ve got power, you’ve got options.</p>\n<h3>Most tech isn’t “tech”</h3>\n<p>So far, we’re talking about very abstract stuff. What do we do if your job sucks right now, or if you don’t have a job today and you really need one? After vague things like systems and power, then what?</p>\n<p>Well, an important thing to understand, if you care about innovation and technology, is that the vast majority of technology doesn’t happen in the startup world, or even in the “tech industry”. Startups are only a tiny fraction of the entire realm of companies that create or use technology, and the giant tech companies are only a small percentage of all jobs or hiring within the tech realm.</p>\n<p>So much opportunity, inspiration, creativity, and possibility lies in applying the skills and experience that you may have from technological disciplines in other realms and industries that are often far less advanced in their deployment of technologies. In a lot of cases, these other businesses get taken advantage of for their lack of experience — and in the non-profit world, the lack of tech expertise or fluency is often exploited by both the technology vendors and bad actors who swoop in to capitalize on their vulnerability.</p>\n<p>Many of the people I talk to who bring their technology experience to other fields also tell me that the culture in more traditional industries is often less toxic or broken than things in Silicon Valley (or Silicon Valley-based) companies are these days, since older or more established companies have had time to work out the more extreme aspects of their culture. It’s an extraordinary moment in history when people who work on Wall Street tell me that even <em>their</em> HR departments wouldn’t put up with the kind of bad behavior that we’re seeing within the ranks of tech company execs.</p>\n<h3>Plan for the long term</h3>\n<p>This too shall pass. One of the great gifts of working in technology is that it’s given so many of us the habit of constantly learning, of always being curious and paying attention to the new things worth discovering. That healthy and open-minded spirit is an important part of how to navigate a moment when lots of people are being laid off, or lots of energy and attention are being focused on products and initiatives that don’t have a lot of substance behind them.\nEventually, people will want to return to what’s real. The companies that focus on delivering products with meaning, and taking care of employees over time, will be the ones that are able to persist past the current moment. So building habits that enable resiliency at both a personal and professional level is going to be key.</p>\n<p>As I’ve been fond of saying for a long time: don’t let your job get in the way of your career.</p>\n<p>Build habits and routines that serve your own professional goals. As much as you can, participate in the things that get your name out into your professional community, whether that’s in-person events in your town, or writing on a regular basis about your area of expertise, or mentoring with those who are new to your field. You’ll never regret building relationships with people, or being generous with your knowledge in ways that remind others that you’re great at what you do.</p>\n<p>If your time and budget permit, attend events in person or online where you can learn from others or respond to the ideas that others are sharing. The more people can see and remember that you’re engaged with the conversations about your discipline, the greater the likelihood that they’ll reach out when the next opportunity arises.</p>\n<p>Similarly, take every chance you can to be generous to others when you see a door open that might be valuable for them. I can promise you, people will <em>never</em> forget that you thought of them in their time of need, even if they don’t end up getting that role or nabbing that interview.</p>\n<h2>It’s an evolution, not a resolution</h2>\n<p>New years are often a time when people make a promise to themselves about how they’re going to change everything. If I can just get this new notebook to write in, I’m suddenly going to become a person who keeps a journal, and that will make me a person who’s on top of everything all the time.</p>\n<p>But hopefully you can see, many of the challenges that so many people are facing are systemic, and aren’t the result of any personal failings or shortcomings. So there isn’t some heroic individual change that you can make when you flip over to a new calendar month that will suddenly fix all the things.</p>\n<p>What you can control, though, are small iterative things that make you feel better on a human scale, in little ways, when you can. You can help yourself maintain perspective, and you can do the same for those around you who share your values, and who care about the same personal or professional goals that you do.</p>\n<p>A lot of us still care about things like the potential for technology to help people, or still believe in the idealistic and positive goals that got us into our careers in the first place. We weren’t wrong, or naive, or foolish to aspire to those goals simply because some bad actors sought to undermine them. And it’s okay to feel frustrated or scared in a time when it seems to many like those goals could be further away than they’ve been in a long time.</p>\n<p>I do hope, though, that people can see that, by sticking together, and focusing on the things that are within our reach, things can begin to change. All it takes is remembering that the power in tech truly rests with all the people who actually <em>make</em> things, not with the loudmouths at the top who try to tear things down.</p>\n\n    \n      ",
    "description": "",
    "is_fulltext": true,
    "source": "Anil Dash",
    "pub_date": "2026-01-05T00:00:00Z",
    "fetched_at": "2026-02-14T12:15:27.666851",
    "url_hash": "bdb53333eb4a60b04917f6195969af0f"
  }
]