[
  {
    "title": "Kākāpō mug by Karen James",
    "link": "https://simonwillison.net/2026/Feb/8/kakapo-mug/#atom-everything",
    "content": "\n    <p>Friend and neighbour <a href=\"https://www.etsy.com/shop/KarenJamesMakes\">Karen James</a> made me a Kākāpō mug. It has a charismatic Kākāpō, four Kākāpō chicks (in celebration of the <a href=\"https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/#1-year-k-k-p-parrots-will-have-an-outstanding-breeding-season\">2026 breeding season</a>) and even has some <a href=\"https://www.theguardian.com/world/2026/jan/13/nz-kakapo-mating-season\">rimu fruit</a>!</p>\n<p><img src=\"https://static.simonwillison.net/static/2026/kakapo-mug-1.jpg\" alt=\"A simply spectacular sgraffito ceramic mug with a bold, charismatic Kākāpō parrot taking up most of the visible space. It has a yellow beard and green feathers.\" style=\"max-width: 100%;\" /></p>\n<p><img src=\"https://static.simonwillison.net/static/2026/kakapo-mug-2.jpg\" alt=\"Another side of the mug, two cute grey Kākāpō chicks are visible and three red rimu fruit that look like berries, one on the floor and two hanging from wiry branches.\" style=\"max-width: 100%;\" /></p>\n<p>I love it so much.</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/kakapo\">kakapo</a>, <a href=\"https://simonwillison.net/tags/art\">art</a></p>\n\n\n\n",
    "description": "Friend and neighbour Karen James made me a Kākāpō mug. It has a charismatic Kākāpō, four Kākāpō chicks (in celebration of the 2026 breeding season) and even has some rimu fruit! I love it so much. Tags: kakapo, art",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-08T17:25:07+00:00",
    "fetched_at": "2026-02-09T00:39:18.143761",
    "url_hash": "a4f030482ab4a680278eb5425471df48"
  },
  {
    "title": "Book Review: Me vs Brain - An Overthinker’s Guide to Life by Hayley Morris ★★★★☆",
    "link": "https://shkspr.mobi/blog/2026/02/book-review-me-vs-brain-an-overthinkers-guide-to-life-by-hayley-morris/",
    "content": "<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/03/9781804940327-jacket-large.webp\" alt=\"Book cover.\" width=\"200\" class=\"alignleft size-full wp-image-66658\">\n\n<p>I bought this book for the title alone and I'm glad I did! I don't think I've seen any of Hayley Morris's comedy sketches. To be honest, you don't need to be a fan of her work to appreciate the humour and courage in this book. It could quite easily have been a cash-in celebrity autobiography - light on the details and full of charming anecdotes - and I'm sure her fans would have snapped it up.</p>\n\n<p>Instead it is a darkly funny meditation on intrusive thoughts, panic, and acceptance.</p>\n\n<p>Her prose is exceptionally good - I loved the way she described doing the washing up as \"giving a dinner plate a little bubble bath\" - it's also extremely relatable. Everyone occasionally thinks \"what if I just ran away?\" or \"what would happen if I dropped this glass?\" For most people it is just a passing moment; but for Hayley it is something more intense.</p>\n\n<p>All of this is smuggled to the reader hidden within poop jokes, tales of teenage awkwardness, and millennial angst. It is consistently funny which makes the sudden switch to pathos all the more effective. It morphs into a tender tale of loss, loneliness, and something else beginning with L which will make me sound erudite.</p>\n\n<p>I wouldn't describe it quite as a \"self-help\" book, but I think that's clearly part of the intention. Lots of people need to know that their (parasocial) friends find therapy useful. Having someone influential describe the journey to better mental health in such a relatable way will undoubtedly help others.</p>\n",
    "description": "I bought this book for the title alone and I&#039;m glad I did! I don&#039;t think I&#039;ve seen any of Hayley Morris&#039;s comedy sketches. To be honest, you don&#039;t need to be a fan of her work to appreciate the humour and courage in this book. It could quite easily have been a cash-in celebrity autobiography - light on the details and full of charming anecdotes - and I&#039;m sure her fans would have snapped it up. …",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Sun, 08 Feb 2026 12:34:02 +0000",
    "fetched_at": "2026-02-09T00:39:27.011940",
    "url_hash": "efe7124cbf84c6ffcf1984b80a55dc03"
  },
  {
    "title": "Computing large Fibonacci numbers",
    "link": "https://www.johndcook.com/blog/2026/02/08/computing-large-fibonacci-numbers/",
    "content": "<p>The previous post discussed two ways to compute the <em>n</em>th Fibonacci number. The first is to compute all the Fibonacci numbers up to the <em>n</em>th iteratively using the defining property of Fibonacci numbers</p>\n<p style=\"padding-left: 40px;\"><em>F</em><sub><em>n</em> + 2</sub> = <em>F</em><sub><em>n</em></sub> + <em>F</em><sub><em>n</em> + 1</sub></p>\n<p>with extended integer arithmetic.</p>\n<p>The second approach is to use Binet&#8217;s formula</p>\n<p style=\"padding-left: 40px;\"><em>F</em><sub><em>n</em></sub> = round( φ<sup><em>n</em></sup> / √ 5 )</p>\n<p>where φ is the golden ratio.</p>\n<p>It&#8217;s not clear which approach is more efficient. You could say that the iterative approach has run time <em>O</em>(<em>n</em>) while Binet&#8217;s formula is <em>O</em>(1). That doesn&#8217;t take into account how much work goes into each step, but it does suggest that eventually Binet wins.</p>\n<p>The relative efficiency of each algorithm depends on how it is implemented. In this post I will compare using Python&#8217;s integer arithmetic and the <code>mpmath</code> library for floating point. Here&#8217;s my code for both methods.</p>\n<pre>from math import log10\nimport mpmath as mp\n\ndef fib_iterate(n):\n    a, b = 0, 1\n    for _ in range(n):\n        a, b = b, a + b\n    return a\n\ndef digits_needed(n):\n\n    phi = (1 + 5**0.5) / 2\n    return int(n*log10(phi) - 0.5*log10(5)) + 1\n\ndef fib_mpmath(n, guard_digits=30):\n\n    digits = digits_needed(n)\n\n    # Set decimal digits of precision\n    mp.mp.dps = digits + guard_digits\n\n    sqrt5 = mp.sqrt(5)\n    phi = (1 + sqrt5) / 2\n    x = (phi ** n) / sqrt5\n\n    return int(mp.nint(x))\n</pre>\n<p>Next, here&#8217;s some code to compare the run times.</p>\n<pre>def compare(n):\n    \n    start = time.perf_counter()\n    x = fib_iterate(n)\n    elapsed = time.perf_counter() - start\n    print(elapsed)\n\n    start = time.perf_counter()\n    y = fib_mpmath(n)\n    elapsed = time.perf_counter() - start\n    print(elapsed)\n\n    if (x != y):\n        print(\"Methods produced different results.\")\n</pre>\n<p>This code shows that the iterate approach is faster for <em>n</em> = 1,000 but Binet&#8217;s method is faster for <em>n</em> = 10,000.</p>\n<pre>&gt;&gt;&gt; compare(1_000)\n0.0002502090001144097\n0.0009207079999669077\n&gt;&gt;&gt; compare(10_000)\n0.0036547919999065925\n0.002145750000181579\n</pre>\n<p>For larger <em>n</em>, the efficiency advantage of Binet&#8217;s formula becomes more apparent.</p>\n<pre>\n&gt;&gt;&gt; compare(1_000_000)\n11.169050417000108\n2.0719056249999994\n</pre>\n<h2>Guard digits and correctness</h2>\n<p>There is one unsettling problem with the function <code>fib_mpmath</code> above: how many guard digits do you need? To compute a number correctly to 100 significant figures, for example, requires more than 100 digits of working precision. How many more? It depends on the calculation. What about our calculation? </p>\n<p>If we compute the 10,000th Fibonacci number using <code>fib_mpmath(10_000, 2)</code>, i.e. with 2 guard digits, we get a result that is incorrect in the last digit. To compute the 1,000,000th Fibonacci number correctly, we need 5 guard digits.</p>\n<p>We don&#8217;t need many guard digits, but we&#8217;re guessing at how many we need. How might we test whether we&#8217;ve guessed correctly? One way would be to compute the result using <code>fib_iterate</code> and compare results, but that defeats the purpose of using the more efficient <code>fib_mpmath</code>. </p>\n<p>If floating point calculations produce an incorrect result, the error is likely to be in the least significant digits. If we knew that the last digit was correct, that would give us more confidence that all the digits are correct. More generally, we could test the result mod <em>m</em>. I discussed Fibonacci numbers mod <em>m</em> in <a href=\"https://www.johndcook.com/blog/2017/11/24/distribution-of-fibonacci-numbers-mod-m/\">this post</a>. </p>\n<p>When <em>m</em> = 10, the last digits of the Fibonacci numbers have a cycle of 60. So the Fibonacci numbers with index <em>n</em> and with index <em>n</em> mod 60 should be the same.</p>\n<p>The post I just mentioned links to a paper by Niederreiter that says the Fibonacci numbers ore evenly distributed mod <em>m</em> if and only if <em>m</em> is a power of 5, in which case the cycle length is 4<em>m</em>.</p>\n<p>The following code could be used as a sanity check on the result of <code>fig_mpmath</code>.</p>\n<pre>\ndef mod_check(n, Fn):\n    k = 3\n    base = 5**k\n    period = 4*base\n    return Fn % base == fib_iterate(n % period) % base\n</pre>\n<p>With <em>k</em> = 3, we are checking the result of our calculation mod 125. It is unlikely that an incorrect result would be correct mod 125. It&#8217;s hard to say just how unlikely. Naively we could say there&#8217;s 1 chance in 125, but that ignores the fact that the errors are most likely in the least significant bits. The chances of an incorrect result being correct mod 125 would be much less than 1 in 125. For more assurance you could use a larger power of 5.</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/08/computing-large-fibonacci-numbers/\">Computing large Fibonacci numbers</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "The previous post discussed two ways to compute the nth Fibonacci number. The first is to compute all the Fibonacci numbers up to the nth iteratively using the defining property of Fibonacci numbers Fn + 2 = Fn + Fn + 1 with extended integer arithmetic. The second approach is to use Binet&#8217;s formula Fn = [&#8230;] The post Computing large Fibonacci numbers first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Sun, 08 Feb 2026 13:51:25 +0000",
    "fetched_at": "2026-02-09T00:39:44.757567",
    "url_hash": "1e2664ee3ab1a7a6f9964a1380207d69"
  },
  {
    "title": "start-vibe-coding-fast",
    "link": "https://chadnauseam.com/coding/tips/start-vibe-coding-fast",
    "content": "",
    "description": "",
    "is_fulltext": false,
    "source": "Chad Nauseam Home",
    "pub_date": "",
    "fetched_at": "2026-02-09T00:40:09.138210",
    "url_hash": "3b8dbb24ae6384e673f225b239a8d59c"
  },
  {
    "title": "How to generate good looking reports with Claude Code, Cowork or Codex",
    "link": "https://martinalderson.com/posts/how-to-make-great-looking-consistent-reports-with-claude-code-cowork-codex/?utm_source=rss",
    "content": "A step-by-step guide to extracting your brand design system and generating on-brand PDF reports and slide decks using coding agents.",
    "description": "A step-by-step guide to extracting your brand design system and generating on-brand PDF reports and slide decks using coding agents.",
    "is_fulltext": false,
    "source": "Martin Alderson",
    "pub_date": "Sun, 08 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-09T00:40:17.693182",
    "url_hash": "e9f32909ff5db2ecb71837e928b06fb8"
  },
  {
    "title": "Every Man a Microservice",
    "link": "https://grantslatton.com/every-man-a-microservice",
    "content": "<h1>Every Man a Microservice</h1>\n<blockquote>\n<p>Organizations which design systems are constrained to produce designs which are copies of the communication structures of these organizations.</p>\n<p>— Melvin E. Conway, How Do Committees Invent?</p>\n</blockquote>\n<p>Conway's law appears true if you observe organizations and systems as they are, <strong>but the causality is reversed</strong>.</p>\n<p>Systems are not <em>conceived</em> by organizations, but by a single individual or a tight-knit cabal.</p>\n<p>As such, there is no communication structure to emulate. The initial idea is conjured as a gestalt and an organization <em>is built around</em> the system as it comes into existence and operates.</p>\n<p><strong>And thus we invert Conway's law</strong>: A system's design informs the communication structure of the organization that is built around it.</p>\n<p>With this in mind, we can ask: what design facilitates the most effective organization?</p>\n<p>There's a whole landscape of solutions here, but I just want to focus on one that I saw work <em>extremely</em> well in the earlier years of AWS.</p>\n<h3>The right way</h3>\n<p>The idea is your system is made up of person-sized services. A person-sized service is one whose codebase is in the realm of a few tens of thousands of lines of code.</p>\n<p>This scale is such that a single developer, working on that codebase full-time, can keep the whole codebase in their head.</p>\n<p><em>N.B. By \"codebase in head\" I don't mean they literally know every line of code. I mean they have a complete picture of all the modules, interfaces, data structures, scaling dimensions, tradeoffs, design decisions, etc.</em></p>\n<p>You want there to be a 1-to-1 mapping between each service and an individual who has that service's code completely loaded into their brain.</p>\n<p>The advantages of having the whole service loaded into an individual brain is hard to overstate.</p>\n<p><strong>It enables a ton of offline mulling</strong>. Your devs know their domain so well, they'll have regular shower-thoughts about how to optimize their service.</p>\n<p><strong>You reach consensus on improvements faster</strong>. Alice has an idea in a shower. She wants Bob's system to start batching requests to hers to improve her cache hit ratio. She tells Bob the idea in the morning. Bob calls over Charlie, whose service would also be affected. In 20 minutes they agree on a path forward. The code is shipped after lunch.</p>\n<p><strong>You actually have fewer outages and issues</strong>. You might think an organization that designs features in 20 minutes and ships them after lunch is going to break things by moving so fast. But in practice, a single engineer with 100% context will anticipate and design around issues better than a design review by a whole team of devs who each have 50% context.</p>\n<p><strong>Quality goes up</strong>. Each owner has a narrative for the health of their codebase: aspirations for future improvements, haunted by lingering jank. They take this holistic view into account when considering all ideas. They have the familiarity needed to do deep, refactoring integrations, but also to safely add hacks when the business needs it.</p>\n<p><strong>Architectural changes are politically manageable</strong>. It's much easier for technical management (i.e. principal engineers) to rearchitect the system, because individual devs have essentially no political power or desire for such. They won't defend their service if it becomes vestigial as long as you give them something else to own.</p>\n<p><strong>Engineers develop faster</strong>. Take a college-hire and give them one of the smaller services. Tell them \"this service is yours, and you are this service, you are one\". This is a sink-or-swim tactic, but a good one. Engineers that can't take individual ownership are toxic to the long-term health of the org. Those that can have a much higher likelihood of evolving into high-value <a href=\"https://blog.sbensu.com/posts/lieutenants/\">lieutenants</a>.</p>\n<h3>The wrong way</h3>\n<p>If you've worked at a traditional company, you've probably seen the inverse of all this. Services aren't owned by individuals, but by whole teams. A team of 8 people might own 3 services. Everyone is kind of vaguely familiar with all of them, but nobody is a master of any one.</p>\n<p>Because nobody is a master, people will tend to implement changes in a purely accretive way. They're afraid to do deeper refactors to integrate changes more holistically.</p>\n<p>And for good reason! When they attempt such deeper refactors without a complete understanding of the service they're operating on, they're stumbling in the dark and cause outages. They do design reviews with the team to try to mitigate this, but nobody knows enough to contribute more than surface-level concerns.</p>\n<p>Managers in charge of teams will resist deprecation of the services their team owns. Not only will they do this, but they will actually invent new services that don't need to exist to justify increasing their headcount (which increases their status).</p>\n<h3>Risks</h3>\n<p><strong>What happens when the owner of a system gets hit by a bus?</strong> Or, less dramatically, leaves the company.</p>\n<p>In practice, engineers in such an org don't <em>only</em> have context on their single service. They'll typically have a decent amount of context on the services theirs touches, and vice versa. After all, who is doing code reviews for whom?</p>\n<p>Most of the devs who've been around for a while will have owned a few different services at different points in their career. When they joined as a college-hire, they were given a tiny metadata caching service. Then someone left and they were given that guy's medium-sized service. Then they had an idea for a brand new system, built it, and now own it as a senior engineer.</p>\n<p>The effect is a senior engineer in the org will have somewhat-stale but easily-refreshable context on a handful of services. It's like riding a bike. This is useful both for bus-factor situations, and also mentoring the juniors who own those services.</p>\n<p>So in a bus-factor situation, there are usually enough seniors around who can keep the lights on until a new owner is found. And in this kind of org, you'll always have a cohort of bright up-and-coming juniors who passed the sink-or-swim test and are ready to take ownership of a bigger service.</p>\n<p><strong>How to manage such an org?</strong> That is, what is the place for managers in this brave world?</p>\n<p>Such a system only needs a few managers, because it won't have <em>that</em> many engineers. It won't have that many engineers because there simply don't exist very many systems that <em>need</em> that many services.</p>\n<p>For context, <a href=\"https://en.wikipedia.org/wiki/Amazon_S3\">AWS S3</a> was built and operated by fewer than 20 engineers in the early years. And if you were to design a storage service on a whiteboard, you might find yourself with 20 or so boxes. There's the storage node, the webserver, the caching layer, the index, the corruption scanner, etc etc etc. It all adds up. Almost no system needs more than a few dozen boxes on the whiteboard.</p>\n<p>In such a world, you only need a handful of managers, and you definitely don't need many layers of management. You want the person in charge of the whole org, a small handful of managers, and then all the engineers.</p>\n<p>The person in charge of the whole org should rely on senior technical <a href=\"https://blog.sbensu.com/posts/lieutenants/\">lieutenants</a> as much as (and perhaps more than) management to maintain visibility.</p>\n",
    "description": "Contra Conway",
    "is_fulltext": true,
    "source": "Grant Slatton's Blog",
    "pub_date": "Sun, 8 Feb 2026 17:54:20 +0000",
    "fetched_at": "2026-02-09T00:40:19.602094",
    "url_hash": "ed0d2efe187e167c7f5600c8dbc1654f"
  },
  {
    "title": "forecourt networking",
    "link": "https://computer.rip/2026-02-08-forecourt-networking.html",
    "content": "  <p>The way I see it, few parts of American life are as quintessentially American\nas buying gas. We love our cars, we love our oil, and an industry about as old\nas automobiles themselves has developed a highly consistent, fully automated,\nand fairly user friendly system for filling the former with the latter.</p>\n<p>I grew up in Oregon. While these rules have since been relaxed, many know\nOregon for its long identity as one of two states where you cannot pump\nyour own gas (the other being New Jersey). Instead, an attendant, employee\nof the gas station, operates the equipment. Like Portland's lingering <em>indoor</em>\ngas station, Oregon's favor for &quot;full-service&quot; is a holdover. It makes sense,\nof course, that all gas stations used to be full-service.</p>\n<p>The front part of a gas station, where the pumps are and where you pull up your\ncar, is called the <em>Forecourt.</em> The practicalities of selling gasoline, namely\nthat it is a liquid sold by volume, make the forecourt more complex than you\nmight realize. It's a set of devices that many of us interact with on a regular\nbasis, but we rarely think about the sheer number of moving parts and\nlong-running need for digital communications. Hey, that latter part sounds\ninteresting, doesn't it?</p>\n<p>Electric vehicles are catching on in the US. My personal taste in vehicles\ntends towards &quot;old&quot; and &quot;cheap,&quot; but EVs have been on the market for long\nenough that they now come in that variety. Since my daily driver is an EV,\nI don't pay my dues at the Circle K nearly as often as I used to. One\nof the odd little details of EVs is the complexity hidden in the charging\nsystem or &quot;EVSE,&quot; which requires digital communications with the vehicle\nfor protection reasons. As consumers across the country install EVSE in\ntheir garages, we're all getting more familiar with these devices and their\nprice tags. We might forget that, well, handling a fluid takes a lot of\nequipment as well... we just don't think about it, having shifted the whole\nproblem to a large industry of loosely supervised hazardous chemical\nhandling facilities.</p>\n<p>Well, I don't mean to turn this into yet another discussion of the significant\nenvironmental hazard posed by leaking underground storage tanks. Instead, we're\ngoing to talk about forecourt technology. Let's start, then, with a rough,\nsketchy history of the forecourt.</p>\n<p><img src=\"https://computer.rip/f/gas/1.png\" alt=\"Illustration from Triangle MicroSystems manual\" /></p>\n<p>The earliest volumetric fuel dispensers used an elevated glass tank where\nfuel was staged and measured before gravity drained it through the hose\ninto the vehicle tank. Operation of these pumps was very manual, with an\nattendant filling the calibrated cylinder with the desired amount of gas,\nemptying it into the vehicle, and then collecting an appropriate sum of money.\nAs an upside, the customer could be quite confident of the amount of fuel they\npurchased, since they could see it temporarily stored in the cylinder.</p>\n<p>As cars proliferated in the 1910s, a company called Gilbarco developed a fuel\ndispenser that actually measured the quantity of fuel as it was being pumped\nfrom storage tank to vehicle... with no intermediary step in a glass cylinder\nrequired. The original Gilbarco design involved a metal turbine in a small\nglass sphere; the passing fuel spun the turbine which drove a mechanical\ncounter. In truth, the design of modern fuel dispensers hasn't changed that\nmuch, although the modern volumetric turbines are made more accurate with a\npositive displacement design similar to a Roots blower.</p>\n<p>Even with the new equipment, fuel was sold in much the same way: an attendant\noperated the pump, read the meter, and collected payment. There was,\nadmittedly, an increased hazard of inattentive or malicious gas stations\novercharging.  Volumetric dispensers thus lead to dispensers that automatically\ncalculated the price (now generally a legal requirement) and the practice of a\nregulatory authority like the state or tribal government testing fuel\ndispensers for calibration. Well, if consumers were expected to trust the gas\nstation, perhaps the gas station ought to trust the consumer... and these same\nimprovements to fuel dispensers made it more practical for the motorist to\nsimply pump their own gas.</p>\n<p>At the genesis of self-serve gasoline, most stations operated on a postpayment\nmodel. You pulled up, pumped gas, and then went inside to the attendant to pay\nwhatever you owed. Of course, a few unscrupulous people would omit that last\nstep. A simple countermeasure spread in busy cities: the pumps were normally\nkept powered off. Before dispensing gasoline, you would have to speak with\nthe attendant. Depending on how trustworthy they estimated you to be, they\nmight just turn on power to the pump or they might require you to deposit some\ncash with them in advance. This came to be known as &quot;prepayment,&quot; and is now so\nuniversal in th US that the &quot;prepay only&quot; stickers on fuel dispensers seem a\nbit anachronistic <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup>.</p>\n<p>It's simple enough to imagine how this scheme worked, electronically. There is\nseparate power wiring to the pumps for each dispenser (and these stations\nusually only had two dispensers anyway), and that wiring runs to the counter\nwhere the attendant can directly switch power. Most gas stations do use\nsubmersible pumps in the tank rather than in the actual dispenser, but older\ndesigns still had one pump per dispenser and were less likely to use\nsubmersible pumps anyway.</p>\n<p>Soon, things became more complex. Modern vehicles have big gas tanks, and gas\nhas become fairly expensive. What happens when a person deposits, say, $20 of\n&quot;earnest cash&quot; to get a pump turned on, and then pumps $25 worth of gas?\nHopefully they have the extra $5, but the attendant doesn't know that. Besides,\ngas stations grew larger and it wasn't always feasible for the attendant to see\nthe dispenser counters out the window. You wouldn't want to encourage people\nto just lie about the amount of gas they'd dispensed.</p>\n<p>Gas stations gained remote control: using digital communications, fuel\ndispensers reported the value of their accumulators to a controller at the\ncounter. The attendant would use the same controller to enable dispenser,\npotentially setting a limit at which the dispenser would automatically shut\noff. If you deposit $20, they enable the pump with a limit of $20. If you\npay by card, they will likely authorize the card for a fixed amount (this\nused to routinely be $40 but has gone up for reasons you can imagine),\nenable the dispenser with no limit or a high limit, and then capture the actual\namount after you finished dispensing <sup class=\"footnote-ref\" id=\"fnref-2\"><a href=\"#fn-2\">2</a></sup>.</p>\n<p>And that's how gas stations worked for quite a few decades. Most gas stations\nthat you use today still have this exact same system in operation, but it may\nhave become buried under additional layers of automation. There are two things\nthat have caused combinatorial complexity in modern forecourt control: first,\nany time you automate something, there is a natural desire to automate <em>more</em>\nthings. With a digital communications system between the counter and the\nforecourt, you can do more than just enable the dispensers! You might want to\nmonitor the levels in the tanks, update the price on the big sign, and sell\ncar wash vouchers with a discount for a related fuel purchase. All of these\ncapabilities, and many more, have been layered on to forecourt control systems\nthrough everything from serial bus accessories to REST API third party\nintegrations.</p>\n<p>Speaking of leaking underground storage tanks, you likely even have a\nregulatory obligation to monitor tank levels and ensure they balance against\nbulk fuel deliveries and dispenser totals. This detects leakage, but it also\ndetects theft, still a surprisingly common problem for gas stations. Your\ncorporate office, or your bulk fuel provider, may monitor these parameters\nremotely to schedule deliveries and make sure that theft isn't happening with\nthe cooperation of the station manager. Oh, and prices, those may be set\ncentrally as well.</p>\n<p>The second big change is nearly universal &quot;CRIND.&quot; This is an awkward industry\nacronym for everyone's favorite convenience feature, Card Reader IN Dispenser.\nCRIND fuel dispensers let payment card customers complete the whole authorize,\ndispense, and capture process right at the dispenser, without coming inside at\nall. CRIND is so common today that it's almost completely displaced even its\nimmediate ancestor, &quot;fuel island&quot; outdoor payment terminals (OPTs) that provide\na central kiosk where customers make payments for multiple dispensers. This\nused to be a pretty common setup in California where self-service caught on\nearly but, based on my recent travels, has mostly evaporated there.</p>\n<p>So you can see that we have a complicated and open-ended set of requirements\nfor communication and automation in the fuel court: enabling and monitoring\npumps, collecting card payments, and monitoring and controlling numerous\naccessories. Most states also require gas stations to have an intercom system\nso that customers can request help from the attendant inside. Third-party\nloyalty systems were briefly popular although, mercifully, the more annoying of\nthem have mostly died out... although only because irritating\nadvertising-and-loyalty technology has been better integrated into the\ndispensers themselves.</p>\n<p>Further complicating things, gas station forecourts are the epitome of legacy\nintegration. Fuel dispensers are expensive, concrete slabs are expensive, and\ngas stations run on thin margins. While there aren't very many manufacturers\nof fuel dispensers, or multi-product dispensers as they're typically called\ntoday, the industry of accessories, control systems, and replacement parts\nis vast. Most gas stations have accumulated several different generations of\ncontrol systems and in-dispenser accessories like tree rings. New features\nlike CRIND, chip payment, touchless payment, and &quot;Gas Station TV&quot; have each\nmotivated another round of new communications protocols.</p>\n<p>And that's how we get to our modern world, where the brochure for a typical\ngas station forecourt controller lists 25+ different communications\nprotocols—and assures that you can use &quot;any mix.&quot;</p>\n<p>Variability between gas stations increases when you consider the differing\nlevels of automation available. It used to be common for gas stations to use\nstandalone pump controllers that didn't integrate with much else—when you\nprepaid, for example, the cashier would manually enter the pump number and\nprepayment limit on a separate device from the cash register.</p>\n<p>Here in New Mexico, quite a few stations used to use the Triangle MicroSystems\nMPC family, a wedge-shaped box with an industrial-chic membrane keypad in\ngrey and bright red. Operation of the MPC is pretty simple, basically\npressing a pump number and then entering a dollar limit. Of course, the full\nset of features runs much deeper, including financial reporting and fleet\nfueling contracts.</p>\n<p>This is another important dimension of the gas station control industry: fleet\nfueling. It used to be that gas stations were divided into two categories,\nconsumer stations that took cash payment and &quot;cardlock&quot; stations that used an\nelectronic payment system. Since cardlock stations originally relied on\nproprietary, closed payment agreements, they didn't sell to consumers and had\ndifferent control requirements (often involving an outside payment terminal).\nAs consumers widely adopted card payments, the lines between the two markets\nblurred. Modern cardlock fueling networks, like CFN and Wex, are largely just\nanother set of payment processors. Most major gas stations participate in most\nmajor cardlock networks, just the same as they participate in most major ATM\nnetworks for lower-cost processing of debit cards.</p>\n<p>Of course, more payment networks call for more integrations. The complexity\nof the modern payment situation has generally outgrown standalone controllers,\nand they seem to be fading away. Instead, the typical gas station today has\nforecourt control completely integrated into their POS system. Forecourt\nintegration is such an important requirement that gas station convenience\nstores, mostly handling normal grocery-type transactions, nevertheless\nrely almost exclusively on dedicated gas station POS solutions. In other\nwords, next time you buy a can of Monster and a bag of chips, the cashier\nmost likely rings you up and takes payment through a POS solution offered\nby the dispenser manufacturer (like Gilbarco Passport Retail) or one of\ndozens of vendors that caters specifically to gas stations (including\ncompelling names like Petrosoft). Control of fuel dispensers is just too\nweird of a detail to integrate into other POS platforms... or so it was\nthought, although things clearly get odd as Gilbarco has to implement basic\n<a href=\"https://computer.rip/2021-02-27-kitchen-videos.html\">kitchen video system</a>\nintegration for the modern truck stop.</p>\n<p>So how does this all work technically? That's the real topic of fascination,\nright? Well, it's a mess and hard to describe succinctly. There are so many\ndifferent options, and particularly legacy retrofit options, that one gas\nstation will be very different from the next.</p>\n<p>In the days of &quot;mechanical pumps,&quot; simple designs with mechanical counters,\ncontrol wiring was simple: the dispenser (really a mechanical device called a\npulser) was expected to provide &quot;one pulse per penny&quot; on a counting circuit\nfor dollars dispensed, which incremented a synchronized counter on the\ncontroller. For control the other way, the controller just closed relays to\nopen &quot;fast&quot; or &quot;slow&quot; valves on the dispenser. The controller might also get a\nsignal when a handle lever is activated, to alert the attendant that someone\nis trying to use a dispenser, but that was about it.</p>\n<p>Later on, particularly as multi-product dispensers with two hoses and four\nrates (due to diesel and three grades) became common, wiring all the different\npulse and valve circuits became frustrating. Besides, pumps with digital\ncounters no longer needed mechanical adjustment when prices changed, allowing\nfor completely centralized price calculation. To simplify wiring while enabling\nnew features, fuel dispenser manufacturers introduced simple current-loop\nserial buses. These are usually implemented as a single loop that passes\nthrough each dispenser, carrying small packets with addressed commands or\nreports, usually at a pretty low speed. The dispensers designed for use with\nthese systems are much more standalone than the older mechanical dispensers,\nand perform price accumulation internally, so they only needed to report\nperiodic totals during fueling and at the end of the transaction.</p>\n<p>An upside of these more standalone dispensers is that they made CRIND easier to\nimplement: the payment terminal in the dispenser could locally enable the pump,\nincluding setting limits, by a direct interface to the pump controller. Still,\nthe CRIND needed some way to actually authorize and report transactions.\nSolution: another current loop. Most CRIND installations involved a second,\nsimilar, but usually higher-speed serial bus that specifically handled\npayment processing. The CRIND terminals in such a system usually communicated\nwith a back-office payment server using a very simple protocol, sending card\ninformation in the clear. That back-office server might be in the back of the\nconvenience store, but it could also be remote.</p>\n<p>As gas stations introduced CRIND, plastic card sales became a key part of the\nbusiness. Card volume is much greater than cash volume at most stations, and\nit's known that customers will often leave rather than go inside if there\nis a problem with CRIND payment. So gas stations prioritized reliability of\npayments. To this day, if you look at the roof of many gas stations, you'll\nfind a small parabolic antenna pointed aimlessly skywards. By the end of the\n1990s, many chain gas stations used satellite networks for payment processing,\neither routinely (cheaper than a leased telephone line!) or as a contingency.\nCisco's VSAT terminal modules for edge routers, combined with a boutique\nindustry of Mbps-class data networks on leased transponders, made satellite\na fairly inexpensive and easy-to-obtain option for handling small payment\nprocessing messages.</p>\n<p>This arrangement of one current loop for dispenser control and one current loop\nfor payment terminals lasted for long enough that it became a de facto wiring\nstandard for the gas station forecourt. New construction gas stations provided\nconduits from the convenience store to the pumps, and those conduits were\nusually spec'd for an A/C power circuit (controlled, per code, by an emergency\nstop button) and two low-voltage data circuits. The low-voltage data circuits\nwere particularly important because the electrical code and fire code impose\nspecific rules on electrical systems used in proximity to flammable\nfluids—what's called a &quot;hazardous environment&quot; in the language of safety codes.\nDispenser manufacturers sold specialized field interconnection enclosures that\nisolated the data circuits to the required safety standard, lowering the\ncomplexity of the installation in the dispensers themselves <sup class=\"footnote-ref\" id=\"fnref-3\"><a href=\"#fn-3\">3</a></sup>.</p>\n<p><img src=\"https://computer.rip/f/gas/2.png\" alt=\"Illustration from Gilbarco manual\" /></p>\n<p>The next event to challenge forecourt infrastructure was the introduction of\nEMV chip and tap-to-pay payment cards. Many Americans will remember how fuel\ndispensers routinely had tap-to-pay terminals physically installed for years,\neven a decade, before they actually started working. Modernizing dispensers\nusually meant installing a new CRIND system with EMV support, but upgrades\nto the underlying network to support them took much longer. The problem was\nexactly the simplicity of the CRIND current loop design: EMV standards\nrequired that all data be encrypted (you couldn't just send card numbers to\nthe backend in the clear as older systems did), and required larger and\nmore numerous messages between the payment network, the terminal, and the\ncard itself. Even if supporting EMV transactions on the serial bus was\npossible, most manufacturers chose not to, opting for the vastly simpler\ndesign of direct IP connectivity to each CRIND terminal.</p>\n<p>But how do you put IP over a simple two-wire serial bus? Well, there are a\nlot of options, and the fuel dispenser industry chose basically all of them.\nThere were proprietary solutions, but more common were IP networking\ntechnologies adapted to the forecourt application. Consider DSL: for a good\ndecade, many forecourt interconnection boxes and fuel dispenser controllers\nsupported good old fashioned DSL over the payment loop (not to be confused\nwith DSL as in Diesel, an abbreviation also used in the fuel industry).</p>\n<p>Bandwidth requirements increased yet further, though, with the introduction\nof Maria Menounos. &quot;Forecourt media&quot; advertising systems can deliver full\nvideo to each dispenser, a golden opportunity to pitch credit cards and\nmonetize something called &quot;Cheddar.&quot; While there was a long era of satellite\ntransponders delivering analog video to chains for in-store marketing (I\nwill one day write about WalMart TV), the &quot;GSTV&quot; phenomenon is newer and\ncompletely internet-based. For HD video you need a little better than the\n5Mbps performance that industrial DSL systems were delivering. Enter\n<a href=\"https://computer.rip/2025-02-02-residential-networking-over-telephone.html\">HomePlug</a>.</p>\n<div class=\"beg\">\n<hr />\n<p>I put a lot of time into writing this, and I hope that you enjoy reading\nit. If you can spare a few dollars, consider <a href=\"https://ko-fi.com/jbcrawford\">supporting me on\nko-fi</a>. You'll receive an occasional extra,\nsubscribers-only post, and defray the costs of providing artisanal, hand-built\nworld wide web directly from Albuquerque, New Mexico.</p>\n<hr />\n</div>\n<p>Despite HomePlug's limited market success, it has been widely adopted in\ngas station forecourts. The advantage of HomePlug is clear: it dispenses with\nthe control wiring loops entirely, providing IP communications with dispensers\nover the electrical supply wiring. It usually presents an almost zero-wiring\nupgrade, just adding HomePlug boards on both ends, so even in stations with\ngood forecourt serial loops, dispenser upgrades often end in a switch to\nHomePlug.</p>\n<p>The most interesting thing about these networks is just how modular it all\nstill is: somewhere in your local gas station, there is a forecourt controller.\nDepending on the age of the system, that might be a bespoke embedded system\nwith plug-in modules, or it might be a generic N100 Mini PC with a few serial\nports and mostly IP connectivity. There is likely a forecourt interconnection\nbox that holds not just the wiring terminals but also adapter boards that\nconvert between various serial protocols, IP carriers, and control signals.\nThe point of sale backend server might interact with the forecourt controller\nvia IP, but older systems used RS-232... and systems in between might use\nthe same logical protocol as they did with RS-232, but encapsulated in TCP.\nThe installation manuals for all of these products include pages of wiring\ndiagrams for each different scenario.</p>\n<p>Next time you stop at a gas station and find the CRIND not working, think\nabout all of that: whatever technician comes out to fix it will have their\nwork cut out for them, just to figure out which way that gas station is\nset up.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>In more rural areas of poorer states such as my own, you will still\nfind gas stations where the attendant turns the pump on after eyeing you.\nThese are mostly stations that just haven't had the money to install newer\nequipment, which as we will see can be a big project. I have lived here for\nabout a decade, long enough to have noticed a significant decline in the\nnumber of these stations still operating.<a href=\"#fnref-1\" class=\"footnote\">&#8617;</a></p></li>\n<li id=\"fn-2\">\n<p>For most payment card technologies, &quot;authorizing&quot; and &quot;capturing&quot; are separate\nsteps that can be done with different dollar amounts. This model of paying for\ngas is one of the reasons why.<a href=\"#fnref-2\" class=\"footnote\">&#8617;</a></p></li>\n<li id=\"fn-3\">\n<p>For example, UL standards require physical separation between mains\nvoltage wiring and plumbing components inside of fuel dispenser enclosures.\nThe enclosures are actually rather crowded spaces, so that can turn into a\nreal hassle—and a selling point for low-voltage-only control systems. Fuel\ndispenser enclosures are also required to contain a fuel fire due to leaking\nplumbing, which is why you see fairly heavy sheet metal construction with\nthe sides forming chimney-like vents.<a href=\"#fnref-3\" class=\"footnote\">&#8617;</a></p></li>\n</ol>\n</div>\n  ",
    "description": "The way I see it, few parts of American life are as quintessentially American as buying gas. We love our cars, we love our oil, and an industry about as old as automobiles themselves has developed a highly consistent, fully automated, and fairly user friendly system for filling the former with the latter. I grew up in Oregon. While these rules have since been relaxed, many know Oregon for its long identity as one of two states where you cannot pump your own gas (the other being New Jersey). Inst",
    "is_fulltext": true,
    "source": "computers are bad",
    "pub_date": "08 Feb 2026 00:00:00 UT",
    "fetched_at": "2026-02-09T00:40:26.319139",
    "url_hash": "6c5198b8fb324ebb7a319872f1a95588"
  }
]