[
  {
    "title": "Vouch",
    "link": "https://simonwillison.net/2026/Feb/7/vouch/#atom-everything",
    "content": "\n    \n<p><strong><a href=\"https://github.com/mitchellh/vouch\">Vouch</a></strong></p>\nMitchell Hashimoto's new system to help address the deluge of worthless AI-generated PRs faced by open source projects now that the friction involved in contributing has dropped so low.</p>\n<p><a href=\"https://twitter.com/mitchellh/status/2020252149117313349\">He says</a>:</p>\n<blockquote>\n<p>The idea is simple: Unvouched users can't contribute to your projects. Very bad users can be explicitly \"denounced\", effectively blocked. Users are vouched or denounced by contributors via GitHub issue or discussion comments or via the CLI.</p>\n<p>Integration into GitHub is as simple as adopting the published GitHub actions. Done. Additionally, the system itself is generic to forges and not tied to GitHub in any way.</p>\n<p>Who and how someone is vouched or denounced is up to the project. I'm not the value police for the world. Decide for yourself what works for your project and your community.</p>\n</blockquote>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/open-source\">open-source</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/github-actions\">github-actions</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/mitchell-hashimoto\">mitchell-hashimoto</a>, <a href=\"https://simonwillison.net/tags/ai-ethics\">ai-ethics</a></p>\n\n\n\n",
    "description": "Vouch Mitchell Hashimoto's new system to help address the deluge of worthless AI-generated PRs faced by open source projects now that the friction involved in contributing has dropped so low. He says: The idea is simple: Unvouched users can't contribute to your projects. Very bad users can be explicitly \"denounced\", effectively blocked. Users are vouched or denounced by contributors via GitHub issue or discussion comments or via the CLI. Integration into GitHub is as simple as adopting the publi",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-07T23:57:57+00:00",
    "fetched_at": "2026-02-08T00:47:29.305349",
    "url_hash": "21795c644ec650cb1f542c0333bdf6d4"
  },
  {
    "title": "Exploring a Modern SMTPE 2110 Broadcast Truck With My Dad",
    "link": "https://www.jeffgeerling.com/blog/2026/exploring-a-modern-smpte-2110-broadcast-truck-with-my-dad/",
    "content": "<p>In October, my Dad and I got to go behind the scenes at two St. Louis Blues (NHL hockey) games, and observe the massive team effort involved in putting together a modern digital sports broadcast.</p>\n<figure class=\"insert-image\"><img src=\"https://www.jeffgeerling.com/blog/2026/exploring-a-modern-smpte-2110-broadcast-truck-with-my-dad/blues-game-production-truck-prod-room.jpg\"\n alt=\"Broadcast production room in 45 Flex truck at a Blues game\" width=\"700\" height=\"auto\">\n</figure>\n\n<p>I wanted to explore the timing and digital side of a modern <a href=\"https://www.smpte.org/standards/st2110\">SMPTE 2110</a> mobile unit, and my Dad has been involved in studio and live broadcast for decades, so he enjoyed the experience as the engineer <em>not</em> on duty!</p>",
    "description": "In October, my Dad and I got to go behind the scenes at two St. Louis Blues (NHL hockey) games, and observe the massive team effort involved in putting together a modern digital sports broadcast. I wanted to explore the timing and digital side of a modern SMPTE 2110 mobile unit, and my Dad has been involved in studio and live broadcast for decades, so he enjoyed the experience as the engineer not on duty!",
    "is_fulltext": false,
    "source": "Jeff Geerling",
    "pub_date": "Sat, 07 Feb 2026 09:00:00 -0600",
    "fetched_at": "2026-02-08T00:47:29.673796",
    "url_hash": "52dd894706566a4f6b4ac2f782fe8b11"
  },
  {
    "title": "Reputation Scores for GitHub Accounts",
    "link": "https://shkspr.mobi/blog/2026/02/reputation-scores-for-github-accounts/",
    "content": "<p>The folks at GitHub know that Open Source maintainers are drowning in a sea of low-effort contributions. Even before Microsoft forced the unwanted Copilot assistant on millions of repos, it was always a gamble whether a new contributor would be helpful or just some witless jerk. Now it feels a million times worse.</p>\n\n<p>There are <a href=\"https://github.com/orgs/community/discussions/185387\">some discussions about what tools repository owners should have to help them</a>. Disabling AI on repos is popular - but ignored by Microsoft. Being able to <em>delete</em> PRs is helpful - but still makes work for maintainers. Adding more AI to review new PRs and issues is undoubtedly popular with those who like seeing number-go-up - but of dubious use for everyone else.</p>\n\n<p>I'd like to discuss something else - reputation scores.</p>\n\n<p>During Hacktoberfest, developers are encouraged to contribute to repositories in order to win a t-shirt. Naturally, this leads to some <em>very</em> low-effort contributions. If a contribution is crap, maintainers can apply a \"Spam\" label to it.</p>\n\n<blockquote><p><a href=\"https://hacktoberfest.com/participation/\">Any user with two or more spammy PR/MRs will be disqualified.</a></p></blockquote>\n\n<p>This works surprisingly well as a disincentive! Since that option was added, I had far fewer low-effort contributions. When I did apply the spam label, I got a few people asking how they could improve their contribution so the label could be removed.</p>\n\n<p>However, there is no easy way to see how many times a user has been labelled as a spammer. Looking at a user account, it isn't immediately obvious how trustworthy a user is. I can't see how many PRs they've sent, how many have been merged or closed as useless, nor how many bug reports were helpful or closed as irrelevant.</p>\n\n<p>There are <em>some</em> badges, but I don't think they go far enough.</p>\n\n<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/GitHub-Badges.webp\" alt=\"A collection of little badges showing a GitHub user's achievements. \" width=\"512\" height=\"360\" class=\"aligncenter size-full wp-image-67688\">\n\n<p>I think it <em>could</em> be useful if maintainers were able to set \"contributor controls\" on their repositories. An entirely optional way to tone down the amount of unhelpful contributions.</p>\n\n<p>Here are some example restrictions (and some reasons why they may not help):</p>\n\n<ul>\n<li>Age of account. Only accounts older than X days, weeks, or years can contribute.\n\n<ul>\n<li>This disenfranchises new users who may have specifically signed up to report a bug or fix an issue.</li>\n</ul></li>\n<li>Restrict PRs to people who have been assigned to an issue.\n\n<ul>\n<li>May be a disincentive to those wishing to contribute simple fixes.</li>\n</ul></li>\n<li>Social labelling. Have other maintainers marked this user as a spammer?\n\n<ul>\n<li>Could be abused or used for bullying.</li>\n</ul></li>\n<li>Synthetic Reputation Score. Restrict contributions to people with a \"score\" above a certain level.\n\n<ul>\n<li>How easy will it be to boost your score? What if you get accidentally penalised?</li>\n</ul></li>\n<li>Escrow. Want to open a PR / Issue, put a quid in the jar. You'll forfeit it if you're out of line.\n\n<ul>\n<li>Not great for people with limited funds, or who face an unfavourable exchange rate.  Rich arseholes won't care.</li>\n</ul></li>\n</ul>\n\n<p>Obviously, all of these are gameable to some extent. It also incentivises the theft or sale of \"high reputation\" accounts. Malicious admins could threaten to sanction a legitimate account.</p>\n\n<p>But apps like Telegram show me when someone has changed their name or photo (a good sign of a scammer). AirBnB &amp; Uber <em>attempt</em> to provide a rating for users. My telephone warns me if an unknown caller has been marked as spam.</p>\n\n<p>I don't know which controls, if any, GitHub will settle on. There is a risk that systems like this could prohibit certain people from contributing - but the alternative is maintainers drowning in a sea of slop.</p>\n\n<p>I think all code-forges should adopt <em>optional</em> controls like this.</p>\n",
    "description": "The folks at GitHub know that Open Source maintainers are drowning in a sea of low-effort contributions. Even before Microsoft forced the unwanted Copilot assistant on millions of repos, it was always a gamble whether a new contributor would be helpful or just some witless jerk. Now it feels a million times worse. There are some discussions about what tools repository owners should have to help…",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Sat, 07 Feb 2026 12:34:52 +0000",
    "fetched_at": "2026-02-08T00:47:40.506148",
    "url_hash": "236715d01e36e70df7b915c3f4db76cd"
  },
  {
    "title": "Zendesk, get your shit together please",
    "link": "https://xeiaso.net/notes/2026/zendesk-get-shit-together/",
    "content": "\n        <p>I don't have any contacts at Zendesk, but I'm noticing another massive wave of spam from their platform:</p>\n        <figure class=\"max-w-3xl mx-auto not-prose w-full undefined\"><a href=\"https://files.xeiaso.net/notes/2026/zendesk-get-shit-together/zendesk-spam.jpg\"><picture><source type=\"image/avif\" srcset=\"https://files.xeiaso.net/notes/2026/zendesk-get-shit-together/zendesk-spam.avif\"/><source type=\"image/webp\" srcset=\"https://files.xeiaso.net/notes/2026/zendesk-get-shit-together/zendesk-spam.webp\"/><img loading=\"lazy\" src=\"https://files.xeiaso.net/notes/2026/zendesk-get-shit-together/zendesk-spam.jpg\"/></picture></a></figure>\n        <p>If you're seeing this and either work at Zendesk or know someone that does, please have them actually treat this as an issue and not hiding behind <a href=\"https://support.zendesk.com/hc/en-us/articles/9833274501786-Important-notice-about-recent-spam-emails-via-Zendesk\">&quot;just delete the emails lol&quot;</a>.</p>\n        <center><img style=\"max-height:12rem\" alt=\"Cadey is percussive-maintenance\" loading=\"lazy\" src=\"https://stickers.xeiaso.net/sticker/cadey/percussive-maintenance\"/></center>\n      ",
    "description": "BORN TO GET SPAMMED, WORLD IS A FUCK, SPAMHAUS THEM ALL 2026, I am inbox full man, 410,757,864,530 Zendesk emails",
    "is_fulltext": true,
    "source": "Xe Iaso's blog",
    "pub_date": "Sat, 07 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-08T00:47:43.779056",
    "url_hash": "89932cdac052c66a9a37dfb8e8a01d82"
  },
  {
    "title": "Minimum of cosine sum",
    "link": "https://www.johndcook.com/blog/2026/02/07/chowla/",
    "content": "<p>Suppose <em>f</em>(<em>x</em>) is the sum of terms of the form cos(<em>kx</em>) where <em>k</em> is an integer from a set <em>A</em> with <em>n</em> elements.</p>\n<p><img decoding=\"async\" class=\"aligncenter\" style=\"background-color: white;\" src=\"https://www.johndcook.com/chowla_cosine.svg\" alt=\"f_A(x) = \\sum_{k \\in A} \\cos(kx)\" width=\"159\" height=\"44\" /></p>\n<p>Then the maximum value of <em>f</em> is <em>f</em>(0) = <em>n</em>. But what is the minimum value of <em>f</em>?</p>\n<p>The <strong>Chowla cosine conjecture</strong> says that the minimum should be less than −√<em>n</em> for large <em>n</em>. For now the best proven results are much smaller in absolute value [1].</p>\n<p>I was playing around with this problem, and the first thing I thought of was to let the set <em>A</em> be the first <em>n</em> primes. This turned out to not be the most interesting example. Since all the primes except for the first are odd, and cos(<em>k</em>π) = −1 for odd <em>k</em>, the minimum was always approximately −<em>n</em> and always occurred near π [2].</p>\n<p>Here&#8217;s a plot where <em>A</em> is the set of primes less than 100.</p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/chowla_prime.png\" width=\"480\" height=\"360\" /></p>\n<p>For the cosine conjecture to be interesting, the set <em>A</em> should contain a mix of even and odd numbers.</p>\n<p>Here&#8217;s a plot with <em>A</em> equal to a random selection of 25 points between 1 and 100. (I chose 25 because there are 25 primes less than 100.)</p>\n<p><img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://www.johndcook.com/chowla_random.png\" width=\"480\" height=\"360\" /></p>\n<p>Here&#8217;s the Python code I used to generate the two sets <em>A</em> and the function to plot.</p>\n<pre>import numpy as np\nfrom sympy import prime\n\ndef f(x, A):\n    return sum([np.cos(k*x) for k in A])\n\nn = 25\nA_prime = [prime(i) for i in range(1, n+1)]\nnp.random.seed(20260207)\nA_random = np.random.choice(range(1, 101), size=n, replace=False)\n</pre>\n<p>If you wanted to explore the Chowla conjecture numerically, direct use of minimization software is impractical. As you can tell from the plots above, there are a lot of local minima. If the values in <em>A</em> are not too large, you can look at a plot to see approximately where the minimum occurs, then use a numerical method to find the minimum in this region, but that doesn&#8217;t scale.</p>\n<p>Here&#8217;s an approach that would scale better. You could find all the zeros of the derivative of <em>f</em><sub><em>A</em></sub> and evaluate the function at each. One of these is the minimum. The derivative is a sum of sines with integer frequencies, and so it could be written as a polynomial in <em>z</em> = exp(<em>ix</em>) [3]. You could find all the zeros of this polynomial using the QR algorithm as discussed in the <a href=\"https://www.johndcook.com/blog/2026/02/06/eigenvalue-roots/\">previous post</a>.</p>\n<p>[1] Benjamin Bedert. Polynomial bounds for the Chowla cosine problem. <a href=\"https://arxiv.org/abs/2509.05260v2\">arXiv</a></p>\n<p>[2] If <em>A</em> is the set of the first <em>n</em> primes, <em>f</em><sub><em>A</em></sub>(π) = 2 − <em>n</em> because the sum defining <em>f</em><sub><em>A</em></sub>(π) has one term equal to 1 and <em>n</em> − 1 terms equal to −1. I think for <em>n</em> ≥ 4 this is the minimum, but I haven&#8217;t verified this. If so, the minimum isn&#8217;t just near π but exactly at π.</p>\n<p>[3] You get a polynomial of degree <em>n</em> in <em>z</em> and 1/<em>z</em>. Then multiply by <em>z</em><sup>2<em>n</em></sup> to get a polynomial in <em>z</em> only of degree 2<em>n</em>.</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/07/chowla/\">Minimum of cosine sum</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "Suppose f(x) is the sum of terms of the form cos(kx) where k is an integer from a set A with n elements. Then the maximum value of f is f(0) = n. But what is the minimum value of f? The Chowla cosine conjecture says that the minimum should be less than −√n for large n. For now the best [&#8230;] The post Minimum of cosine sum first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Sat, 07 Feb 2026 14:02:45 +0000",
    "fetched_at": "2026-02-08T00:47:58.717158",
    "url_hash": "d279f3c41b58f7201d2c8b1d86dcf4f1"
  },
  {
    "title": "Updates 7 februari: Tweede Kamer, TV Bureau Buitenland",
    "link": "https://berthub.eu/articles/posts/update-7-februari/",
    "content": "Hallo allemaal,\nEr is weer genoeg te vertellen! Zoveel dat ik vermoedelijk nog dingen vergeet in deze update.\nDit is een kopie van een bericht op mijn nieuwsbrief. Schrijf u vooral ook in als u geen updates wil missen!\nOm te beginnen het meest actuele: Zondag 21:30 op TV NPO2, Bureau Buitenland (VPRO) met Barbara Kathmann en mij over de geopolitiek van onze absurde digitale afhankelijkheden. Kijk vooral, we gaan ons best doen er een leerzame uitzending van te maken!",
    "description": "Hallo allemaal, Er is weer genoeg te vertellen! Zoveel dat ik vermoedelijk nog dingen vergeet in deze update. Dit is een kopie van een bericht op mijn nieuwsbrief. Schrijf u vooral ook in als u geen updates wil missen! Om te beginnen het meest actuele: Zondag 21:30 op TV NPO2, Bureau Buitenland (VPRO) met Barbara Kathmann en mij over de geopolitiek van onze absurde digitale afhankelijkheden. Kijk vooral, we gaan ons best doen er een leerzame uitzending van te maken!",
    "is_fulltext": false,
    "source": "Bert Hubert's writings",
    "pub_date": "Sat, 07 Feb 2026 22:00:09 +0100",
    "fetched_at": "2026-02-08T00:48:34.195166",
    "url_hash": "7f6502d25eb3824681c96bb2ae13ff13"
  }
]