[
  {
    "title": "Quoting Andrew Deck for Niemen Lab",
    "link": "https://simonwillison.net/2026/Feb/11/manosphere-report/#atom-everything",
    "content": "\n    <blockquote cite=\"https://www.niemanlab.org/2026/02/how-the-new-york-times-uses-a-custom-ai-tool-to-track-the-manosphere/\"><p>An AI-generated report, delivered directly to the email inboxes of journalists, was an essential tool in the Times’ coverage. It was also one of the first signals that conservative media was turning against the administration [...]</p>\n<p>Built in-house and known internally as the “Manosphere Report,” the tool uses large language models (LLMs) to transcribe and summarize new episodes of dozens of podcasts.</p>\n<p>“The Manosphere Report gave us a really fast and clear signal that this was not going over well with that segment of the President’s base,” said Seward. “There was a direct link between seeing that and then diving in to actually cover it.”</p></blockquote>\n<p class=\"cite\">&mdash; <a href=\"https://www.niemanlab.org/2026/02/how-the-new-york-times-uses-a-custom-ai-tool-to-track-the-manosphere/\">Andrew Deck for Niemen Lab</a>, How The New York Times uses a custom AI tool to track the “manosphere”</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/new-york-times\">new-york-times</a>, <a href=\"https://simonwillison.net/tags/journalism\">journalism</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/data-journalism\">data-journalism</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a></p>\n\n\n\n",
    "description": "An AI-generated report, delivered directly to the email inboxes of journalists, was an essential tool in the Times’ coverage. It was also one of the first signals that conservative media was turning against the administration [...] Built in-house and known internally as the “Manosphere Report,” the tool uses large language models (LLMs) to transcribe and summarize new episodes of dozens of podcasts. “The Manosphere Report gave us a really fast and clear signal that this was not going over well w",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-11T20:59:03+00:00",
    "fetched_at": "2026-02-12T00:38:31.804062",
    "url_hash": "b8a29b3dde66f182d53373464d03ba87"
  },
  {
    "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
    "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
    "content": "<p>For the past week, the massive &#8220;Internet of Things&#8221; (IoT) botnet known as <strong>Kimwolf</strong> has been disrupting <strong>The Invisible Internet Project</strong> (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet&#8217;s control servers.</p>\n<p>Kimwolf is a botnet that surfaced in late 2025 and quickly infected millions of systems, turning poorly secured IoT devices like TV streaming boxes, digital picture frames and routers into relays for malicious traffic and <a href=\"https://krebsonsecurity.com/2025/10/ddos-botnet-aisuru-blankets-us-isps-in-record-ddos/\" target=\"_blank\" rel=\"noopener\">abnormally large</a> distributed denial-of-service (DDoS) attacks.</p>\n<p>I2P is a decentralized, privacy-focused network that allows people to communicate and share information anonymously.</p>\n<p>&#8220;It works by routing data through multiple encrypted layers across volunteer-operated nodes, hiding both the sender&#8217;s and receiver&#8217;s locations,&#8221; the <a href=\"https://i2p.net/\" target=\"_blank\" rel=\"noopener\">I2P website explains</a>. &#8220;The result is a secure, censorship-resistant network designed for private websites, messaging, and data sharing.&#8221;</p>\n<p>On February 3, I2P users began <a href=\"https://github.com/PurpleI2P/i2pd/issues/2312#issuecomment-3875275177\" target=\"_blank\" rel=\"noopener\">complaining on the organization&#8217;s GitHub page</a> about tens of thousands of routers suddenly overwhelming the network, preventing existing users from communicating with legitimate nodes. Users reported a rapidly increasing number of new routers joining the network that were unable to transmit data, and that the mass influx of new systems had overwhelmed the network to the point where users could no longer connect.</p>\n<div id=\"attachment_73192\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73192\" decoding=\"async\" class=\" wp-image-73192\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-github.png\" alt=\"\" width=\"749\" height=\"502\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-github.png 850w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-github-768x515.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-github-782x524.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-73192\" class=\"wp-caption-text\">I2P users complaining about service disruptions from a rapidly increasing number of routers suddenly swamping the network.</p></div>\n<p>When one I2P user asked whether the network was under attack, another user replied, &#8220;Looks like it. My physical router freezes when the number of connections exceeds 60,000.&#8221;</p>\n<div id=\"attachment_73198\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73198\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73198\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2pconnections.png\" alt=\"\" width=\"750\" height=\"448\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2pconnections.png 954w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2pconnections-768x459.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2pconnections-782x467.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><p id=\"caption-attachment-73198\" class=\"wp-caption-text\">A graph shared by I2P developers showing a marked drop in successful connections on the I2P network around the time the Kimwolf botnet started trying to use the network for fallback communications.</p></div>\n<p>The same day that I2P users began noticing the outages, <a href=\"https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/\" target=\"_blank\" rel=\"noopener\">the individuals in control of Kimwolf</a> posted to their Discord channel that they had accidentally disrupted I2P after attempting to join 700,000 Kimwolf-infected bots as nodes on the network.</p>\n<div id=\"attachment_73193\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73193\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73193\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/dort-killedi2p.png\" alt=\"\" width=\"750\" height=\"309\" /><p id=\"caption-attachment-73193\" class=\"wp-caption-text\">The Kimwolf botmaster openly discusses what they are doing with the botnet in a Discord channel with my name on it.</p></div>\n<p>Although Kimwolf is known as a potent weapon for launching DDoS attacks, the outages caused this week by some portion of the botnet attempting to join I2P are what&#8217;s known as a &#8220;<a href=\"https://en.wikipedia.org/wiki/Sybil_attack\" target=\"_blank\" rel=\"noopener\">Sybil attack</a>,&#8221; a threat in peer-to-peer networks where a single entity can disrupt the system by creating, controlling, and operating a large number of fake, pseudonymous identities.<span id=\"more-73186\"></span></p>\n<p>Indeed, the number of Kimwolf-infected routers that tried to join I2P this past week was many times the network&#8217;s normal size. I2P&#8217;s <a href=\"https://en.wikipedia.org/wiki/I2P\" target=\"_blank\" rel=\"noopener\">Wikipedia page</a> says the network consists of roughly 55,000 computers distributed throughout the world, with each participant acting as both a router (to relay traffic) and a client.</p>\n<p>However, <strong>Lance James</strong>, founder of the New York City based cybersecurity consultancy <a href=\"https://unit221b.com\" target=\"_blank\" rel=\"noopener\">Unit 221B</a> and the original founder of I2P, told KrebsOnSecurity the entire I2P network now consists of between 15,000 and 20,000 devices on any given day.</p>\n<div id=\"attachment_73195\" style=\"width: 758px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73195\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73195\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-gh-graph.png\" alt=\"\" width=\"748\" height=\"812\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-gh-graph.png 825w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-gh-graph-768x834.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/i2p-gh-graph-782x849.png 782w\" sizes=\"(max-width: 748px) 100vw, 748px\" /><p id=\"caption-attachment-73195\" class=\"wp-caption-text\">An I2P user posted this graph on Feb. 10, showing tens of thousands of routers &#8212; mostly from the United States &#8212; suddenly attempting to join the network.</p></div>\n<p><strong>Benjamin Brundage</strong> is founder of <a href=\"https://synthient.com\" target=\"_blank\" rel=\"noopener\">Synthient</a>, a startup that tracks proxy services and was the first to <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" target=\"_blank\" rel=\"noopener\">document Kimwolf&#8217;s unique spreading techniques</a>. Brundage said the Kimwolf operator(s) have been trying to build a command and control network that can&#8217;t easily be taken down by security companies and network operators that are working together to combat the spread of the botnet.</p>\n<p>Brundage said the people in control of Kimwolf have been experimenting with using I2P and a similar anonymity network &#8212; <a href=\"https://www.torproject.org/\" target=\"_blank\" rel=\"noopener\">Tor</a> &#8212; as a backup command and control network, although there have been no reports of widespread disruptions in the Tor network recently.</p>\n<p>&#8220;I don&#8217;t think their goal is to take I2P down,&#8221; he said. &#8220;It&#8217;s more they&#8217;re looking for an alternative to keep the botnet stable in the face of takedown attempts.&#8221;</p>\n<p>The Kimwolf botnet created challenges for Cloudflare late last year when it began instructing millions of infected devices to use Cloudflare&#8217;s domain name system (DNS) settings, causing control domains associated with Kimwolf to <a href=\"https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/\" target=\"_blank\" rel=\"noopener\">repeatedly usurp </a><strong>Amazon</strong>, <strong>Apple</strong>, <strong>Google</strong> and <strong>Microsoft</strong> in Cloudflare’s public ranking of the most frequently requested websites.</p>\n<p>James said the I2P network is still operating at about half of its normal capacity, and that a new release is rolling out which should bring some stability improvements over the next week for users.</p>\n<p>Meanwhile, Brundage said the good news is Kimwolf&#8217;s overlords appear to have quite recently alienated some of their more competent developers and operators, leading to a rookie mistake this past week that caused the botnet&#8217;s overall numbers to drop by more than 600,000 infected systems.</p>\n<p>&#8220;It seems like they&#8217;re just testing stuff, like running experiments in production,&#8221; he said. &#8220;But the botnet&#8217;s numbers are dropping significantly now, and they don&#8217;t seem to know what they&#8217;re doing.&#8221;</p>\n",
    "description": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
    "is_fulltext": true,
    "source": "Krebs on Security",
    "pub_date": "Wed, 11 Feb 2026 16:08:11 +0000",
    "fetched_at": "2026-02-12T00:38:33.927456",
    "url_hash": "bab5ad8ce96d02f86d64dd6520a728e1"
  },
  {
    "title": "Apple Creator Studio Usage Restrictions",
    "link": "https://arstechnica.com/gadgets/2026/01/seven-things-to-know-about-how-apples-creator-studio-subscriptions-work/",
    "content": "\n<p>Andrew Cunningham, writing for Ars Technica at the end of January:</p>\n\n<blockquote>\n  <p>Apple also outlines a number of usage restrictions for the\ngenerative AI features that rely on external services. Apple says\nthat, “at a minimum,” users will be able to generate 50 images, 50\npresentations of between 8 to 10 slides each, and to generate\npresenter notes in Keynote for 700 slides. More usage may be\npossible, but this depends on “the complexity of the queries,\nserver availability, and network availability.”</p>\n</blockquote>\n\n<p><a href=\"https://mastodon.social/@stroughtonsmith/116008952067084300\">Steven Troughton-Smith</a>, last week, after creating an entire app with OpenAI’s Codex:</p>\n\n<blockquote>\n  <p>This entire app used 7% of my weekly Codex usage limit. Compare\nthat to a single (awful) slideshow in Keynote using 47% of my\nmonthly Apple Creator Studio usage limit 👀</p>\n</blockquote>\n\n<p>Something feels off here, by at least an order of magnitude (maybe two?), that creating an entire good app costs way less than creating one shitty slide deck in Keynote. It should be the other way around.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Apple Creator Studio Usage Restrictions’\"  href=\"https://daringfireball.net/linked/2026/02/11/apple-creator-studio-usage-restrictions\">&nbsp;★&nbsp;</a>\n</div>\n\n\t",
    "description": "",
    "is_fulltext": true,
    "source": "Daring Fireball",
    "pub_date": "2026-02-11T21:40:45Z",
    "fetched_at": "2026-02-12T00:38:34.470805",
    "url_hash": "22522e3028e14d73a7d454795eef11b0"
  },
  {
    "title": "Gadget Review: Epomaker TH87 ISO Mechanical Keyboard ★★★★⯪",
    "link": "https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/",
    "content": "<p>If I'm being brutally honest, I never really <em>got</em> the appeal of mechanical keyboards. There was always someone in the office who made a godawful racket hammering on their keyboard and then waxed lyrical about the merits of various switches. I'd mostly just dismissed them as cranks. I'm in love with my old <a href=\"https://shkspr.mobi/blog/2021/10/buying-obsolete-keyboards-microsoft-4000/\">Microsoft 4000 ergonomic keyboard</a>. What use could I have a mechanical keyboard festooned with lights?</p>\n\n<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/keyboard.webp\" alt=\"A brightly multicoloured mess of a keyboard with a USB cable and keytool on it.\" width=\"2040\" height=\"891\" class=\"aligncenter size-full wp-image-67568\">\n\n<p>The good folks at <a href=\"https://epomaker.com/\">Epomaker</a> want me to see the error of my ways and have sent me a couple of devices to review. Today I'm trying out the <a href=\"https://epomaker.com/products/epomaker-th87\">TH87</a> and it is surprisingly lovely!</p>\n\n<h2 id=\"blinken-lights\"><a href=\"https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/#blinken-lights\">Blinken lights!</a></h2>\n\n<p>Here's a quick video showing some of the effects.</p>\n\n<p></p><div style=\"width: 620px;\" class=\"wp-video\"><video class=\"wp-video-shortcode\" id=\"video-67546-2\" width=\"620\" height=\"349\" preload=\"metadata\" controls=\"controls\"><source type=\"video/mp4\" src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/th87-new.mp4?_=2\"><a href=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/th87-new.mp4\">https://shkspr.mobi/blog/wp-content/uploads/2026/02/th87-new.mp4</a></video></div><p></p>\n\n<p>Is this <em>necessary</em>? No! But it is jolly good fun. Probably a bit distracting - especially if you're in a dark space or a crowded office - but rather pleasing nevertheless. Switching between the effects means remembering the correct key combo - there's no way to do it programatically, you just have to cycle through them all.</p>\n\n<h2 id=\"linux-compatibility\"><a href=\"https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/#linux-compatibility\">Linux Compatibility</a></h2>\n\n<p>The TH87 comes with a USB-C to A cable. Personally, I'd've preferred straight C-C, but this does the job. Flick the switch at the back to USB mode, plug it in, and Linux instantly detected it. No drivers to configure.</p>\n\n<p>Rather cheekily, <code>lsusb</code> shows it as <code>05ac:0250 Apple, Inc. Aluminium Keyboard (ISO)</code> - there's another switch for changing between Mac and PC mode. That doesn't change how the keyboard presents itself; just the keycodes it sends.</p>\n\n<p>Oddly, there was this warning in <code>dmesg</code>:</p>\n\n<p><code>apple 0003:05AC:0250.0010: Fn key not found (Apple Wireless Keyboard clone?), disabling Fn key handling</code></p>\n\n<p>However, the function keys worked and I was able to control screen brightness etc using <kbd>Fn</kbd> and the <kbd>F1-12</kbd> keys.</p>\n\n<p>There's also a Bluetooth option. Again, Linux use was a breeze - although you'll have to remember what the pairing combo is and which device it is paired to.</p>\n\n<p>There's also a 2.4GHz option. Hidden under one of the feet is a little USB-A receiver. Again, pairing is simple - just plug it in and flick the switch.</p>\n\n<p>As expected, it also plays well with Android. The Bluetooth connection worked as did USB-OTG. Of course, quite <em>why</em> you'd want a giant heavy keyboard paired to your tiny phone is an exercise left to the reader.</p>\n\n<h2 id=\"clunk-click-every-trip\"><a href=\"https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/#clunk-click-every-trip\">Clunk Click Every Trip</a></h2>\n\n<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/02/EPOMAKER_TH87_ISO_UK_9.webp\" alt=\"A keyboard with a UK layout and lots of colourful lights.\" width=\"1131\" height=\"444\" class=\"aligncenter size-full wp-image-67566\">\n\n<p>So let's talk about noise. This keyboard is noisier than some of my other typing surfaces, but not aggressively so. Apparently it is \"pre-lubricated\" and has some noise suppression. The travel on the switches is excellent, they aren't stiff, and the whole contraption is sturdy.</p>\n\n<p>It was easy to remove the caps with the enclosed tool. I didn't bother trying to extract a switch because I'm afraid of buggering it up.</p>\n\n<h2 id=\"other-things\"><a href=\"https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/#other-things\">Other Things</a></h2>\n\n<p>Battery life is excellent - as you'd expect from a 10,000 mAh unit. It recommends charging by attaching to a computer and warns a regular charger might damage it. But, frankly, it seemed to cope just fine.</p>\n\n<p>There's no software for customising the colours or functionality. Apparently lots of mechanical keyboards run an Open Source firmware - but this appears to be proprietary.  There is some question about whether Epomaker comply with the GPL when it comes to the <a href=\"https://docs.qmk.fm/license_violations\">QMK source</a>. They appear to have <a href=\"https://github.com/Epomaker?tab=repositories\">some source code available</a> but it is hard to tell whether it exists for this specific model. I've contacted them for clarification.</p>\n\n<p>There's a <em>lot</em> of technobabble on the website. Apparently it uses \"5-Layer Sound Optimizing Design with PORON Sandwich Foam, IXPE Switch Pad, Sound Enhancement Pad, EPDM Switch Socket Pad, and Silicone Bottom\". I've no ideas what it means, but it appears important to some people.</p>\n\n<p>There's no number-pad, which is a bit of a shame. However the keyboard has a proper UK layout and is reasonably compact. Although at 1Kg it is almost as heavy as my laptop!</p>\n\n<h2 id=\"cost\"><a href=\"https://shkspr.mobi/blog/2026/02/gadget-review-epomaker-th87-iso-mechanical-keyboard/#cost\">Cost</a></h2>\n\n<p>I have no internal benchmark for something like this. It's around <a href=\"https://s.click.aliexpress.com/e/_c2RJxZJd\">£60 from AliExpress</a> or <a href=\"https://amzn.to/4qaSRMf\">£80 on Amazon UK</a> depending on whether you have pleased The Algorithm. That seems pretty reasonable for a hefty keyboard with lots of customisability.</p>\n\n<p>If you want ALL THE LIGHTS and value the ability to hot-swap various keys and switches, I think this is a nifty bit of kit.</p>\n",
    "description": "If I&#039;m being brutally honest, I never really got the appeal of mechanical keyboards. There was always someone in the office who made a godawful racket hammering on their keyboard and then waxed lyrical about the merits of various switches. I&#039;d mostly just dismissed them as cranks. I&#039;m in love with my old Microsoft 4000 ergonomic keyboard. What use could I have a mechanical keyboard festooned with …",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Wed, 11 Feb 2026 12:34:46 +0000",
    "fetched_at": "2026-02-12T00:38:41.005094",
    "url_hash": "a091f77781cff5107cdb8b0a9a784356"
  },
  {
    "title": "Matrix ain't it chief",
    "link": "https://xeiaso.net/notes/2026/dont-use-matrix/",
    "content": "\n        <p>Hey all, in light of Discord <a href=\"https://www.theverge.com/tech/875309/discord-age-verification-global-roll-out\">deciding that assuming everyone is a teenager until proven otherwise</a>, I've seen many people advocate for the use of <a href=\"https://matrix.org/\">Matrix</a> instead.</p>\n        <p>I don't have the time or energy to write a full rebuttal right now, but Matrix ain't it chief. If you have an existing highly technical community that can deal with the weird mental model leaps it's fine-ish, but the second you get anyone close to normal involved it's gonna go pear-shaped quickly.</p>\n        <p>Personally, I'm taking a wait and see approach for how the scanpocalypse rolls out. If things don't go horribly, we won't need to react really. If they do, that's a different story.</p>\n        <div class=\"flex space-x-2 bg-bg-soft dark:bg-bgDark-soft mx-auto min-h-fit\n        lg:w-[80ch] sm:w-[65ch] w-full\n        lg:p-4 p-2\n        // Base styles for all messages\n        mt-0 mb-0 rounded-none\n        // First message styles\n        first:mt-4 first:rounded-t-lg first:pb-2\n        // Last message styles\n        last:mb-4 last:rounded-b-lg last:pt-1\n        // Middle message top/bottom adjustment\n        [&amp;:not(:first-child)]:-mt-[1px] [&amp;:not(:first-child)]:py-1\"><div class=\"h-16 not-prose\"><img class=\"h-16 w-16 rounded-xs\" alt=\"Numa is smug\" loading=\"lazy\" src=\"https://stickers.xeiaso.net/sticker/numa/smug\"/></div><div class=\"flex-1 min-w-0\"><span class=\"font-semibold text-sm block mb-1\"><a href=\"https://xeiaso.net/characters#numa\">Numa</a></span><span class=\"mx-auto\"></span><div class=\"text-fg-1 dark:text-fgDark-1 text-sm prose-p:my-2\"><p>Unable to decrypt message.</p></div></div></div>\n        <p>Also hi arathorn, I know you're going to be in the replies for this one. The recent transphobic spam wave you're telling people to not talk about is the reason I will never use Matrix unless I have no other option. If you really want to prove that Matrix is a viable community platform, please start out by making it possible to filter this shit out algorithmically.</p>\n      ",
    "description": "Watch arathorn get in the replies for this one.",
    "is_fulltext": true,
    "source": "Xe Iaso's blog",
    "pub_date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-12T00:38:48.734324",
    "url_hash": "637af443b9a2b1bda5017bd6e9f652b1"
  },
  {
    "title": "How do I suppress the hover effects when I put a Win32 common controls ListView in single-click mode?",
    "link": "https://devblogs.microsoft.com/oldnewthing/20260211-00/?p=112057",
    "content": "<p>A customer had a Win32 common controls ListView in single-click mode. This has a side effect of enabling hover effects: When the mouse hovers over an item, the cursor changes to a hand, and the item gets highlighted in the hot-track color. How can they suppress these hover effects while still having single-click activation?</p>\n<p>When the user hovers over an item, the ListView sends a <code>LVN_<wbr />HOT­TRACK</code> notification, and you can suppress all hot-tracking effects by returning 1.</p>\n<pre>    // WndProc\n    case WM_NOTIFY:\n    {\n        auto nm = (NMLISTVIEW*)lParam;\n        if (nm-&gt;hdr.code == LVN_HOTTRACK)\n        {\n            return 1;\n        }\n    }\n    break;\n</pre>\n<p>If you are doing this from a dialog box, you need to set the <code>DWLP_<wbr />MSG­RESULT</code> to the desired return value, which is 1 in this case, and then return <code>TRUE</code> to say &#8220;I handled the message; use the value I put into <code>DWLP_<wbr />MSG­RESULT</code>.&#8221;</p>\n<pre>    // DlgProc\n    case WM_NOTIFY:\n    {\n        auto nm = (NMLISTVIEW*)lParam;\n        if (nm-&gt;hdr.code == LVN_HOTTRACK)\n        {\n            SetWindowLongPtr(hDlg, DWLP_MSGRESULT, 1);\n            return TRUE;\n        }\n    }\n    break;\n</pre>\n<p>The post <a href=\"https://devblogs.microsoft.com/oldnewthing/20260211-00/?p=112057\">How do I suppress the hover effects when I put a Win32 common controls ListView in single-click mode?</a> appeared first on <a href=\"https://devblogs.microsoft.com/oldnewthing\">The Old New Thing</a>.</p>\n",
    "description": "You can prevent the item from becoming hot-tracked. The post How do I suppress the hover effects when I put a Win32 common controls ListView in single-click mode? appeared first on The Old New Thing.",
    "is_fulltext": true,
    "source": "The Old New Thing",
    "pub_date": "Wed, 11 Feb 2026 15:00:00 +0000",
    "fetched_at": "2026-02-12T00:38:49.130553",
    "url_hash": "6879df4c08d9185661a54fdf05e33535"
  },
  {
    "title": "Aligning one matrix with another",
    "link": "https://www.johndcook.com/blog/2026/02/11/orthogonal-procrustes/",
    "content": "<p>Suppose you have two <em>n</em> × <em>n</em> matrices, <em>A</em> and <em>B</em>, and you would like to find a rotation matrix Ω that lines up <em>B</em> with <em>A</em>. That is, you&#8217;d like to find Ω such that</p>\n<p style=\"padding-left: 40px;\"><em>A</em> = Ω<em>B</em>.</p>\n<p>This is asking too much, except in the trivial case of <em>A</em> and <em>B</em> being 1 × 1 matrices. You could view the matrix equation above as a set of <em>n</em>² equations in real numbers, but the space of orthogonal matrices only has <em>n</em>(<em>n</em> − 1) degrees of freedom [1].</p>\n<p>When an equation doesn&#8217;t have an exact solution, the next best thing is to get as close as possible to a solution, typically in a least squares sense. The <strong>orthogonal Procrustes problem</strong> is to find an orthogonal matrix Ω minimizing the distance between <em>A</em> and Ω<em>B</em> That is, we want to minimize</p>\n<p style=\"padding-left: 40px;\">|| <em>A</em> − Ω<em>B</em> ||</p>\n<p>subject to the constraint that Ω is orthogonal. The matrix norm used in this problem is the Frobenius norm, the sum of the squares of the matrix entries. The Frobenius norm is the 2-norm if we straighten the matrices into vectors of dimension <em>n</em>².</p>\n<p>Peter Schönemann found a solution to the orthogonal Procrustes problem in 1964. His solution involves singular value decomposition (SVD). This shouldn&#8217;t be surprising since SVD solves the problem of finding the closest thing to an inverse of an non-invertible matrix. (More on that <a href=\"https://www.johndcook.com/blog/2018/05/05/svd/\">here</a>.)</p>\n<p>Schönemann&#8217;s solution is to set <em>M</em> = <em>AB</em><sup>T</sup> and find its singular value decomposition</p>\n<p style=\"padding-left: 40px;\"><em>M</em> = <em>U</em>Σ<em>V</em><sup>T</sup>.</p>\n<p>Then</p>\n<p style=\"padding-left: 40px;\">Ω = <em>UV</em><sup>T</sup>.</p>\n<h2>Python code</h2>\n<p>The following code illustrates solving the orthogonal Procrustes problem for random matrices.</p>\n<pre>import numpy as np\n\nn = 3\n\n# Generate random n x n matrices A and B\nrng = np.random.default_rng(seed=20260211) \nA = rng.standard_normal((n, n))\nB = rng.standard_normal((n, n))\n\n# Compute M = A * B^T\nM = A @ B.T\n\n# SVD: M = U * Sigma * V^T\nU, s, Vt = np.linalg.svd(M, full_matrices=False)\n\n# R = U * V^T\nR = U @ Vt\n\n# Verify that R * R^T is very nearly the identity matrix\nprint(\"||R^T R - I||_F =\", np.linalg.norm(R.T @ R - np.eye(n), ord=\"fro\"))\n</pre>\n<p>In this example the Frobenius norm between <em>RR</em><sup>T</sup> and <em>I</em> is 4 × 10<sup>−16</sup>, so essentially <em>RR</em><sup>T</sup> = <em>I</em> to machine precision.</p>\n<h2>Related posts</h2>\n<ul>\n<li class=\"link\"><a href=\"https://www.johndcook.com/blog/2018/05/06/least-squares/\">Least squares solution to over-determined systems</a></li>\n<li class=\"link\"><a href=\"https://www.johndcook.com/blog/2018/05/05/svd/\">Moore-Penrose pseudoinverse</a></li>\n<li class=\"link\"><a href=\"https://www.johndcook.com/blog/2025/05/21/drazin-pseudoinverse/\">Drazin pseudoinverse</a></li>\n</ul>\n<p>[1] Every column of an orthogonal matrix Ω must have length 1, so that gives <em>n</em> constraints. Furthermore, each pair of columns must be orthogonal, which gives <em>n</em> choose 2 more constraints. We start with Ω having <em>n</em>² degrees of freedom, but then remove <em>n</em> and then <em>n</em>(<em>n</em> − 1)/2 degrees of freedom.</p>\n<p style=\"padding-left: 40px;\"><em>n</em>² − <em>n</em> − <em>n</em>(<em>n</em> − 1)/2 = <em>n</em>(<em>n</em> − 1)/2</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/11/orthogonal-procrustes/\">Aligning one matrix with another</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "Suppose you have two n × n matrices, A and B, and you would like to find a rotation matrix Ω that lines up B with A. That is, you&#8217;d like to find Ω such that A = ΩB. This is asking too much, except in the trivial case of A and B being 1 × 1 matrices. You could [&#8230;] The post Aligning one matrix with another first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Wed, 11 Feb 2026 13:23:50 +0000",
    "fetched_at": "2026-02-12T00:39:03.399031",
    "url_hash": "6ea8c7513e7c052e6b96000b0bd0b1c6"
  },
  {
    "title": "Programming Aphorisms",
    "link": "https://matklad.github.io/2026/02/11/programming-aphorisms.html",
    "content": "\n<header>\n  <h1>Programming Aphorisms</h1>\n  <time class=\"meta\" datetime=\"2026-02-11\">Feb 11, 2026</time>\n</header>\n<p>A meta programming post — looking at my thought process when coding and trying to pin down what is\nprogramming “knowledge”. Turns out, a significant fraction of that is just reducing new problems to\na vocabulary of known tricks. This is a personal, descriptive post, not a prescriptive post for you.</p>\n<p>It starts with a question posted on Ziggit. The background here is that Zig is in the process of\nremoving ambient IO capabilities. Currently, you can access program environment from anywhere via\n<span class=\"display\"><code>std.process.getEnvVarOwned</code>.</span>\nIn the next Zig version, you’ll have to thread\n<span class=\"display\"><code>std.process.Environ.Map</code></span>\nfrom main down to every routine that needs access to the environment. In this user’s case, they have\na <code>readHistory</code> function which used to look up the path to the history file in the environment, and\nthey are wondering how to best model that in the new Zig. The options on the table are:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> readHistory</span>(</span>\n<span class=\"line\">    io: std.Io,</span>\n<span class=\"line\">    alloc: Allocator,</span>\n<span class=\"line\">    file: std.Io.File,</span>\n<span class=\"line\">) ReadHistoryError<span class=\"hl-operator\">!</span><span class=\"hl-type\">void</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> readHistory</span>(</span>\n<span class=\"line\">    io: std.Io,</span>\n<span class=\"line\">    alloc: Allocator,</span>\n<span class=\"line\">    maybe_environ_map: ?<span class=\"hl-operator\">*</span>std.process.Environ.Map,</span>\n<span class=\"line\">) ReadHistoryError<span class=\"hl-operator\">!</span><span class=\"hl-type\">void</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> readHistory</span>(</span>\n<span class=\"line\">    io: std.Io,</span>\n<span class=\"line\">    alloc: Allocator,</span>\n<span class=\"line\">    maybe_absolute_path: ?[]<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">    maybe_environ_map: ?<span class=\"hl-operator\">*</span>std.process.Environ.Map,</span>\n<span class=\"line\">) ReadHistoryError<span class=\"hl-operator\">!</span><span class=\"hl-type\">void</span>;</span></code></pre>\n\n</figure>\n<p>My starting point would instead be this:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">const</span> HistoryOptions = <span class=\"hl-keyword\">struct</span> {</span>\n<span class=\"line\">    file: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> from_environment</span>(</span>\n<span class=\"line\">        environment: <span class=\"hl-operator\">*</span><span class=\"hl-keyword\">const</span> std.process.Environ.Map,</span>\n<span class=\"line\">    ) HistoryOptions;</span>\n<span class=\"line\">};</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> readHistory</span>(</span>\n<span class=\"line\">    io: std.Io,</span>\n<span class=\"line\">    gpa: Allocator,</span>\n<span class=\"line\">    options: HistoryOptions,</span>\n<span class=\"line\">) ReadHistoryError<span class=\"hl-operator\">!</span><span class=\"hl-type\">void</span>;</span></code></pre>\n\n</figure>\n<p>In terms of meta programming, what I find fascinating is that this, for me, is both immediate (I\ndon’t have to think about it), but also is clearly decomposable into multiple factoids I’ve\naccumulated before. Here’s a deconstruction of what I did here, the verbal “labels” I use to think\nabout what I did, and where I had learned to do that:</p>\n<p><em>First</em>, I “raised the abstraction level” by giving <em>it</em> a name and a type (<code>HistoryOptions</code>). This\nis a rare transformation which I learned and named myself. Naming is important for my thinking and\ncommunicating process. “Let’s raise abstraction level” is a staple code review comment of mine.</p>\n<p><em>Second</em>, I avoided “midlayer mistake” by making sure that every aspect of options is\nuser-configurable. Easy to do in Zig, where all fields are public. I learned about\n<a href=\"https://lwn.net/Articles/336262/\">midlayer mistake</a> from a GitHub comment by\n<a href=\"https://joshtriplett.org\">Josh Triplett</a>.</p>\n<p><em>Third</em>, I provided a “shortcut”, the\n<span class=\"display\"><code>from_environment</code></span>\nconvenience function that cuts across abstraction layers. I learned the “shortcut” aphorism from\n<a href=\"https://spookylukey.github.io/django-views-the-right-way/detail-view.html#discussion-layering-violations-shortcuts-vs-mixins\"><em>Django Views — The Right Way</em>.</a>\nGermane to the present article, I read that post a decade after I had touched Django the last time.\nIt was useless to me on the object level. On the meta level, reading the article solidified and\n<em>named</em> several programming tricks for me. See reverberations in\n<a href=\"https://rust-analyzer.github.io/blog/2020/09/28/how-to-make-a-light-bulb.html\"><em>How to Make a 💡?</em>.</a></p>\n<p><em>Fourth</em>, I instinctively renamed <code>alloc</code> to “gpa” (in opposition to “arena”), the naming I spotted\nin the Zig compiler.</p>\n<p><em>Fifth</em>, I named the configuration parameter “options”, not <code>config</code>, <code>props</code> or <code>params</code>, a naming\nscheme I learned at TigerBeetle.</p>\n<p><em>Sixth</em>, I made sure that the signature follows “positional DI” scheme. Arguments that are\ndependencies, resources with unique types are injected positionally (and have canonical names like\n<code>io</code> or <code>gpa</code>). Arguments that <em>directly</em> vary the behavior of function (as opposed to affecting\ntransitive callees) are passed by name, in the <code>Options</code> struct.</p>\n<p>To be specific, I don’t claim that my snippet is the right way to do this! I have no idea, as I\ndon’t have access to the full context. Rather, if I were <em>actually</em> solving the problem, the snippet\nabove would be my initial starting point for further iteration.</p>\n<p>Note that I also don’t explain <em>why</em> I am doing the above six things, I only name them and point at\nthe origin. Actually explaining the <em>why</em> would take a blog post of its own for every one of them.</p>\n<p>And this is I think the key property of my thought process — I have a bag of tricks, where the\ntricks are named. Inside my mind, this label points both to the actual trick (code to type),\nas well as a justification for it (in what context that would be a good trick to use).</p>\n<p>And I use these tricks all the time, literally! Just answering in passing to a forum comment makes\nme grab a handful! A lot of my knowledge is structured like a book of coding aphorisms.</p>\n<hr>\n<p>Meta meta — how come I have acquired all those tricks? I read voraciously, random commits, issues,\njumping enthusiastically into rabbit holes and going on wiki trips. The key skill here is\nrecognizing an aphorism once you see it. Reading Ziggit is part of trick-acquisition routine for\nme. Having learned the trick, I remember it, where “remembering” is an act of active recall at the\nopportune moment. This recall powers “horizontal gene transfer” across domains, stealing shortcuts\nfrom Django and midlayer mistake from the kernel. Did you notice that applying “horizontal gene\ntransfer” to the domain of software engineering tacit knowledge is horizontal gene transfer? When\nentering a new domain, I actively seek out the missing tricks. I am relatively recent in Zig, but\nall the above tricks are either Zig native, or at least Zig adapted. Every once in a while, I\n“invent” a trick of my own. For example, “positional DI” is something I only verbalized last year.\nThis doesn’t mean I hadn’t been doing that before, just that the activity wasn’t mentally labeled as\na separate thing you can deliberately do. I had the idea, now I also have an aphorism.</p>\n",
    "description": "A meta programming post --- looking at my thought process when coding and trying to pin down what is programming knowledge. Turns out, a significant fraction of that is just reducing new problems to a vocabulary of known tricks. This is a personal, descriptive post, not a prescriptive post for you.",
    "is_fulltext": true,
    "source": "matklad",
    "pub_date": "2026-02-11T00:00:00+00:00",
    "fetched_at": "2026-02-12T00:39:05.257089",
    "url_hash": "e7d9c395c5f5cfc36a79b88a84619427"
  },
  {
    "title": "Proving What's Possible",
    "link": "https://buttondown.com/hillelwayne/archive/proving-whats-possible/",
    "content": "\n<p>As a formal methods consultant I have to mathematically express properties of systems. I generally do this with two \"temporal operators\": </p>\n<ul>\n<li>A(x) means that <code>x</code> is always true. For example, a database table <em>always</em> satisfies all record-level constraints, and a state machine <em>always</em> makes valid transitions between states. If <code>x</code> is a statement about an individual state (as in the database but not state machine example), we further call it an <strong>invariant</strong>.</li>\n<li>E(x) means that <code>x</code> is \"eventually\" true, conventionally meaning \"guaranteed true at some point in the future\". A database transaction <em>eventually</em> completes or rolls back, a state machine <em>eventually</em> reaches the \"done\" state, etc. </li>\n</ul>\n<p>These come from linear temporal logic, which is the mainstream notation for expressing system properties. <sup id=\"fnref:modal\"><a class=\"footnote-ref\" href=\"#fn:modal\">1</a></sup> We like these operators because they elegantly cover <a href=\"https://www.hillelwayne.com/post/safety-and-liveness/\" target=\"_blank\">safety and liveness properties</a>, and because <a href=\"https://buttondown.com/hillelwayne/archive/formalizing-stability-and-resilience-properties/\" target=\"_blank\">we can combine them</a>. <code>A(E(x))</code> means <code>x</code> is true an infinite number of times, while <code>A(x =&gt; E(y)</code> means that <code>x</code> being true guarantees <code>y</code> true in the future. </p>\n<p>There's a third class of properties, that I will call <em>possibility</em> properties: <code>P(x)</code> is \"can x happen in this model\"? Is it possible for a table to have more than ten records? Can a state machine transition from \"Done\" to \"Retry\", even if it <em>doesn't</em>? Importantly, <code>P(x)</code> does not need to be possible <em>immediately</em>, just at some point in the future. It's possible to lose 100 dollars betting on slot machines, even if you only bet one dollar at a time. If <code>x</code> is a statement about an individual state, we can further call it a <a href=\"https://en.wikipedia.org/wiki/Reachability\" target=\"_blank\"><em>reachability</em> property</a>. I'm going to use the two interchangeably for flow. </p>\n<p><code>A(P(x))</code> says that <code>x</code> is <em>always</em> possible. No matter what we've done in our system, we can make <code>x</code> happen again. There's no way to do this with just <code>A</code> and <code>E</code>. Other meaningful combinations include:</p>\n<ul>\n<li><code>P(A(x))</code>: there is a reachable state from which <code>x</code> is always true.</li>\n<li><code>A(x =&gt; P(y))</code>: <code>y</code> is possible from any state where <code>x</code> is true.</li>\n<li><code>E(x &amp;&amp; P(y))</code>: There is always a future state where x is true and y is reachable.</li>\n<li><code>A(P(x) =&gt; E(x))</code>: If <code>x</code> is ever possible, it will eventually happen.</li>\n<li><code>E(P(x))</code> and <code>P(E(x))</code> are the same as <code>P(x)</code>.</li>\n</ul>\n<p>See the paper <a href=\"https://dl.acm.org/doi/epdf/10.1145/567446.567463\" target=\"_blank\">\"Sometime\" is sometimes \"not never\"</a> for a deeper discussion of <code>E</code> and <code>P</code>.</p>\n<h3>The use case</h3>\n<p>Possibility properties are \"something good <em>can</em> happen\", which is generally less useful (<em>in specifications</em>) than \"something bad <em>can't</em> happen\" (safety) and \"something good <em>will</em> happen\" (liveness). But it still comes up as an important property! My favorite example:</p>\n<p><img alt=\"A guy who can't shut down his computer because system preferences interrupts shutdown\" class=\"newsletter-image\" src=\"https://www.hillelwayne.com/post/safety-and-liveness/img/tweet2.png\" /></p>\n<p>The big use I've found for the idea is as a sense-check that we wrote the spec properly. Say I take the property \"A worker in the 'Retry' state eventually leaves that state\":</p>\n<div class=\"codehilite\"><pre><span></span><code>A(state == &#39;Retry&#39; =&gt; E(state != &#39;Retry&#39;))\n</code></pre></div>\n\n<p>The model checker checks this property and confirms it holds of the spec. Great! Our system is correct! ...Unless the system can never <em>reach</em> the \"Retry\" state, in which case the expression is trivially true. I need to verify that 'Retry' is reachable, eg <code>P(state == 'Retry')</code>. Notice I can't use <code>E</code> to do this, because I don't want to say \"the worker always needs to retry at least once\". </p>\n<h3>It's not supported though</h3>\n<p>I say \"use I've found for <em>the idea</em>\" because the main formalisms I use (Alloy and TLA+) don't natively support <code>P</code>. <sup id=\"fnref:tla\"><a class=\"footnote-ref\" href=\"#fn:tla\">2</a></sup> On top of <code>P</code> being less useful than <code>A</code> and <code>E</code>, simple reachability properties are <a href=\"https://www.hillelwayne.com/post/software-mimicry/\" target=\"_blank\">mimickable</a> with A(x). <code>P(x)</code> <em>passes</em> whenever <code>A(!x)</code> <em>fails</em>, meaning I can verify <code>P(state == 'Retry')</code> by testing that <code>A(!(state == 'Retry'))</code> finds a counterexample. We <em>cannot</em> mimic combined operators this way like <code>A(P(x))</code> but those are significantly less common than state-reachability. </p>\n<p>(Also, refinement doesn't preserve possibility properties, but that's a whole other kettle of worms.)</p>\n<p>The one that's bitten me a little is that we can't mimic \"<code>P(x)</code> from every starting state\". \"<code>A(!x)</code>\" fails if there's at least one path from one starting state that leads to <code>x</code>, but other starting states might not make <code>x</code> possible.</p>\n<p>I suspect there's also a chicken-and-egg problem here. Since my tools can't verify possibility properties, I'm not used to noticing them in systems. I'd be interested in hearing if anybody works with codebases where possibility properties are important, especially if it's something complex like <code>A(x =&gt; P(y))</code>.</p>\n<div class=\"footnote\">\n<hr />\n<ol>\n<li id=\"fn:modal\">\n<p>Instead of <code>A(x)</code>, the literature uses <code>[]x</code> or <code>Gx</code> (\"globally x\") and instead of <code>E(x)</code> it uses <code>&lt;&gt;x</code> or <code>Fx</code> (\"finally x\"). I'm using A and E because this isn't teaching material.&#160;<a class=\"footnote-backref\" href=\"#fnref:modal\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:tla\">\n<p>There's <a href=\"https://github.com/tlaplus/tlaplus/issues/860\" target=\"_blank\">some discussion to add it to TLA+, though</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:tla\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>\n",
    "description": "As a formal methods consultant I have to mathematically express properties of systems. I generally do this with two \"temporal operators\": A(x) means that x is always true. For example, a database table always satisfies all record-level constraints, and a state machine always makes valid transitions between states. If x is a statement about an individual state (as in the database but not state machine example), we further call it an invariant. E(x) means that x is \"eventually\" true, conventionall",
    "is_fulltext": true,
    "source": "Computer Things",
    "pub_date": "Wed, 11 Feb 2026 18:36:53 +0000",
    "fetched_at": "2026-02-12T00:39:14.887193",
    "url_hash": "6704b84d2036fac5fc6484fc86f7743d"
  },
  {
    "title": "Unresponsive Buttons on My Fastest Hardware Ever",
    "link": "https://blog.jim-nielsen.com/2026/unresponsive-buttons/",
    "content": "<p>This is one of those small things that drives me nuts.</p>\n<p>Why? I don’t know. I think it has something to do with the fact that I have a computer that is faster than any computer I’ve ever used in my entire life — and yet, clicking on buttons results in slight but perceptible delays.</p>\n<p>Let me explain.</p>\n<p>Imagine a button that looks like this:</p>\n<pre><code class=\"language language-jsx\">&lt;<span class=\"hljs-title class_\">Button</span>\n  onClick={<span class=\"hljs-title function_\">async</span> () =&gt; {\n    <span class=\"hljs-keyword\">const</span> data = <span class=\"hljs-keyword\">await</span> <span class=\"hljs-title function_\">getSessionUrlFromStripe</span>(id);\n    <span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-property\">location</span> = data.<span class=\"hljs-property\">url</span>;\n  }\n&gt;<span class=\"hljs-title class_\">Upgrade</span> to <span class=\"hljs-title class_\">Pro</span>&lt;/<span class=\"hljs-title class_\">Button</span>&gt;\n</code></pre>\n<p>For SPA apps, when the user clicks that button it takes a split second (even on a fast connection) for anything to happen because:</p>\n<ul>\n<li>The browser makes a request to the server</li>\n<li>The server talks to Stripe to get a session</li>\n<li>The server responds with the session data to the client</li>\n<li>The client redirects</li>\n</ul>\n<p>When clicking on that button, even on a fast connection, my brain glitches for a second, my thought process going something like:</p>\n<ul>\n<li>I click</li>\n<li>[nothing happens]</li>\n<li>I think “Did that work?”</li>\n<li>Just as I’m about to click again, I see the URL bar change</li>\n<li>I think, “Oh, ok, it’s doing <em>something</em>.”</li>\n<li>I stop myself from clicking again while I wait for the UI to redraw</li>\n</ul>\n<p>Granted those thoughts occur in my brain in under a second, but I hate that pause of indetermination.</p>\n<p>I clicked, I want (perceptibly) <em>instant</em> feedback. If something is happening, tell me!</p>\n<p>For SPA apps, you could put some state in there, like:</p>\n<pre><code class=\"language language-jsx\"><span class=\"hljs-keyword\">const</span> [isLoading, setIsLoading] = <span class=\"hljs-title function_\">useState</span>(<span class=\"hljs-literal\">false</span>);\n\n<span class=\"hljs-keyword\">return</span> (\n  <span class=\"language-xml\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">Button</span>\n  <span class=\"hljs-attr\">onClick</span>=<span class=\"hljs-string\">{async</span> () =&gt;</span> {\n    setIsLoading(true);\n    const data = await getSessionUrlFromStripe(id);\n    window.location = data.url;\n  }\n  &gt;{isLoading ? &#x27;Upgrading...&#x27; : &#x27;Upgrade to Pro&#x27;}<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">Button</span>&gt;</span></span>\n)\n</code></pre>\n<p>This would provide more immediate feedback. But it also raises a whole set of other questions:</p>\n<ul>\n<li>Is that actually the interaction you want, where the text changes? That’s probably gonna shift layout. Maybe you want something different, like a spinner in place of the text. How do you handle that?</li>\n<li>What if you have multiple places to upgrade? Do you have to implement <code>isLoading</code> state in all those places too? What if the trigger in each place is slightly different? A button here, some text there, and icon over yonder? How do you handle all of those different interactions in a standard, immediate way?</li>\n<li>Errors. What if it fails? Well, we already weren’t handling that in the first code example were we? But maybe we should…</li>\n</ul>\n<p>Oh boy, this is getting complicated isn’t it?</p>\n<p>This is why, I assume, lots of apps just don’t deal with it. </p>\n<p>They accept there will be a slight delay in the responsiveness of the UI (and that it might error, but the user can just click again) and justify that it’s really not that big of a deal if there’s a slight, almost imperceptible delay between clicking a button and seeing the UI respond.</p>\n<p>“We’ve got bigger fish to fry.”</p>\n<p>And it makes sense. I mean, a slight delay in UI responsiveness, is that why people will or won’t buy your thing? Seems like a small detail. Who’s got the time to spend on details like this?Who cares? </p>\n<p>I care. That’s why I’m writing this post.</p>\n<p>To my original point, every piece of hardware I currently own is the fastest version of that device I’ve ever had in my life. And yet, everywhere I go I encounter lag. <a href=\"https://world.hey.com/jason/the-big-regression-da7fc60d\" >Lag everywhere.</a></p>\n<p>And I’m grumpy about it, hence this post.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a\n        href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/unresponsive-buttons/\"\n        >Email</a\n      >\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>\n\n    \n  ",
    "description": "This is one of those small things that drives me nuts. Why? I don’t know. I think it has something to do with the fact that I have a computer that is faster than any computer I’ve ever used in my entire life — and yet, clicking on buttons results in slight but perceptible delays. Let me explain. Imagine a button that looks like this: &lt;Button onClick={async () =&gt; { const data = await getSessionUrlFromStripe(id); window.location = data.url; } &gt;Upgrade to Pro&lt;/Button&gt; For SPA apps, w",
    "is_fulltext": true,
    "source": "Jim Nielsen’s Blog",
    "pub_date": "Wed, 11 Feb 2026 19:00:00 GMT",
    "fetched_at": "2026-02-12T00:39:19.865434",
    "url_hash": "b9ccbd69023aa079fcba21e3d01e059c"
  }
]