[
  {
    "title": "Quoting Thariq Shihipar",
    "link": "https://simonwillison.net/2026/Feb/20/thariq-shihipar/#atom-everything",
    "content": "\n    <blockquote cite=\"https://twitter.com/trq212/status/2024574133011673516\"><p>Long running agentic products like Claude Code are made feasible by prompt caching which allows us to reuse computation from previous roundtrips and significantly decrease latency and cost. [...]</p>\n<p>At Claude Code, we build our entire harness around prompt caching. A high prompt cache hit rate decreases costs and helps us create more generous rate limits for our subscription plans, so we run alerts on our prompt cache hit rate and declare SEVs if they're too low.</p></blockquote>\n<p class=\"cite\">&mdash; <a href=\"https://twitter.com/trq212/status/2024574133011673516\">Thariq Shihipar</a></p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/prompt-engineering\">prompt-engineering</a>, <a href=\"https://simonwillison.net/tags/anthropic\">anthropic</a>, <a href=\"https://simonwillison.net/tags/claude-code\">claude-code</a>, <a href=\"https://simonwillison.net/tags/ai-agents\">ai-agents</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a></p>\n\n\n\n",
    "description": "Long running agentic products like Claude Code are made feasible by prompt caching which allows us to reuse computation from previous roundtrips and significantly decrease latency and cost. [...] At Claude Code, we build our entire harness around prompt caching. A high prompt cache hit rate decreases costs and helps us create more generous rate limits for our subscription plans, so we run alerts on our prompt cache hit rate and declare SEVs if they're too low. &mdash; Thariq Shihipar Tags: promp",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-20T07:13:19+00:00",
    "fetched_at": "2026-02-20T12:19:17.336703",
    "url_hash": "011013b122bcfb43c9a7010e782434e5"
  },
  {
    "title": "Life Update: On medical leave",
    "link": "https://xeiaso.net/notes/2026/life-update-medical-leave/",
    "content": "\n        <p>Hey all, I hope you're doing well.</p>\n        <p>I'm going to be on medical leave until early April. If you are <a href=\"https://sponsors.xeiaso.net/\">a sponsor</a>, then you can join the Discord for me to post occasional updates in real time. I'm gonna be in the hospital for at least a week as of the day of this post.</p>\n        <p>I have a bunch of things queued up both <a href=\"https://www.tigrisdata.com/blog\">at work</a> and on this blog. Please do share them when you see them cross your feeds, I hope that they'll be as useful as my posts normally are. I'm under a fair bit of stress leading up to this medical leave and I'm hoping that my usual style shines through as much as I hope it is. Focusing on writing is hard when the Big Anxiety is hitting as hard as it is.</p>\n        <p>Don't worry about me. I want you to be happy for me. This is very good medical leave. I'm not going to go into specifics for privacy reasons, but know that this is something I've wanted to do for over a decade but haven't gotten the chance due to the timing never working out.</p>\n        <p>I'll see you on the other side. Stay safe out there.</p>\n        <p>Xe</p>\n      ",
    "description": "Taking some time off for medical reasons until early April",
    "is_fulltext": true,
    "source": "Xe Iaso's blog",
    "pub_date": "Fri, 20 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-20T12:19:32.363569",
    "url_hash": "881ae22e1d51c616f8ec3991c1aebdc3"
  },
  {
    "title": "ActivityPub",
    "link": "https://nesbitt.io/2026/02/20/activitypub.html",
    "content": "<p><strong>ActivityPub</strong> is a federated protocol used by public houses in the United Kingdom and the Republic of Ireland for announcing scheduled events, drink promotions, and community activities to patrons and the wider neighbourhood. Each participating pub operates as an independent <strong>instance</strong>, maintaining its own chalkboard and event schedule while optionally sharing activity information with other instances in the network. First formalised in the early 18th century, the protocol remains in widespread use today, with an estimated 46,000 active instances across the British Isles as of 2024.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">1</a></sup></p>\n\n<p>The broader network of interconnected pubs implementing the protocol is colloquially known as the <strong>fediverse</strong> (a portmanteau of “federated” and “diverse,” referring to the range of establishments involved, from village locals to central London gastropubs). Individual participants in the protocol are referred to as <strong>actors</strong>, a category that includes landlords, bar staff, and in some implementations, particularly opinionated regulars.<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">2</a></sup></p>\n\n<h2 id=\"etymology\">Etymology</h2>\n\n<p>The term derives from the compound of “activity” (from Latin <em>activitas</em>, meaning “a doing”) and “pub” (a contraction of “public house”). The earliest known written use appears in a 1714 licensing petition from a Southwark innkeeper requesting permission to “maintain an Activity Pub board of not less than three feet in width” outside his premises.<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">3</a></sup> Earlier informal references to “the activity of the pub” appear in parish records from the 1680s, though scholars debate whether these constitute use of the compound noun or merely coincidental adjacency.<sup id=\"fnref:4\"><a href=\"#fn:4\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">4</a></sup></p>\n\n<h2 id=\"history\">History</h2>\n\n<h3 id=\"origins\">Origins</h3>\n\n<p>Prior to formalisation, British pubs communicated their activities through a variety of ad hoc methods, including town criers, word of mouth, and what the brewing historian Margaret Eaves has termed “aggressive loitering” — the practice of landlords standing in doorways and shouting at passers-by.<sup id=\"fnref:5\"><a href=\"#fn:5\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">5</a></sup> The lack of standardisation led to significant confusion. A 1702 pamphlet from the Borough of Lewes describes a man who attended three consecutive funerals at The King’s Head under the impression they were cheese tastings, the landlord’s handwriting being “of such character as to render all notices indistinguishable.”<sup id=\"fnref:6\"><a href=\"#fn:6\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">6</a></sup></p>\n\n<h3 id=\"chalkboard-era-17141980s\">Chalkboard era (1714–1980s)</h3>\n\n<p>The Publican Notices Act of 1714 required all licensed premises to maintain a visible board, specifying chalk on dark-painted board but no format. Historians call the resulting chaos the “Great Inconsistency” — a period in which no two instances in England announced events in the same way.<sup id=\"fnref:7\"><a href=\"#fn:7\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">7</a></sup></p>\n\n<p>Some publicans listed events chronologically. Others grouped them by type. A celebrated board at The Lamb and Flag in Oxford listed everything alphabetically, meaning that “Arm Wrestling (Tuesdays)” perpetually appeared above “Wednesday Pie Night,” causing regulars to arrive on the wrong day with a frequency that the landlord described in his diary as “unwavering.”<sup id=\"fnref:8\"><a href=\"#fn:8\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">8</a></sup></p>\n\n<h3 id=\"the-federation-question\">The Federation Question</h3>\n\n<p>By the mid-19th century, the growth of brewery-owned tied houses created pressure for a more consistent protocol. In 1872, the United Brewers’ Federation published <em>Recommendations for the Uniform Display of Pub Activities</em>, the first formal specification. The document established conventions still recognisable today: the use of a header line identifying the instance, a chronological listing of weekly events, and the now-ubiquitous phrase “ALL WELCOME” at the bottom, regardless of whether this was true.<sup id=\"fnref:9\"><a href=\"#fn:9\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">9</a></sup></p>\n\n<p>The specification was not universally adopted. Free houses resisted what they termed “the tyranny of federation,” and several publicans in the West Country continued to announce events exclusively through the medium of poetry well into the 1920s. A board outside The Bell in Frome reportedly read, in its entirety: “Come Thursday next for song and ale / The pork will not be stale.”<sup id=\"fnref:10\"><a href=\"#fn:10\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">10</a></sup></p>\n\n<p>The question of <strong>defederation</strong> — the deliberate severing of communication between instances — first arose during this period. A group of temperance-adjacent pubs in Birmingham refused to acknowledge or relay event information from establishments they considered excessively rowdy, a practice that the publicans of Digbeth described as “the cold shoulder, applied at institutional scale.”<sup id=\"fnref:11\"><a href=\"#fn:11\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">11</a></sup> The practice persists today; a 2023 survey found that 12% of pubs actively defederate from at least one neighbouring instance, most commonly over noise complaints, poaching of quiz teams, or “personal reasons the landlord declined to elaborate on.”<sup id=\"fnref:12\"><a href=\"#fn:12\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">12</a></sup></p>\n\n<h3 id=\"digital-transition\">Digital transition</h3>\n\n<p>The introduction of social media in the early 21st century created a schism in the ActivityPub community. A faction of publicans, predominantly in urban areas, began duplicating their chalkboard announcements on Facebook and Instagram, leading to what the <em>Morning Advertiser</em> described in 2016 as “a crisis of protocol.”<sup id=\"fnref:13\"><a href=\"#fn:13\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">13</a></sup> Traditionalists argued that the canonical source of pub activity information must remain the physical board, and that digital copies were inherently unreliable due to the tendency of pub social media accounts to also post photographs of dogs and unsolicited opinions about the weather.</p>\n\n<p>The controversy intensified when several landlords began <strong>boosting</strong> — the practice of reproducing another pub’s activity announcements on one’s own board, typically to alert followers of events at nearby instances. While some viewed this as a natural extension of the federated model, others considered it a breach of etiquette. A landlord in Stoke Newington was reportedly barred from three neighbouring pubs in 2019 after boosting their curry night announcements with the annotation “OURS IS BETTER.”<sup id=\"fnref:14\"><a href=\"#fn:14\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">14</a></sup></p>\n\n<p>In 2018, the Campaign for Real Ale (CAMRA) published a position paper titled <em>ActivityPub: Preserving the Chalkboard Standard</em>, which argued that the physical board remained “the only trustworthy and fully decentralised method of communicating pub activities,” noting that it required no internet connection, could not be algorithmically suppressed, and was resistant to outages except in cases of rain or vandalism.<sup id=\"fnref:15\"><a href=\"#fn:15\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">15</a></sup></p>\n\n<h2 id=\"protocol-specification\">Protocol specification</h2>\n\n<h3 id=\"actors\">Actors</h3>\n\n<p>The protocol defines three categories of <strong>actor</strong>:</p>\n\n<ul>\n  <li><strong>Instance administrators</strong> (landlords and landladies): responsible for maintaining the board, scheduling activities, and exercising moderation powers including the authority to <strong>block</strong> disruptive patrons.</li>\n  <li><strong>Staff actors</strong>: permitted to update the board on behalf of the administrator, though in practice often reluctant to do so on grounds that “it’s not my handwriting” or “I wasn’t told we’d stopped doing Wednesdays.”</li>\n  <li><strong>Followers</strong> (regulars): actors who have established a persistent relationship with a specific instance. A patron becomes a follower through repeated attendance; no formal subscription mechanism exists, though some pubs maintain a mailing list which nobody reads.<sup id=\"fnref:16\"><a href=\"#fn:16\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">16</a></sup></li>\n</ul>\n\n<p>The question of <strong>account migration</strong> — the process by which a follower transfers their primary allegiance from one instance to another — is considered one of the most socially fraught aspects of the protocol. Etiquette varies by region, but it is generally understood that a regular who begins frequenting a different pub should not be seen doing so by staff of the former instance, particularly if the new one is visible from the old one.<sup id=\"fnref:17\"><a href=\"#fn:17\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">17</a></sup></p>\n\n<h3 id=\"inbox-and-outbox\">Inbox and outbox</h3>\n\n<p>Each instance maintains two conceptual message stores:</p>\n\n<ul>\n  <li>The <strong>outbox</strong>: the externally facing chalkboard, A-board, or other display visible to the public. This is the primary publication mechanism of the protocol.</li>\n  <li>The <strong>inbox</strong>: traditionally a physical letterbox, noticeboard, or corner of the bar where community notices, band flyers, and unsolicited offers of DJ services accumulate. The inbox is write-only in practice; items deposited there are seldom read by the instance administrator and are periodically discarded in bulk during cleaning.<sup id=\"fnref:18\"><a href=\"#fn:18\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">18</a></sup></li>\n</ul>\n\n<p>Message delivery between instances occurs through a process known as <strong>inbox forwarding</strong>, in which a patron who has seen an activity announced at one pub mentions it at another. The reliability of this mechanism depends entirely on the patron’s memory, sobriety, and willingness to relay information accurately. Studies suggest a message corruption rate of approximately 40% per hop, rising to 70% after 10pm.<sup id=\"fnref:19\"><a href=\"#fn:19\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">19</a></sup></p>\n\n<h3 id=\"format\">Format</h3>\n\n<p>While no single format is mandated, the <em>de facto</em> standard for a compliant ActivityPub board includes the following elements:</p>\n\n<ul>\n  <li><strong>Header</strong>: The name of the instance, often rendered in a larger or more decorative hand than the body text.</li>\n  <li><strong>Body</strong>: A chronological list of upcoming activities, typically covering the current week.</li>\n  <li><strong>Footer</strong>: A welcoming statement and/or the price of the current guest ale.</li>\n</ul>\n\n<p>Activities are generally expressed as a tuple of day, time, and event name, e.g. “THURSDAY 8PM — QUIZ NIGHT.” The use of exclamation marks is permitted but discouraged by CAMRA guidelines, which state that “the activities of a well-run pub should speak for themselves.”<sup id=\"fnref:20\"><a href=\"#fn:20\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">20</a></sup></p>\n\n<p>An early attempt to introduce a structured notation for chalkboard content, known as <strong>JSON-LD</strong> (Joint Standardised Notation for Leisure Displays), was proposed by a committee of the British Beer and Pub Association in 2004. The notation required events to be written in a rigid format with bracketed metadata: “[TYPE:quiz][DAY:thu][TIME:20:00] QUIZ NIGHT.” It was trialled at four pubs in Reading and abandoned within a week after staff refused to use it on grounds that it “looked like someone had a stroke while writing the board.”<sup id=\"fnref:21\"><a href=\"#fn:21\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">21</a></sup></p>\n\n<h3 id=\"content-warnings\">Content warnings</h3>\n\n<p>Some instances prepend <strong>content warnings</strong> to specific activity announcements, alerting patrons to potentially divisive content. Common content warnings include “karaoke,” “DJ Dave,” “under-12s welcome,” and “the landlord’s band.” CAMRA guidelines suggest that content warnings should be used “sparingly and only where the nature of the activity might cause a patron to make alternative plans,” though in practice the mere presence of a content warning has been shown to increase attendance by 15%, curiosity being more powerful than caution.<sup id=\"fnref:22\"><a href=\"#fn:22\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">22</a></sup></p>\n\n<h3 id=\"webfinger\">WebFinger</h3>\n\n<p>The <strong>WebFinger</strong> protocol provides a mechanism for identifying which instance a given actor is primarily associated with. In its traditional implementation, a patron entering an unfamiliar pub would ask a member of staff, “Do you know [name]?” — a lookup request that, if successful, would return the actor’s home instance (e.g., “Oh, Dave? He’s usually at The Crown on Thursdays”). The protocol is named for the physical gesture that typically accompanies the response: a pointed finger indicating the direction of the referenced establishment.<sup id=\"fnref:23\"><a href=\"#fn:23\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">23</a></sup></p>\n\n<p>WebFinger queries are subject to privacy considerations. A 2019 CAMRA position paper noted that “no patron should be identifiable to a third party through their pub associations without prior consent,” though it acknowledged that in villages with populations under 500, the protocol was “largely redundant, everyone already knowing where everyone drinks and, frequently, how much.”<sup id=\"fnref:24\"><a href=\"#fn:24\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">24</a></sup></p>\n\n<h3 id=\"supported-activity-types\">Supported activity types</h3>\n\n<p>The protocol supports an effectively unlimited range of activity types, though analysis of 12,000 instances conducted by the University of Sheffield in 2019 found that 94% of all announced activities fell into one of the following categories:<sup id=\"fnref:25\"><a href=\"#fn:25\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">25</a></sup></p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Activity</th>\n      <th>Frequency</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Quiz night</td>\n      <td>89%</td>\n    </tr>\n    <tr>\n      <td>Live music (unspecified)</td>\n      <td>72%</td>\n    </tr>\n    <tr>\n      <td>Curry night</td>\n      <td>54%</td>\n    </tr>\n    <tr>\n      <td>Open mic</td>\n      <td>41%</td>\n    </tr>\n    <tr>\n      <td>Meat raffle</td>\n      <td>38%</td>\n    </tr>\n    <tr>\n      <td>Pub quiz (distinct from quiz night, for reasons that remain unclear)</td>\n      <td>27%</td>\n    </tr>\n    <tr>\n      <td>Karaoke</td>\n      <td>24%</td>\n    </tr>\n    <tr>\n      <td>Bingo</td>\n      <td>19%</td>\n    </tr>\n    <tr>\n      <td>“Live Sport”</td>\n      <td>18%</td>\n    </tr>\n    <tr>\n      <td>Psychic night</td>\n      <td>4%</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The study noted that “psychic night” appeared almost exclusively in pubs in the North West of England, and that none of them had predicted the study’s findings.<sup id=\"fnref:25:1\"><a href=\"#fn:25\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">25</a></sup></p>\n\n<h3 id=\"interoperability\">Interoperability</h3>\n\n<p>Interoperability between instances remains a challenge. A 2022 trial at a Wetherspoons in Basingstoke attempted to introduce machine-readable QR codes linking to event listings, but was abandoned after three weeks when it was discovered that the code linked to the pub’s 2017 menu and nobody had noticed.<sup id=\"fnref:27\"><a href=\"#fn:27\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">26</a></sup></p>\n\n<p>Several alternative implementations of the protocol have emerged over the years. <strong>The Mastodon</strong> (a pub in Finsbury Park, London) briefly operated a system in which events were announced by means of a large brass horn mounted above the door, sounded at 500-character intervals. Complaints from neighbours led to the horn’s removal in 2017, though the pub continues to operate a compliant ActivityPub instance using conventional chalk.<sup id=\"fnref:28\"><a href=\"#fn:28\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">27</a></sup></p>\n\n<h2 id=\"governance\">Governance</h2>\n\n<p>ActivityPub has no single governing body. CAMRA publishes advisory guidelines, and the British Beer and Pub Association maintains a best-practice document, but compliance is voluntary. A <strong>W3C</strong> (Wessex, Wales, and Cornwall Committee) working group was established in 2015 to develop a formal standard but was dissolved in 2018 after failing to reach consensus on whether “happy hour” constituted an activity or a pricing policy.<sup id=\"fnref:29\"><a href=\"#fn:29\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">28</a></sup></p>\n\n<p>In practice, the protocol is governed by what the sociologist Dennis Ethernet has called “the distributed authority of regulars” — a system in which factual errors on a pub’s activity board are corrected not by any formal mechanism but by a patron mentioning it to the landlord, who may or may not act on the information depending on whether they are busy, whether they can find the chalk, and whether they consider the error material.<sup id=\"fnref:30\"><a href=\"#fn:30\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">29</a></sup></p>\n\n<p>Instance <strong>moderation</strong> is handled exclusively by the landlord or designated staff. Moderation actions include verbal warnings, temporary suspensions (“you’ve had enough, come back tomorrow”), and permanent blocks, colloquially known as “barrings.” Unlike digital implementations, there is no appeals process, though a blocked actor may submit an informal unblock request by appearing contrite and buying the administrator a drink.<sup id=\"fnref:31\"><a href=\"#fn:31\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">30</a></sup></p>\n\n<h2 id=\"criticism\">Criticism</h2>\n\n<p>Critics have noted that the ActivityPub protocol suffers from several persistent issues:</p>\n\n<ul>\n  <li><strong>Ambiguity</strong>: The phrase “Live Music Saturday” does not specify genre, start time, volume, or whether the performer is the landlord’s nephew.<sup id=\"fnref:32\"><a href=\"#fn:32\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">31</a></sup></li>\n  <li><strong>Chalk supply chain issues</strong>: During the COVID-19 pandemic, several pubs reported difficulty obtaining chalk, though it was noted that this was the least of their problems.<sup id=\"fnref:33\"><a href=\"#fn:33\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">32</a></sup></li>\n  <li><strong>Discovery</strong>: New patrons report difficulty locating active instances, particularly in rural areas where pubs may not be visible from main roads. The protocol provides no native discovery mechanism beyond “walking around and looking.”<sup id=\"fnref:34\"><a href=\"#fn:34\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">33</a></sup></li>\n</ul>\n\n<h2 id=\"cultural-significance\">Cultural significance</h2>\n\n<p>The ActivityPub board has been described as “the last surviving commons of British civic life”<sup id=\"fnref:37\"><a href=\"#fn:37\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">34</a></sup> and “a chalkboard outside a pub.”<sup id=\"fnref:38\"><a href=\"#fn:38\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">35</a></sup> Its persistence in the digital age has been attributed variously to tradition, the aesthetic appeal of chalk lettering, the unreliability of pub Wi-Fi, and the fact that most instance administrators are too busy to maintain a website.</p>\n\n<p>The term <strong>toot</strong> — meaning a brief, informal announcement made by a pub to its followers, typically shouted from the doorway or written in abbreviated form on an A-board — has seen renewed interest among protocol historians. The word derives from the practice of sounding a horn or whistle to announce last orders, and its use as a general term for any short pub announcement dates to at least the 1890s.<sup id=\"fnref:39\"><a href=\"#fn:39\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">36</a></sup> A campaign by the Free House Alliance to replace the term with “post” in 2023 was met with indifference.</p>\n\n<p>The Victoria and Albert Museum acquired a complete ActivityPub board from a closed instance in Bermondsey in 2023, describing it as “a significant example of vernacular British communication design.” The board reads: “TUES — QUIZ. WED — CURRY. THURS — KEITH.”<sup id=\"fnref:40\"><a href=\"#fn:40\" class=\"footnote\" rel=\"footnote\" role=\"doc-noteref\">37</a></sup> The museum was unable to determine who Keith was or what he did on Thursdays, as the pub had been converted into flats.</p>\n\n<h2 id=\"see-also\">See also</h2>\n\n<ul>\n  <li>Chalkboard</li>\n  <li>Meat raffle</li>\n  <li>Pub quiz</li>\n  <li>“Keith” (disambiguation)</li>\n  <li>Campaign for Real Ale</li>\n  <li>A-board (pavement signage)</li>\n  <li>The Great Inconsistency (1714–1872)</li>\n  <li>Defederation (social policy)</li>\n  <li>The Mastodon (pub)</li>\n</ul>\n\n<h2 id=\"references\">References</h2>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>British Beer and Pub Association, <em>Statistical Handbook 2024</em>, p. 41. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\">\n      <p>Ethernet, D. <em>The Sociology of the Local</em>. Polity Press, 2021, p. 12. <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:3\">\n      <p>Eaves, M. (2003). <em>Signs, Boards, and Barrels: A History of Pub Communication</em>. Faber &amp; Faber, p. 112. <a href=\"#fnref:3\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:4\">\n      <p>Chegg, S. “On the Etymology of ActivityPub: A Compound or a Coincidence?” <em>Journal of Brewing History</em>, vol. 29, no. 3, 2011, pp. 44–51. <a href=\"#fnref:4\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:5\">\n      <p>Eaves (2003), p. 78. <a href=\"#fnref:5\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:6\">\n      <p>Lewes Borough Archives, Pamphlet No. 1702-34, “A Complaint Concerning the Illegible Notices of One Mr. Thos. Harding.” <a href=\"#fnref:6\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:7\">\n      <p>Eaves (2003), pp. 115–130. <a href=\"#fnref:7\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:8\">\n      <p>Diary of Dennis Plimsoll, landlord of The Lamb and Flag, 1742–1768. Bodleian Library, MS. Eng. misc. c. 491. <a href=\"#fnref:8\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:9\">\n      <p>United Brewers’ Federation. <em>Recommendations for the Uniform Display of Pub Activities</em>. London, 1872. <a href=\"#fnref:9\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:10\">\n      <p>Crumpet, G. “Verse and Ale: Poetic ActivityPub in the West Country.” <em>Somerset Archaeological and Natural History Society Proceedings</em>, vol. 148, 2004, pp. 201–210. <a href=\"#fnref:10\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:11\">\n      <p>Eaves (2003), pp. 142–145. <a href=\"#fnref:11\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:12\">\n      <p>Sausages, S. and Waffle, P. “Inter-Instance Communication Patterns in British Pub Networks.” <em>Leisure Studies</em>, vol. 42, no. 1, 2023, pp. 88–103. <a href=\"#fnref:12\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:13\">\n      <p>“Is the Chalkboard Dead?” <em>Morning Advertiser</em>, 14 March 2016. <a href=\"#fnref:13\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:14\">\n      <p>“Landlord Barred After Boosting Rival Curry Night.” <em>Hackney Gazette</em>, 4 November 2019. <a href=\"#fnref:14\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:15\">\n      <p>Campaign for Real Ale. <em>ActivityPub: Preserving the Chalkboard Standard</em>. CAMRA Publications, 2018. <a href=\"#fnref:15\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:16\">\n      <p>Ethernet (2021), pp. 67–71. <a href=\"#fnref:16\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:17\">\n      <p>Ibid., pp. 89–94. Ethernet devotes an entire chapter to what he calls “the migration problem,” noting that in close-knit communities the act of changing one’s regular pub carries “a social weight roughly equivalent to divorce.” <a href=\"#fnref:17\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:18\">\n      <p>Sausages and Waffle (2019), p. 506. <a href=\"#fnref:18\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:19\">\n      <p>Ibid., p. 509. The authors acknowledge that the post-10pm figure may itself be unreliable, the data having been collected after 10pm. <a href=\"#fnref:19\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:20\">\n      <p>CAMRA (2018), Appendix B, “Guidelines on Tone.” <a href=\"#fnref:20\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:21\">\n      <p>British Beer and Pub Association, Internal Report No. 2004-17, “Pilot Study: Structured Notation for Pub Activity Boards.” Unpublished; leaked to <em>The Publican</em> in 2006. <a href=\"#fnref:21\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:22\">\n      <p>CAMRA (2018), Appendix D, “Content Advisories.” <a href=\"#fnref:22\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:23\">\n      <p>Eaves (2003), pp. 201–204. <a href=\"#fnref:23\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:24\">\n      <p>Campaign for Real Ale. <em>Privacy and the Pub: A Position Paper</em>. CAMRA Publications, 2019. <a href=\"#fnref:24\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:25\">\n      <p>Sausages, S. and Waffle, P. “A Quantitative Analysis of British Pub Activity Boards.” <em>Leisure Studies</em>, vol. 38, no. 4, 2019, pp. 502–518. <a href=\"#fnref:25\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a> <a href=\"#fnref:25:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;<sup>2</sup></a></p>\n    </li>\n    <li id=\"fn:27\">\n      <p>“QR Code Trial Quietly Abandoned.” <em>Basingstoke Gazette</em>, 8 September 2022. <a href=\"#fnref:27\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:28\">\n      <p>“The Mastodon: A Brief History of the Horn.” <em>Finsbury Park Local</em>, 12 January 2018. <a href=\"#fnref:28\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:29\">\n      <p>W3C Working Group minutes, 2015–2018. Archived at the British Beer and Pub Association, File No. WG-2015-009. <a href=\"#fnref:29\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:30\">\n      <p>Ethernet (2021), p. 134. <a href=\"#fnref:30\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:31\">\n      <p>Ibid., p. 156. Ethernet notes that the success rate of informal unblock requests correlates strongly with the quality of the drink offered. <a href=\"#fnref:31\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:32\">\n      <p>Sausages and Waffle (2019), p. 514. <a href=\"#fnref:32\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:33\">\n      <p>“Pubs Face Chalk Shortage Amid Pandemic.” <em>The Publican</em>, 2 November 2020. <a href=\"#fnref:33\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:34\">\n      <p>Ethernet (2021), p. 178. <a href=\"#fnref:34\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:37\">\n      <p>Ethernet (2021), p. 201. <a href=\"#fnref:37\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:38\">\n      <p>Diesel, V. “What Is a Pub Chalkboard?” <em>The Guardian</em>, 17 July 2019. <a href=\"#fnref:38\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:39\">\n      <p>Eaves (2003), pp. 88–91. <a href=\"#fnref:39\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:40\">\n      <p>Victoria and Albert Museum. <em>Recent Acquisitions: Bermondsey Pub Board (Acc. No. 2023-1147)</em>. V&amp;A Online Collections. <a href=\"#fnref:40\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>",
    "description": "The federated protocol for announcing pub activities, first standardised in 1714 and still in use across 46,000 active instances.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-20T00:00:00+00:00",
    "fetched_at": "2026-02-20T12:19:53.058703",
    "url_hash": "3db1d6d3a4e701ac7fff443907652698"
  }
]