[
  {
    "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
    "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
    "content": "<p>A new Internet-of-Things (IoT) botnet called <strong>Kimwolf</strong> has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf&#8217;s ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.</p>\n<div id=\"attachment_73083\" style=\"width: 625px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73083\" decoding=\"async\" class=\"size-full wp-image-73083\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/ss-botnet.png\" alt=\"\" width=\"615\" height=\"615\" /><p id=\"caption-attachment-73083\" class=\"wp-caption-text\">Image: Shutterstock, @Elzicon.</p></div>\n<p>Kimwolf grew rapidly in the waning months of 2025 by tricking various &#8220;residential proxy&#8221; services into relaying malicious commands to devices on the local networks of those proxy endpoints. Residential proxies are sold as a way to anonymize and localize one&#8217;s Web traffic to a specific region, and the biggest of these services allow customers to route their Internet activity through devices in virtually any country or city around the globe.</p>\n<p>The malware that turns one&#8217;s Internet connection into a proxy node is often quietly bundled with various mobile apps and games, and it typically forces the infected device to relay malicious and abusive traffic &#8212; including ad fraud, account takeover attempts, and mass content-scraping.</p>\n<p>Kimwolf mainly targeted proxies from <strong>IPIDEA</strong>, a Chinese service that has millions of proxy endpoints for rent on any given week. The Kimwolf operators discovered they could <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" target=\"_blank\" rel=\"noopener\">forward malicious commands</a> to the internal networks of IPIDEA proxy endpoints, and then programmatically scan for and infect other vulnerable devices on each endpoint&#8217;s local network.</p>\n<p>Most of the systems compromised through Kimwolf&#8217;s local network scanning have been unofficial Android TV streaming boxes. These are typically Android Open Source Project devices &#8212; not Android TV OS devices or Play Protect certified Android devices &#8212; and they are generally marketed as a way to watch unlimited (read:pirated) video content from popular subscription streaming services for a one-time fee.</p>\n<p>However, a great many of these TV boxes ship to consumers with residential proxy software pre-installed. What&#8217;s more, they have no real security or authentication built-in: If you can communicate directly with the TV box, you can also easily compromise it with malware.</p>\n<p>While IPIDEA and other affected proxy providers recently have taken steps to block threats like Kimwolf from going upstream into their endpoints (reportedly with varying degrees of success), the Kimwolf malware remains on millions of infected devices.</p>\n<div id=\"attachment_73086\" style=\"width: 757px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73086\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73086\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/ipidea2023.png\" alt=\"\" width=\"747\" height=\"377\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/ipidea2023.png 1219w, https://krebsonsecurity.com/wp-content/uploads/2026/01/ipidea2023-768x387.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/01/ipidea2023-782x395.png 782w\" sizes=\"(max-width: 747px) 100vw, 747px\" /><p id=\"caption-attachment-73086\" class=\"wp-caption-text\">A screenshot of IPIDEA&#8217;s proxy service.</p></div>\n<p>Kimwolf&#8217;s close association with residential proxy networks and compromised Android TV boxes might suggest we&#8217;d find relatively few infections on corporate networks. However, the security firm <strong>Infoblox</strong> said a recent review of its customer traffic found <em>nearly 25 percent of them made a query to a Kimwolf-related domain name since October 1, 2025</em>, when the botnet first showed signs of life.</p>\n<p>Infoblox found the affected customers are based all over the world and in a wide range of industry verticals, from education and healthcare to government and finance.</p>\n<p>&#8220;To be clear, this suggests that nearly 25% of customers had at least one device that was an endpoint in a residential proxy service targeted by Kimwolf operators,&#8221; Infoblox <a href=\"https://www.infoblox.com/blog/threat-intelligence/kimwolf-howls-from-inside-the-enterprise/\" target=\"_blank\" rel=\"noopener\">explained</a>. &#8220;Such a device, maybe a phone or a laptop, was essentially co-opted by the threat actor to probe the local network for vulnerable devices. A query means a scan was made, not that new devices were compromised. Lateral movement would fail if there were no vulnerable devices to be found or if the DNS resolution was blocked.&#8221;<span id=\"more-73065\"></span></p>\n<p><strong>Synthient</strong>, a startup that tracks proxy services and was <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" target=\"_blank\" rel=\"noopener\">the first to disclose on January 2</a> the unique methods Kimwolf uses to spread, found proxy endpoints from IPIDEA were present in alarming numbers at government and academic institutions worldwide. Synthient said it spied at least 33,000 affected Internet addresses at universities and colleges, and nearly 8,000 IPIDEA proxies within various U.S. and foreign government networks.</p>\n<div id=\"attachment_73093\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73093\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73093\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains.jpeg\" alt=\"\" width=\"749\" height=\"461\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains.jpeg 1808w, https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains-768x472.jpeg 768w, https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains-1536x945.jpeg 1536w, https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains-782x481.jpeg 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-73093\" class=\"wp-caption-text\">The top 50 domain names sought out by users of IPIDEA&#8217;s residential proxy service, according to Synthient.</p></div>\n<p>In a webinar on January 16, experts at the proxy tracking service <strong>Spur</strong> profiled Internet addresses associated with IPIDEA and 10 other proxy services that were thought to be vulnerable to Kimwolf&#8217;s tricks. Spur found residential proxies in nearly 300 government owned and operated networks, 318 utility companies, 166 healthcare companies or hospitals, and 141 companies in banking and finance.</p>\n<p>&#8220;I looked at the 298 [government] owned and operated [networks], and so many of them were DoD [U.S. Department of Defense], which is kind of terrifying that DoD has IPIDEA and these other proxy services located inside of it,&#8221; Spur Co-Founder <strong>Riley Kilmer</strong> said. &#8220;I don&#8217;t know how these enterprises have these networks set up. It could be that [infected devices] are segregated on the network, that even if you had local access it doesn&#8217;t really mean much. However, it&#8217;s something to be aware of. If a device goes in, anything that device has access to the proxy would have access to.&#8221;</p>\n<p>Kilmer said Kimwolf demonstrates how a single residential proxy infection can quickly lead to bigger problems for organizations that are harboring unsecured devices behind their firewalls, noting that proxy services present a potentially simple way for attackers to probe other devices on the local network of a targeted organization.</p>\n<p>&#8220;If you know you have [proxy] infections that are located in a company, you can chose that [network] to come out of and then locally pivot,&#8221; Kilmer said. &#8220;If you have an idea of where to start or look, now you have a foothold in a company or an enterprise based on just that.&#8221;</p>\n<p>This is the third story in our series on the Kimwolf botnet. Next week, we&#8217;ll shed light on the myriad China-based individuals and companies connected to the <a href=\"https://www.humansecurity.com/learn/blog/satori-threat-intelligence-disruption-badbox-2-0/\" target=\"_blank\" rel=\"noopener\"><strong>Badbox 2.0 botnet</strong></a>, the collective name given to <a href=\"https://github.com/synthient/public-research/blob/main/2026/01/kimwolf/product_devices.csv\" target=\"_blank\" rel=\"noopener\">a vast number of Android TV streaming box models</a> that ship with no discernible security or authentication built-in, and with residential proxy malware pre-installed.</p>\n<p>Further reading:</p>\n<p><a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" target=\"_blank\" rel=\"noopener\">The Kimwolf Botnet is Stalking Your Local Network</a></p>\n<p><a href=\"https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/\" target=\"_blank\" rel=\"noopener\">Who Benefitted from the Aisuru and Kimwolf Botnets?</a></p>\n<p><a href=\"https://synthient.com/blog/a-broken-system-fueling-botnets\" target=\"_blank\" rel=\"noopener\">A Broken System Fueling Botnets</a> (Synthient).</p>\n",
    "description": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
    "is_fulltext": true,
    "source": "Krebs on Security",
    "pub_date": "Tue, 20 Jan 2026 18:19:13 +0000",
    "fetched_at": "2026-02-05T11:48:45.571663",
    "url_hash": "47049a7169772dd6a23256ccf18b9e70"
  },
  {
    "title": "The meaning of connecting to INADDR_ANY in TCP and UDP",
    "link": "https://utcc.utoronto.ca/~cks/space/blog/programming/SocketConnectToAnyMeaning",
    "content": "<div class=\"wikitext\"><p>An interesting change to IP behavior landed in FreeBSD 15, <a href=\"https://github.com/golang/go/issues/77411\">as I\ndiscovered by accident</a>.\nTo quote from <a href=\"https://www.freebsd.org/releases/15.0R/relnotes/#network-general\">the general networking section of the FreeBSD 15\nrelease notes</a>:</p>\n\n<blockquote><p>Making a connection to <code>INADDR_ANY</code>, i.e., using\nit as an alias for <code>localhost</code>, is now disabled by\ndefault. This functionality can be re-enabled by setting the\n<code>net.inet.ip.connect_inaddr_wild sysctl</code> to 1. <a href=\"https://cgit.freebsd.org/src/commit/?id=cd240957d7ba\">cd240957d7ba</a></p>\n</blockquote>\n\n<p><a href=\"https://cgit.freebsd.org/src/commit/?id=cd240957d7ba\">The change's commit message</a> has a bit\nof a different description:</p>\n\n<blockquote><p>Previously connect() or sendto() to INADDR_ANY reached some socket\nbound to some host interface address. Although this was intentional it\nwas an artifact of a different era, and is not desirable now.</p>\n</blockquote>\n\n<p>This is connected to <a href=\"https://cgit.freebsd.org/src/commit/?id=417b35a97b76\">an earlier change</a>\nand <a href=\"https://bugs.freebsd.org/bugzilla/show_bug.cgi?id=280705\">FreeBSD bugzilla #28075</a>, which has\nsome additional background and motivation for the overall change (as\nwell as the history of this feature in 4.x BSD).</p>\n\n<p>The (current) Linux default behavior matches the previous FreeBSD\nbehavior. If you had something listening on localhost (in IPv4,\nspecifically 127.0.0.1) or listening on INADDR_ANY, connecting\nto INADDR_ANY would reach it and give the source of your\nconnection a localhost address (either 127.0.0.1 or ::1 depending\non IPv4 versus IPv6). Obviously the current FreeBSD default behavior\nhas now changed, and the Linux behavior may change at some point\n(or at least become something that can be changed by a sysctl).</p>\n\n<p>(Linux specifically restricts you to connecting to 127.0.0.1;\nyou can't reach a port listening on, eg, 127.0.0.10, although\nthat is also a localhost address.)</p>\n\n<p>One of the tricky API issues here is that higher level APIs can\noften be persuaded or tricked into using INADDR_ANY by default\nwhen they connect to something. For example, in Go's <a href=\"https://pkg.go.dev/net\">net</a> package, if you leave the hostname blank,\nyou currently get INADDR_ANY (which is convenient behavior for\nlistening but not necessarily for connecting). In other APIs, your\naddress variable may start with an initial zero value for the target\nIP address, which is INADDR_ANY for IPv4; if your code never\nsets it (perhaps because the 'host' is a blank string), you get a\nconnection to INADDR_ANY and thus to localhost. In top of that,\na blank host name to connect to may have come about through accident\nor through an attacker's action (perhaps they can make decoding or\nparsing the host name fail, leaving the 'host name' blank on you).</p>\n\n<p>I believe that what's happening with Go's tests is that the <a href=\"https://pkg.go.dev/net\">net</a>\npackage guarantees that things like <a href=\"https://pkg.go.dev/net#Dial\">net.Dial(\"tcp\", \":&lt;port>\")</a> connect to localhost, so of course\nthe net package has tests to insure that this stays working.\nCurrently, Go's net package implements this behavior by mapping a\nblank host to INADDR_ANY, which has traditionally worked and\nbeen the easiest way to get the behavior Go wants. It also means\nthat Go can use uniform parsing of 'host:port' for both listening,\nwhere ':port' is required to mean listening on INADDR_ANY, and\nfor connecting, where the host has to be localhost. Since this is\na high level API, Go can change how the mapping works, and it pretty\nmuch has to in order to fully work as documented on FreeBSD 15 in\na stock configuration.</p>\n\n<p>(Because that would be a big change to land right before the release\nof Go 1.26, I suspect that the first bugfix that will land is to\nskip these tests on FreeBSD, or maybe only on FreeBSD 15+ if that's\neasy to detect.)</p>\n</div>\n",
    "description": "",
    "is_fulltext": true,
    "source": "Chris's Wiki :: blog",
    "pub_date": "2026-02-05T02:57:23Z",
    "fetched_at": "2026-02-05T11:48:56.550728",
    "url_hash": "4b54ba06770cb6546123acbf84811fe1"
  }
]