[
  {
    "title": "Quoting Karel D'Oosterlinck",
    "link": "https://simonwillison.net/2026/Feb/6/karel-doosterlinck/#atom-everything",
    "content": "\n    <blockquote cite=\"https://twitter.com/kareldoostrlnck/status/2019477361557926281\"><p>When I want to quickly implement a one-off experiment in a part of the codebase I am unfamiliar with, I get codex to do extensive due diligence. Codex explores relevant slack channels, reads related discussions, fetches experimental branches from those discussions, and cherry picks useful changes for my experiment. All of this gets summarized in an extensive set of notes, with links back to where each piece of information was found. Using these notes, codex wires the experiment and makes a bunch of hyperparameter decisions I couldn’t  possibly make without much more effort.</p></blockquote>\n<p class=\"cite\">&mdash; <a href=\"https://twitter.com/kareldoostrlnck/status/2019477361557926281\">Karel D&#x27;Oosterlinck</a>, I spent $10,000 to automate my research at OpenAI with Codex</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/codex-cli\">codex-cli</a>, <a href=\"https://simonwillison.net/tags/coding-agents\">coding-agents</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/openai\">openai</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a></p>\n\n\n\n",
    "description": "When I want to quickly implement a one-off experiment in a part of the codebase I am unfamiliar with, I get codex to do extensive due diligence. Codex explores relevant slack channels, reads related discussions, fetches experimental branches from those discussions, and cherry picks useful changes for my experiment. All of this gets summarized in an extensive set of notes, with links back to where each piece of information was found. Using these notes, codex wires the experiment and makes a bunch",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-06T00:42:22+00:00",
    "fetched_at": "2026-02-06T12:20:00.301488",
    "url_hash": "08454aeec9a0c6fdfa62de0cef9a8d69"
  },
  {
    "title": "Pluralistic: Luxury Kafka (06 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/06/doge-ball/",
    "content": "<p><!--\nTags:\nimmigration, abolish ice, utopia of rules, n-600, citizenship, bureaucracy, doge,\n\nSummary:\nLuxury Kafka; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/06/doge-ball/\n\nTitle:\nPluralistic: Luxury Kafka (06 Feb 2026) doge-ball\n\nBullet:\n&#x1fab4;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/06/doge-ball/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/06Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#n-600\">Luxury Kafka</a>: US Immigration on the easiest setting.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#retro\">Object permanence</a>: Whisky PC; Anitfeatures; Silicon Roundabout; Steampunk Etch-A-Sketch; MLMs as mirror-world organizers.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/06/doge-ball/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12391\"></span></p>\n<hr/>\n<p><a name=\"n-600\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A suburban house; on the law stand a couple, their backs to it, looking appreciatively upon it. On the lawn is a lawn-flag reading 'Chinga la migra' in ornate script, surrounded by butterflies and flowers. The flag is limned in red spokes.\" src=\"https://i0.wp.com/craphound.com/images/immigration-kafka.jpg?w=840&#038;ssl=1\"/></p>\n<h1>Luxury Kafka (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#n-600\">permalink</a>)</h1>\n<p>Having been through the US immigration process (I got my first work visa more than 25 years ago and became a citizen in 2022), it's obvious to me that Americans have <em>no idea</em> how weird and tortuous their immigration system is:</p>\n<p><a href=\"https://www.flickr.com/photos/doctorow/52177745821/\">https://www.flickr.com/photos/doctorow/52177745821/</a></p>\n<p>As of a couple years ago, Americans' ignorance of their own immigration system was merely frustrating, as I encountered both squishy liberals and xenophobic conservatives talking about undocumented immigrants and insisting that they should \"just follow the rules.\" But today, as murderous ICE squads patrol our streets kidnapping people and sending them to concentration camps where they are beaten to death or deported to offshore slave labor prisons, the issue has gone from frustrating to terrifying and enraging.</p>\n<p>Let's be clear: I played the US immigration game on the easiest level. I am relatively affluent &#8211; rich enough to afford fancy immigration lawyers with offices on four continents &#8211; and I am a native English speaker. This made the immigration system ten thousand times (at a minimum) easier for me than it is for most US immigrants.</p>\n<p>There are lots of Americans (who don't know anything about their own immigration system) who advocate for a \"points-based\" system that favors rich people and professionals, but America <em>already</em> has this system, because dealing with the immigration process costs tens of thousands of dollars in legal fees, and without a lawyer, it is essentially unnavigable. Same goes for Trump's \"Golden Visa\" for rich people &#8211; anyone who can afford to pay for one of these is already spending five- or six-figure sums with a white shoe immigration firm.</p>\n<p>I'm not quite like those people, though. The typical path to US work visas and eventual immigration is through a corporate employer, who pays the law firm on your behalf (and also ties your residency to your employment, making it risky and expensive to quit your job). I found my own immigration lawyers through a friend's husband who worked in a fancy investment bank, and it quickly became apparent that immigration firms assume that their clients have extensive administrative support who can drop everything to produce mountains of obscure documents on demand.</p>\n<p>There were lots of times over the years when I had to remind my lawyers that <em>I</em> was paying them, not my employer, and that I <em>didn't</em> have an administrative assistant, so when they gave me 48 hours' notice to assemble 300 pages of documentation (this happened several times!), it meant that <em>I</em> had to drop everything (that is, the activities that let me pay their gigantic invoices) to fulfill their requests.</p>\n<p>When you deal with US immigration authorities, everything is elevated to the highest possible stakes. Every step of every process &#8211; work visa, green card, citizenship &#8211; comes with forms that you sign, on penalty of perjury, attesting that you have made no mistakes or omissions. A single error constitutes a potential falsification of your paperwork, and can result in deportation &#8211; losing your job, your house, your kid's schooling, everything.</p>\n<p>This means that, at every stage, you have to be as comprehensive as possible. This is a photo of my second O-1 (\"Alien of Extraordinary Ability\") visa application. It's 800 pages long:</p>\n<p><a href=\"https://www.flickr.com/photos/doctorow/2242342898/\">https://www.flickr.com/photos/doctorow/2242342898/</a></p>\n<p>The next one was <em>1200</em> pages long.</p>\n<p>Like I say, I became a citizen in 2022 (for some reason, my wife got her citizenship in 2021, even though we applied jointly). At that point, I thought I was done with the process. But then my kid applied to university and was told that she should sign up for FERPA, which is the federal student loan and grant process; she got pretty good grades and there was a chance she could get a couple grand knocked off her tuition. Seemed like a good idea to me.</p>\n<p>So we filled in the FERPA paperwork, and partway through, it asks if you are a naturalized citizen, and, if you are, it asks you to upload a copy of your certificate of citizenship. My wife and I both have certificates, but the kid doesn't &#8211; she was naturalized along with my wife in 2021, and while my wife's certificate was sufficient to get our daughter a passport, it doesn't actually have the kid's name on it.</p>\n<p>I checked in with our lawyers and was told that the kid couldn't get her certificate of citizenship until she turned 18, which she did last Tuesday. My calendar reminded me that it was time to fill in her N-600, the form for applying for a certificate of citizenship.</p>\n<p>So yesterday, I sat down at the computer, cleared a couple hours, and went to work. I am used to gnarly bureaucratic questions on this kind of paperwork, and I confess I get a small thrill of victory whenever I can bring up an obscure document demanded by the form. For example: I was able to pull up the number of the passport our daughter used to enter the country in 2015, along with the flight number and date. I was able to pull up all <em>three</em> of the numbers that the US immigration service assigned to both my wife <em>and</em> me.</p>\n<p>And then, about two hours into this process, I got to this section of the form: \"U.S. citizen mother or father's physical presence.\" This section requires me to list every border crossing I made into the USA <em>from the day I was born until the date I became a citizen</em>. That includes, for example, the time when I was two years old and my parents took me to Fort Lauderdale to visit my retired grandparents. This question comes after a screen where you attest that you will not make any omissions or errors, and that any such omission or error will be treated as an attempt to defraud the US immigration system, with the most severe penalties imaginable.</p>\n<p>I tried to call the US immigration service's info line. It is now staffed exclusively by an AI chatbot (thanks, Elon). I tried a dozen times to get the chatbot to put me on the phone with a human who could confirm what I should do about visits to the US that I took more than 50 years ago, when I was two years old. But the chatbot would only offer to text me a link to the online form, which has no guidance on this subject.</p>\n<p>Then I tried the online chat, which is <em>also</em> answered by a chatbot. This chatbot only allows you to ask questions that are less than 80 characters long. Eventually, I managed to piece together a complete conversation with the chatbot that conveyed my question, and it gave me a link to the same online form.</p>\n<p>But there <em>is</em> an option to escalate the online chat from a bot to a human. So I tried that, and, after repeatedly being prompted to provide my full name and address (home address and mailing address), date of birth, phone number &#8211; and disconnected for not typing all this quickly enough &#8211; the human eventually pasted in boilerplate telling me to consult an immigration attorney and terminated the chat before I could reply.</p>\n<p>Just to be clear here: this is <em>immigration on the easiest setting</em>. I am an affluent native English speaker with access to immigration counsel at a fancy firm.</p>\n<p>Imagine instead that you are not as lucky as I am. Imagine that your parents brought you to the USA 60 years ago, and that you've been a citizen for more than half a century, but you're being told that you should carry your certificate of citizenship if you don't want to be shot in the face or kidnapped to a slave labor camp. Your parents &#8211; long dead &#8211; never got you that certificate, so you create an online ID with the immigration service and try to complete form N-600. Do you know the date and flight number for the plane you flew to America on when you were three? Do you know your passport number from back then? Do you have all three of each of your dead parents' numeric immigration identifiers? Can you recover the dates of every border crossing your parents made into the USA from the day they were born until the day they became citizens?</p>\n<p>Anyone who says that \"immigrants should just follow the rules\" has missed the fact that <em>the rules are impossible to follow</em>. I get to do <em>luxury Kafka</em>, the business class version of US immigration Kafka, where you get to board first and nibble from a dish of warm nuts while everyone else shuffles past you, and I've <em>given up</em> on getting my daughter's certificate of citizenship. The alternative &#8211; omitting a single American vacation between 1971 and 2022 &#8211; could constitute an attempt to defraud the US immigration system, after all.</p>\n<p>This was terrible a couple years ago, when the immigration system still had human operators you could reach by sitting on hold for several hours. Today, thanks to a single billionaire's gleeful cruelty, the system is literally unnavigable, \"staffed\" by a chatbot that can't answer basic questions. A timely reminder that the only jobs AI can do are the jobs that no one gives a shit about:</p>\n<p><a href=\"https://pluralistic.net/2025/08/06/unmerchantable-substitute-goods/#customer-disservice\">https://pluralistic.net/2025/08/06/unmerchantable-substitute-goods/#customer-disservice</a></p>\n<p>It's also a timely reminder of the awesome destructive power of a single billionaire. This week, I took a Southwest flight to visit my daughter at college for her 18th birthday, and of course, SWA now charges for bags and seats. Multiple passengers complained bitterly and loudly about this as they boarded (despite the fact that the plane was only half full, many people were given middle seats and banned from moving to empty rows). One woman plaintively called out, \"Why does everything get worse all the time?\" (Yes, I'm aware of the irony of someone saying that within my earshot):</p>\n<p><a href=\"https://pluralistic.net/2024/10/14/pearl-clutching/#this-toilet-has-no-central-nervous-system\">https://pluralistic.net/2024/10/14/pearl-clutching/#this-toilet-has-no-central-nervous-system</a></p>\n<p>Southwest sucks today because of just one guy: Paul Singer, the billionaire owner of Elliott Investment Management, who bought a stake in SWA and used it to force the board to end open seating and free bag-check, then sold off his stake and disappeared into the sunset, millions richer, leaving behind a pile of shit where a beloved airline once flew:</p>\n<p><a href=\"https://www.forbes.com/sites/suzannerowankelleher/2024/10/24/southwest-airlines-bends-to-activist-investor-restructures-board/\">https://www.forbes.com/sites/suzannerowankelleher/2024/10/24/southwest-airlines-bends-to-activist-investor-restructures-board/</a></p>\n<p>One guy, Elon Musk, took the immigration system from \"frustrating and inefficient\" to \"totally impossible.\" That same guy is an avowed white nationalist &#8211; and illegal US immigrant who <em>did</em> cheat the immigration system &#8211; who sadistically celebrates the unlimited cruelty the immigration system heaps on other immigrants:</p>\n<p><a href=\"https://www.congress.gov/119/meeting/house/118277/documents/HHRG-119-JU13-20250520-SD003.pdf\">https://www.congress.gov/119/meeting/house/118277/documents/HHRG-119-JU13-20250520-SD003.pdf</a></p>\n<p>Again: I've got it easy. The people they want to put in concentration camps are doing something a million times harder than anything I've had to do to become a US citizen. People sometimes joke about how Americans couldn't pass the US citizenship test, with its questions about the tortured syntax of the 10th Amendment and the different branches of government. But the US citizenship test is the <em>easy</em> part. That test sits at the center of a bureaucratic maze that no American could find their way through.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>The Big Idea: Justin C. Key <a href=\"https://whatever.scalzi.com/2026/02/05/the-big-idea-justin-c-key/\">https://whatever.scalzi.com/2026/02/05/the-big-idea-justin-c-key/</a></p>\n</li>\n<li>\n<p>Jeff Bezos Just Taught Liberal Elites How Oligarchy Really Works <a href=\"https://www.thebignewsletter.com/p/jeff-bezos-finally-pulls-the-mask\">https://www.thebignewsletter.com/p/jeff-bezos-finally-pulls-the-mask</a></p>\n</li>\n<li>\n<p>Yes, Democrats should run on ICE <a href=\"https://www.gelliottmorris.com/p/yes-democrats-should-run-on-ice\">https://www.gelliottmorris.com/p/yes-democrats-should-run-on-ice</a></p>\n</li>\n<li>\n<p>\"ICE Out of Our Faces Act\" would ban ICE and CBP use of facial recognition <a href=\"https://arstechnica.com/tech-policy/2026/02/ice-out-of-our-faces-act-would-ban-ice-and-cbp-use-of-facial-recognition/\">https://arstechnica.com/tech-policy/2026/02/ice-out-of-our-faces-act-would-ban-ice-and-cbp-use-of-facial-recognition/</a></p>\n</li>\n<li>\n<p>‘Ripping’ Clips for YouTube Reaction Videos can Violate the DMCA, Court Rules <a href=\"https://torrentfreak.com/ripping-clips-for-youtube-reaction-videos-can-violate-the-dmca-court-rules/\">https://torrentfreak.com/ripping-clips-for-youtube-reaction-videos-can-violate-the-dmca-court-rules/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#retro\">permalink</a>)</h1>\n<p>#20yrsago UK nurses want to supply clean blades and cutting advice to self-harmers <a href=\"https://web.archive.org/web/20060206205108/http://www.timesonline.co.uk/article/0,,2087-2025748,00.html\">https://web.archive.org/web/20060206205108/http://www.timesonline.co.uk/article/0,,2087-2025748,00.html</a></p>\n<p>#20yrsago PC built into whisky bottle <a href=\"https://web.archive.org/web/20060210043104/https://metku.net/index.html?sect=view&amp;amp;n=1&amp;amp;path=mods/whiskypc/index_eng\">https://web.archive.org/web/20060210043104/https://metku.net/index.html?sect=view&amp;amp;n=1&amp;amp;path=mods/whiskypc/index_eng</a></p>\n<p>#15yrsago Startups of London’s “Silicon Roundabout” <a href=\"https://www.theguardian.com/technology/2011/feb/06/tech-startup-internet-entrepreneurs\">https://www.theguardian.com/technology/2011/feb/06/tech-startup-internet-entrepreneurs</a></p>\n<p>#15yrsago Antifeatures: deliberate, expensive product features that no customer wants <a href=\"https://mako.cc/copyrighteous/antifeatures-at-the-free-technology-academy\">https://mako.cc/copyrighteous/antifeatures-at-the-free-technology-academy</a></p>\n<p>#15yrsago Steampunk Etch-a-Sketch <a href=\"https://www.reddit.com/r/pics/comments/erbnf/a_steampunk_etchasketch_we_made_for_a_friend_this/\">https://www.reddit.com/r/pics/comments/erbnf/a_steampunk_etchasketch_we_made_for_a_friend_this/</a></p>\n<p>#10yrsago There’s a secret “black site” in New York where terrorism suspects are tortured for years at a time <a href=\"https://web.archive.org/web/20160205143012/https://theintercept.com/2016/02/05/mahdi-hashi-metropolitan-correctional-center-manhattan-guantanamo-pretrial-solitary-confinement/\">https://web.archive.org/web/20160205143012/https://theintercept.com/2016/02/05/mahdi-hashi-metropolitan-correctional-center-manhattan-guantanamo-pretrial-solitary-confinement/</a></p>\n<p>#10yrsago Error 53: Apple remotely bricks phones to punish customers for getting independent repairs <a href=\"https://www.theguardian.com/money/2016/feb/05/error-53-apple-iphone-software-update-handset-worthless-third-party-repair?CMP=Share_iOSApp_Other\">https://www.theguardian.com/money/2016/feb/05/error-53-apple-iphone-software-update-handset-worthless-third-party-repair?CMP=Share_iOSApp_Other</a></p>\n<p>#10yrsago Toronto City Council defies mayor, demands open, neutral municipal broadband <a href=\"https://www.michaelgeist.ca/2016/02/toronto-city-council-sides-with-crtc-in-rejecting-mayor-torys-support-of-bell-appeal/\">https://www.michaelgeist.ca/2016/02/toronto-city-council-sides-with-crtc-in-rejecting-mayor-torys-support-of-bell-appeal/</a></p>\n<p>#5yrsago Amazon's brutal warehouse \"megacycle\" <a href=\"https://pluralistic.net/2021/02/05/la-bookseller-royalty/#megacycle\">https://pluralistic.net/2021/02/05/la-bookseller-royalty/#megacycle</a></p>\n<p>#5yrsago AT&amp;T customer complains…via WSJ ad <a href=\"https://pluralistic.net/2021/02/05/la-bookseller-royalty/#go-aaron-go\">https://pluralistic.net/2021/02/05/la-bookseller-royalty/#go-aaron-go</a></p>\n<p>#1yrago MLMs are the mirror-world version of community organizing <a href=\"https://pluralistic.net/2025/02/05/power-of-positive-thinking/#the-socialism-of-fools\">https://pluralistic.net/2025/02/05/power-of-positive-thinking/#the-socialism-of-fools</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18<br />\n<a href=\"https://tanner.utah.edu/center-events/cory-doctorow/\">https://tanner.utah.edu/center-events/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#recent\">permalink</a>)</h1>\n<ul>\n<li>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n<li>\n<p>Why Big Tech is a Trap for Independent Creators (Stripper News)<br />\n<a href=\"https://www.youtube.com/watch?v=nmYDyz8AMZ0\">https://www.youtube.com/watch?v=nmYDyz8AMZ0</a></p>\n</li>\n<li>\n<p>Enshittification (Creative Nonfiction podcast)<br />\n<a href=\"https://brendanomeara.com/episode-507-enshittification-author-cory-doctorow-believes-in-a-new-good-internet/\">https://brendanomeara.com/episode-507-enshittification-author-cory-doctorow-believes-in-a-new-good-internet/</a></p>\n</li>\n<li>\n<p>Enshittification with Plutopia<br />\n<a href=\"https://plutopia.io/cory-doctorow-enshittification/\">https://plutopia.io/cory-doctorow-enshittification/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025</p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2026</p>\n</li>\n<li>\n<p>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/06/doge-ball/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1023 words today, 23683 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links Luxury Kafka: US Immigration on the easiest setting. Hey look at this: Delights to delectate. Object permanence: Whisky PC; Anitfeatures; Silicon Roundabout; Steampunk Etch-A-Sketch; MLMs as mirror-world organizers. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. Luxury Kafka (permalink) Having been through the US immigra",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Fri, 06 Feb 2026 08:43:22 +0000",
    "fetched_at": "2026-02-06T12:20:12.420269",
    "url_hash": "726ee572d79506a1908c07913a0312ad"
  },
  {
    "title": "CI In a Box",
    "link": "https://matklad.github.io/2026/02/06/ci-in-a-box.html",
    "content": "\n<header>\n  <h1>CI In a Box</h1>\n  <time class=\"meta\" datetime=\"2026-02-06\">Feb 6, 2026</time>\n</header>\n<p>I wrote <a href=\"https://matklad.github.io/2026/01/20/vibecoding-2.html\"><code>box</code></a>, a thin wrapper around ssh\nfor running commands on remote machines. I want a box-shaped interface for CI:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> repository = <span class=\"hl-string\">&quot;git@forge.com/me/my-project&quot;</span>;</span>\n<span class=\"line\"><span class=\"hl-keyword\">const</span> commit_sha = <span class=\"hl-title class_\">Deno</span>.<span class=\"hl-property\">env</span>[<span class=\"hl-string\">&quot;COMMIT&quot;</span>];</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">const</span> runners = <span class=\"hl-keyword\">await</span> <span class=\"hl-title class_\">Promise</span>.<span class=\"hl-title function_\">all</span>(</span>\n<span class=\"line\">    [<span class=\"hl-string\">&quot;windows-latest&quot;</span>, <span class=\"hl-string\">&quot;mac-latest&quot;</span>, <span class=\"hl-string\">&quot;linux-latest&quot;</span>]</span>\n<span class=\"line\">        .<span class=\"hl-title function_\">map</span>(<span class=\"hl-function\">(<span class=\"hl-params\">os</span>) =&gt;</span> $<span class=\"hl-string\">`box create <span class=\"hl-subst\">${os}</span>`</span>)</span>\n<span class=\"line\">);</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">await</span> <span class=\"hl-title class_\">Promise</span>.<span class=\"hl-title function_\">all</span>(runners.<span class=\"hl-title function_\">map</span>(<span class=\"hl-keyword\">async</span> ($runner) =&gt; {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        git clone <span class=\"hl-subst\">${repository}</span> .`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        git switch --detach <span class=\"hl-subst\">${commit_sha}</span>`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        ./zig/download.ps1`</span>;</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">await</span> $<span class=\"hl-string\">`box run <span class=\"hl-subst\">${runner}</span></span></span>\n<span class=\"line\"><span class=\"hl-string\">        ./zig/zig build test`</span>;</span>\n<span class=\"line\">}));</span></code></pre>\n\n</figure>\n<p>That is, the controlling CI machine runs a user-supplied script, whose status code will be the\nultimate result of a CI run. The script doesn’t run the project’s tests directly. Instead, it shells out\nto a proxy binary that forwards the command to a runner box with whichever OS, CPU, and other\nenvironment required.</p>\n<p>The hard problems are in the\n<span class=\"display\"><code>[\"windows-latest\", \"mac-latest\", \"linux-latest\"]</code></span>\npart:</p>\n<ul>\n<li>\nOne of them is not UNIX.\n</li>\n<li>\nOne of them has licensing&amp;hardware constraints that make per-minute billed VMs tricky (but not\nimpossible, as GitHub Actions does that).\n</li>\n<li>\nAll of them are moving targets, and require <em>someone</em> to do the OS upgrade work, which\n<a href=\"https://www.azabani.com/2025/12/18/shoestring-web-engine-ci.html#:~:text=have%20to%20be-,done%20by%20hand,-.%20And%20this%20is\">might involve pointing and clicking</a>.\n</li>\n</ul>\n<p>CI discourse amuses me — everyone complains about bad YAML, and it <em>is</em> bad, but most of the\nYAML (and associated reproducibility and debugging problems) is avoidable. Pick an appropriate\nposition on a dial that includes</p>\n<ul>\n<li>\nwriting a bash script,\n</li>\n<li>\nwriting a script\n<a href=\"https://www.teamten.com/lawrence/writings/java-for-everything.html\">in the language you already use</a>,\n</li>\n<li>\nusing a\n<a href=\"https://neugierig.org/software/blog/2026/01/smallest-build-system.html\">small build system</a>,\n</li>\n<li>\nusing a medium-sized one like <code>make</code> or <code>zig build</code>, or\n</li>\n<li>\nusing a large one like <code>nix</code> or <code>buck2</code>.\n</li>\n</ul>\n<p>What you can’t just do by writing a smidgen of text is getting the heterogeneous fleet of runners.\nAnd you need heterogeneous fleet of runners if some of the software you are building is\ncross-platform.</p>\n<hr>\n<p>If you go that way, be mindful that</p>\n\n<figure class=\"blockquote\">\n<blockquote><p>The SSH wire protocol only takes a single string as the command, with the expectation that it\nshould be passed to a shell by the remote end.</p>\n</blockquote>\n<figcaption><cite><a href=\"https://www.chiark.greenend.org.uk/~cjwatson/blog/ssh-quoting.html\">Colin Watson on SSH quoting</a></cite></figcaption>\n</figure>\n<p>In other words, while SSH supports syntax like\n<span class=\"display\"><code>ssh $HOST cmd arg1 arg2</code>,</span>\nit just blindly intersperses all arguments with a space. Amusing to think that our entire cloud\ninfrastructure is built on top of <a href=\"https://matklad.github.io/2021/07/30/shell-injection.html\">shell injection</a>!</p>\n<p>This, and the need to ensure no processes are left behind unintentionally after executing a remote\ncommand, means that you can’t “just” use SSH here if you are building something solid.</p>\n",
    "description": "I wrote box, a thin wrapper around ssh for running commands on remote machines. I want a box-shaped interface for CI:",
    "is_fulltext": true,
    "source": "matklad",
    "pub_date": "2026-02-06T00:00:00+00:00",
    "fetched_at": "2026-02-06T12:20:33.599518",
    "url_hash": "854869fb652b9a1a00086f0981ed2fa3"
  },
  {
    "title": "Crates.io’s Freaky Friday",
    "link": "https://nesbitt.io/2026/02/06/cratesio-freaky-friday.html",
    "content": "<p>The maintainers of <a href=\"https://crates.io/\">crates.io</a> wake up Friday morning to find their registry has swapped design philosophies with Debian. They still serve the Rust ecosystem, Debian still serves Linux distributions, but the tradeoffs they’ve chosen have reversed. Like Tess and Anna in <a href=\"https://www.imdb.com/title/tt0322330/\">Freaky Friday</a>, they’re stuck in each other’s bodies, forced to navigate constraints they’ve spent years criticizing from the outside.</p>\n\n<p>The crates.io team reaches for their coffee and tries to ship a hotfix, only to discover they can’t publish without a signed GPG key from a designated sponsor and a three-day waiting period for linting and policy review. Meanwhile, Debian maintainers watch in horror as packages flow into their repository without coordination, breaking stable in ways that won’t surface until someone’s server fails to boot.</p>\n\n<h3 id=\"waking-up-with-snapshots\">Waking up with snapshots</h3>\n\n<p>Freaky Friday crates.io splits into multiple coexisting suites. There’s a “stable” suite with older, well-tested crate versions, a “testing” suite with recent versions undergoing integration testing, and an “unstable” suite with the latest uploads. Within each suite, only one version of each crate exists, but the suites themselves persist simultaneously, and when you configure your project, you choose which suite to track. The entire collection of crates within a suite is tested together to ensure compatibility. If your crate depends on <code class=\"language-plaintext highlighter-rouge\">tokio ^1.0</code> and <code class=\"language-plaintext highlighter-rouge\">hyper ^1.0</code> in the stable suite, you can trust those specific versions work together because someone actually built them in combination.</p>\n\n<p>Within a suite, there’s no version selection because there are no versions to select. But the resolver still needs to handle feature unification across the dependency graph, optional dependencies that conditionally activate features, default features, and platform-specific dependencies. Debian’s resolver still deals with alternatives, virtual packages, and conflicts even within a single suite. Builds become reproducible by default within a suite since the suite itself acts as the lockfile, fixing both versions and the available feature combinations.</p>\n\n<p>Breaking changes in popular crates create suite-wide coordination problems. When <code class=\"language-plaintext highlighter-rouge\">tokio</code> wants to ship 2.0 to the unstable suite, either every dependent crate adapts before it migrates to testing and stable, or the breaking change waits, or incompatible crates get dropped. Projects tracking stable can stay on <code class=\"language-plaintext highlighter-rouge\">tokio</code> 1.x while the ecosystem adapts, but they can’t cherry-pick updates since you get the whole suite or none of it, and the suite model forces coordination within each channel while allowing different migration speeds across suites.</p>\n\n<p>Rust promises that code compiling on Rust 1.x will compile on Rust 1.y where y &gt; x. But in Freaky Friday crates.io, switching suites can break your build even if your code hasn’t changed and the compiler version is compatible.</p>\n\n<p>Freaky Friday Debian collapses its suites into a single rolling repository where <a href=\"/2025/12/05/package-manager-tradeoffs\">every version ever published stays available</a>. When <code class=\"language-plaintext highlighter-rouge\">libc6</code> releases a new version, the old ones remain fetchable alongside it. Projects can pin to specific versions and stay there for years. The resolver now has to choose among thousands of versions for popular packages, optimizing for the newest compatible set. Dependency conflicts that Debian’s suite-based integration testing would have caught now surface at runtime. Packages make incompatible assumptions about shared libraries or system state, and nobody finds out until something breaks. Debian would need to implement lockfiles. Right now each suite acts as an implicit lockfile, but with all versions available in a single repository, you need a way to freeze exact package versions or installations drift as new versions appear.</p>\n\n<p>The Debian team would face a new class of bugs. Two packages both depend on different versions of <code class=\"language-plaintext highlighter-rouge\">libssl</code>, and because there’s no coordinated testing, conflicts emerge. Many would surface at install time when dpkg detects incompatible dependencies, but some slip through: if the versions are ABI-compatible, everything works until one package calls a function that behaves differently across versions, creating subtle runtime failures. The careful integration testing that made Debian stable can’t happen when packages target arbitrary version combinations.</p>\n\n<h3 id=\"moving-on-someone-elses-schedule\">Moving on someone else’s schedule</h3>\n\n<p>Freaky Friday crates.io manages transitions between its suites by allowing crates to enter unstable immediately upon upload while requiring them to build cleanly and show no obvious breakage for a period before migrating to testing. From there, they pass integration tests against the entire stable suite and wait for the next stable release window before migrating to stable. Packages flow through suites based on demonstrated stability rather than author intent.</p>\n\n<p>The six-week Rust compiler cadence provides a natural rhythm for stable releases, with packages that have proven stable in testing migrating to a new stable suite every six weeks. Projects tracking stable get coordinated updates on this schedule, projects tracking unstable get updates immediately but accept the instability, and projects tracking testing find a middle ground between the two.</p>\n\n<p>When a vulnerability drops in a popular crate like <code class=\"language-plaintext highlighter-rouge\">tokio</code> or <code class=\"language-plaintext highlighter-rouge\">rustls</code>, projects tracking unstable get the fix immediately. Projects tracking testing get it after automated migration checks pass. Projects tracking stable might wait until the next stable release, which could mean nearly six weeks for a vulnerability announced just after a release.</p>\n\n<p>Right now when <code class=\"language-plaintext highlighter-rouge\">rustls</code> ships a security fix, it might inadvertently break something else. Projects pulling the update immediately discover this the hard way. In Freaky Friday crates.io, the security fix goes through testing’s integration checks before reaching stable. By the time stable-tracking projects get it, the registry has verified it doesn’t break anything.</p>\n\n<p>Freaky Friday crates.io would need a security update mechanism like Debian’s stable-security suite. Critical fixes could bypass the normal migration process and flow directly to stable with lighter testing. Different environments would choose differently. Rapidly-developed web services might track unstable to get fixes within minutes. Embedded systems might track stable with security updates only, avoiding any destabilization between planned upgrade windows.</p>\n\n<p>Freaky Friday Debian becomes rolling, where package maintainers can upload new versions of <code class=\"language-plaintext highlighter-rouge\">systemd</code> or <code class=\"language-plaintext highlighter-rouge\">nginx</code> that go live immediately without the extensive integration testing that characterized Debian stable. Individual packages work fine, but combinations are untested, leaving users who relied on Debian stable for servers that run for years without breaking in need of a new distribution.</p>\n\n<h3 id=\"who-decides-what-exists\">Who decides what exists</h3>\n\n<p>Freaky Friday crates.io requires review before publication. You don’t publish your own crate directly. Instead, you submit it for review by a team of packagers who evaluate the code, check for duplicates, ensure it meets quality standards, and decide whether it belongs in the registry. The packagers might not be the original authors. Sometimes they’re downstream users who want a library available and volunteer to maintain the packaging. Sometimes they’re registry maintainers filling gaps.</p>\n\n<p>Right now, the friction of publishing to crates.io is so low that people publish tiny utility crates for their own convenience. With review as a gate, you’d only submit crates you think are worth someone else’s time to evaluate. The ecosystem would have fewer packages, but each one would represent a more deliberate decision. The explosion of micro-dependencies that characterizes the npm ecosystem would slow down.</p>\n\n<p>The packagers become a new power center. They decide not just whether code is safe, but whether it’s useful, whether it duplicates existing crates, whether it meets their standards for documentation or API design. In Debian this works because the community of package maintainers is accountable to the broader Debian community through democratic governance. Without that structure, the crates.io packagers would be making subjective judgments with limited oversight. Whose standards are they enforcing?</p>\n\n<p>Freaky Friday Debian removes the gatekeeping. Anyone can publish a package to their own namespace without review. The namespace structure prevents collisions, and there’s no central authority deciding what deserves to exist. Debian would get new software faster, but it would break something deeper than just technical quality control.</p>\n\n<p>Debian’s curation is part of its social contract and legal guarantees. The Debian Free Software Guidelines aren’t just about code quality, they’re about license compliance and user freedoms. When software makes it into Debian, you know someone verified those guarantees. In Freaky Friday Debian, being in the repository just means someone published it. Organizations using Debian because it’s curated would need to build their own curation layer on top, including their own license vetting and policy enforcement.</p>\n\n<p>When Azer Koçulu unpublished left-pad from npm in 2016, thousands of builds broke because npm trusted authors to control their packages. The registry had to override that trust and restore the package. Crates.io learned from this and implemented yanking instead of deletion: authors can mark versions as unavailable for new projects, but existing lockfiles still work. Freaky Friday crates.io wouldn’t need yanking at all. Once a crate passes review and enters a suite, the packagers own it. Authors can submit updates for future suites, but they can’t retroactively remove what’s already shipped.</p>\n\n<h3 id=\"the-build-farm-swap\">The build farm swap</h3>\n\n<p>Crates.io currently distributes source, pushing build costs to users. Debian runs a build farm and distributes binaries, concentrating costs on the registry operators.</p>\n\n<p>Freaky Friday crates.io adopts the build farm model, compiling every crate for every supported platform and Rust version, then distributing pre-built artifacts. First-time builds drop from twenty minutes to seconds. But the registry now handles Rust’s platform matrix spanning multiple operating systems, toolchain variants (gnu, musl, mingw), architectures, and Rust versions going back years. Debian’s build farm handles <a href=\"https://wiki.debian.org/SupportedArchitectures\">multiple architectures</a> for a curated package set. Rust has 150,000 crates with a broader platform matrix and faster churn. The infrastructure costs scale differently.</p>\n\n<h3 id=\"surviving-the-week\">Surviving the week</h3>\n\n<p>Freaky Friday crates.io would struggle most with user expectations about iteration speed. Rust developers expect to publish a new version and have it immediately available. You push <code class=\"language-plaintext highlighter-rouge\">serde</code> 1.0.215 with a bug fix, other developers pull it minutes later, find issues, you publish 1.0.216 the same afternoon. That feedback loop is how the ecosystem works. In Freaky Friday crates.io, your update enters unstable immediately but sits in review before that, then waits for testing migration, then waits for the next stable release up to six weeks away for projects tracking stable. By the time most users can try your fix, you’ve already identified and fixed three more bugs, but those are stuck in the pipeline too.</p>\n\n<p>The review bottleneck compounds this. When Rust adds language features, thousands of crates rush to adopt them in the same week. The current crates.io team is seven people managing over 150,000 packages. Debian handles this by having far fewer packages and slower language evolution, but Rust’s pace of change makes that model impractical. Even if suite releases align with the six-week compiler cadence, the stable suite would likely lag behind as crates take time to stabilize in testing, creating a version gap where new compiler features remain unusable because the stable suite’s crates haven’t adopted them yet. The ecosystem would fragment between developers tracking unstable for new features and those tracking stable for reliability.</p>\n\n<p>But Freaky Friday crates.io would gain something Debian has: confidence that the pieces fit together. Right now when a popular crate publishes a breaking change, you only discover the fallout when your build breaks. The ecosystem fragments as some projects upgrade and others don’t. With coordinated suites and integration testing, breaking changes get caught before they reach stable. You can’t have five different major versions of <code class=\"language-plaintext highlighter-rouge\">tokio</code> in the same suite because the suite is tested as a unit, so the maintainers would see exactly which crates break before a new version migrates from testing to stable. They could coordinate with those maintainers or delay the migration, smoothing out the churn that makes Rust dependency management exhausting.</p>\n\n<p>Rolling Debian would fix a problem that drives users to testing and unstable: staleness. Debian stable is often years behind upstream, which is fine for servers but painful for desktop users who want recent software. The careful integration testing that makes Debian reliable also makes it slow. By accepting rolling releases, Freaky Friday Debian could ship current software at the cost of occasional breakage, which some users would consider a better tradeoff.</p>\n\n<p>But the security team would now face backporting fixes to an unbounded number of actively-used package versions. The current model works because Debian can say “we only support the versions in stable.” With all versions available, the security burden grows unless they only support the newest version of each major series, which recreates the forced migration they were trying to avoid.</p>\n\n<h3 id=\"the-morning-meeting\">The morning meeting</h3>\n\n<p>Rust’s foundation model works because the ecosystem moves fast and decisions need to happen quickly, with six-week compiler releases requiring a tight feedback loop where small teams with clear ownership can make decisions and respond when something breaks without waiting for consensus.</p>\n\n<p>Debian’s democratic governance works because the conditions are different. The distribution moves slowly, giving time for deliberation. Decisions have long-term consequences that affect thousands of downstream distributions and millions of users. The contributor-to-package ratio is higher, so more people have the context to vote meaningfully on technical decisions. The social contract and democratic process are what hold the community together across decades. A vote on systemd adoption takes months because Debian will live with the choice for years, and the legitimacy of the decision matters as much as its technical correctness.</p>\n\n<p>Freaky Friday crates.io with Debian’s democratic governance would struggle to coordinate suite releases. Deciding which crates make it into each suite’s stable release would become a political process where the packagers with the most voting weight push their priorities and niche crates maintained by newcomers get deprioritized. Votes on technical decisions would take weeks, consistently missing the six-week release window. The pace of language evolution would either slow to match the governance speed or the governance would become a rubber stamp, breaking the democratic accountability that makes the model legitimate.</p>\n\n<p>Freaky Friday Debian with foundation governance would face legitimacy problems. Debian’s community trust comes from transparent decision-making and the knowledge that anyone sufficiently invested can participate in governance. The volunteers who maintain packages do so partly because they have a voice in the project’s direction. A board making policy decisions behind closed doors would break that social contract, potentially driving volunteers away and giving corporate sponsors more influence, which might improve funding but would change what Debian optimizes for and transform the distribution that prides itself on being “the universal operating system” built by its users into something else.</p>\n\n<p>At the end of the week, <a href=\"https://github.com/LawnGnome\">Adam Harvey</a> finds the fortune cookie. Everyone wakes up the next day with things back to normal, but with a better understanding of the tradeoffs and benefits of each choice.</p>",
    "description": "What happens when Rust's package registry wakes up with Debian's design choices?",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-06T00:00:00+00:00",
    "fetched_at": "2026-02-06T12:20:38.447047",
    "url_hash": "86c0424fa0893a8aeeb5fc41bb99c0e5"
  },
  {
    "title": "Stories From 25 Years of Computing",
    "link": "https://susam.net/twenty-five-years-of-computing.html",
    "content": "\n\n<p>\n  Last year, I completed 20 years in professional software\n  development.  I wanted to write a post to mark the occasion back\n  then, but couldn't find the time.  This post is my attempt to make\n  up for that omission.  In fact, I have been involved in software\n  development for slightly longer than 20 years.  Although I had\n  my <a href=\"fd-100.html\">first taste of computer programming</a> as\n  a child, it was only when I entered university about 25 years ago\n  that I seriously got into software development.  So I'll start my\n  stories from there.  These stories are less about software and more\n  about people.  Unlike many career anniversary posts, this one\n  contains no grand wisdom or lessons.  Just a collection of stories.\n  I hope you'll enjoy at least a few of them.\n</p>\n<h2 id=\"contents\">Contents<a href=\"#contents\"></a></h2>\n<ul>\n  <li><a href=\"#my-first-lesson-in-html\">My First Lesson in HTML</a></li>\n  <li><a href=\"#reset-vector\">The Reset Vector</a></li>\n  <li><a href=\"#my-first-job\">My First Job</a></li>\n  <li><a href=\"#sphagetti-code\">Sphagetti Code</a></li>\n  <li><a href=\"#animated-television-widgets\">Animated Television Widgets</a></li>\n  <li><a href=\"#good-blessings\">Good Blessings</a></li>\n  <li><a href=\"#the-ctf-scoreboard\">The CTF Scoreboard</a></li>\n</ul>\n<h2 id=\"my-first-lesson-in-html\">My First Lesson in HTML<a href=\"#my-first-lesson-in-html\"></a></h2>\n<p>\n  The first story takes place in 2001, shortly after I joined\n  university.  One evening, I went to the university computer\n  laboratory to browse the web.  Out of curiosity, I typed\n  <code>susam.com</code> into the address bar to see what kind of\n  website existed there.  I ended up on this home page:\n  <a href=\"https://web.archive.org/web/20010721163153/http://susam.com/\">susam.com</a>.\n  It looked much larger back then because display resolutions were\n  lower, so the text and banner covered almost half the screen.  I was\n  simply trying to make sense of the Internet.  I remember wondering\n  what it would take to create my own website, perhaps\n  at <code>susam.com</code>.  That's when an older student who had\n  been watching me browse over my shoulder approached and asked\n  whether that was my name and if I had created the website.  I told\n  him I hadn't and that I had no idea how websites were made.  He\n  asked me to move aside, took my seat and clicked View &gt; Source in\n  Internet Explorer.  He then explained how websites are made of HTML\n  pages and how those pages are simply text instructions.\n</p>\n<p>\n  Next, he opened Notepad and wrote a simple HTML page containing\n  nothing but a <code>&lt;BODY&gt;</code> tag with 'HELLO' inside it,\n  then showed me how it appeared in the browser.  He demonstrated a\n  few more things as well, such as using the <code>&lt;FONT&gt;</code>\n  tag to change colour, typeface and size.  It was only a brief\n  ten-minute tutorial, but it made the World Wide Web feel much less\n  mysterious and far more fascinating.\n</p>\n<p>\n  That person had an ulterior motive though.  After the tutorial, he\n  never gave the seat back to me.  He just continued browsing the Web\n  and waited for me to leave.  I was too timid to ask for my seat\n  back.  Seats were limited, so I returned to my dorm room both\n  disappointed that I couldn't continue browsing that day and excited\n  about all the websites I might create with this newfound knowledge.\n  I could never register <code>susam.com</code> for myself though.\n  That domain was always used by some business selling Turkish\n  cuisines.  Eventually, I managed to get the next best thing:\n  a <code>.net</code> domain of my own.  That brief encounter in the\n  university laboratory set me on a lifelong path of creating and\n  maintaining personal websites.\n</p>\n<h2 id=\"reset-vector\">The Reset Vector<a href=\"#reset-vector\"></a></h2>\n<p>\n  <p>\n  The second story also comes from my university days.  I was hanging\n  out with my mates in the computer laboratory.  In front of me was\n  MS-DOS running on a machine with an Intel 8086 processor.  I think I\n  was working on a lift control program when my mind drifted to a\n  small detail about the 8086 microprocessor that we had recently\n  learnt in a lecture.  Our professor had explained that when the 8086\n  is reset, execution begins with CS:IP set to FFFF:0000.  So I\n  murmured to anyone who cared to listen, 'I wonder if the system will\n  reboot if I jump to FFFF:0000.'  I then opened\n  <code>DEBUG.EXE</code> and jumped to that address.\n</p>\n<pre><samp>C:\\&gt;<kbd>DEBUG</kbd>\n<kbd>G =FFFF:0000</kbd></samp></pre>\n<p>\n  The machine rebooted instantly.  One of my friends, who topped the\n  class every semester, had been watching over my shoulder.  As soon\n  as the machine restarted, he exclaimed, 'How did you do that?'  I\n  explained that the reset vector is located at physical address\n  <code>FFFF0</code>, and that the CS:IP value\n  <code>FFFF:0000</code> maps to that address in real mode.  After\n  that, I went back to working on my lift control program and didn't\n  think much more about the incident.\n</p>\n<p>\n  About a week later, the same friend came to my dorm room.  He sat\n  down with a very serious expression and asked, 'How did you know to\n  do that?  How did it occur to you to jump to the reset vector?'  I\n  must have said something like, 'It just occurred to me.  I\n  remembered that detail from the lecture and wanted to try it out.'\n  He then said, 'I want to be able to think like that.  I come top of\n  the class every year, but I don't think the way you do.  I would\n  never have thought of taking a small detail like that and testing it\n  myself.'  I replied that I was just curious to see whether what we\n  had learnt actually worked in practice.  He responded, 'And that's\n  exactly it.  It would never occur to me to try something like that.\n  I feel disappointed that I keep coming top of the class, yet I am\n  not curious in the same way you are.  I've decided I don't want to\n  top the class anymore.  I just want to explore and experiment with\n  what we learn, the way you do.'\n</p>\n<p>\n  That was all he said before getting up and heading back to his dorm\n  room.  I didn't take it very seriously at the time.  I couldn't\n  imagine why someone would willingly give up the accomplishment of\n  coming first every year.  But I was wrong.  He never topped the\n  class again.  He still ranked highly, often within the top ten, but\n  he kept his promise of never finishing first again.  To this day, I\n  remember the incident fondly.  I still feel a mix of embarrassment\n  and pride at having inspired someone to step back academically in\n  order to have more fun with learning.  Of course, there is no reason\n  one cannot do both.  But in the end, that was his decision, not\n  mine.\n</p>\n<h2 id=\"my-first-job\">My First Job<a href=\"#my-first-job\"></a></h2>\n<p>\n  In my first job, I was assigned to work on the installer for a\n  specific component of an e-banking product.  The installer was\n  written in Python and was quite fragile.  During my first week on\n  the project, I spent much of my time stabilising the installer and\n  writing a user guide with step-by-step instructions on how to use\n  it.  The result was well received and appreciated by both my seniors\n  and management.  To my surprise, my user guide was praised more than\n  my improvements to the installer.  While the first few weeks were\n  enjoyable, I soon realised I would not find the work fulfilling for\n  very long.  I wrote to management a few times to ask whether I could\n  transfer to a team where I could work on something more substantial.\n</p>\n<p>\n  My emails were initially met with resistance.  After several rounds\n  of discussion, however, someone who had heard about my situation\n  reached out and suggested a team whose manager might be interested\n  in interviewing me.  The team was based in a different city.  I was\n  young and willing to relocate wherever I could find good work, so I\n  immediately agreed to the interview.\n</p>\n<p>\n  This was in 2006, when video conferencing was not yet common.  On\n  the day of the interview, the hiring manager called me on my desk\n  phone.  He began by introducing the team, which called itself\n  <em>Archie</em>, short for <em>architecture</em>.  The team developed\n  and maintained the web framework and core architectural components\n  on which the entire e-banking product was built.  The product had\n  existed long before open source frameworks such as Spring or Django\n  became popular, so features such as API routing, authentication and\n  authorisation layers, cookie management and similar capabilities were\n  all implemented in-house by this specialised team.  Because the\n  software was used in banking environments, it also had to pass strict\n  security testing and audits to minimise the risk of serious flaws.\n</p>\n<p>\n  The interview began well.  He asked several questions related to\n  software security, such as what SQL injection is and how it can be\n  prevented or how one might design a web framework that mitigates\n  cross-site scripting attacks.  He also asked programming questions,\n  most of which I answered pretty well.  Towards the end, however, he\n  asked how we could prevent MITM attacks.  I had never heard the\n  term, so I admitted that I did not know what MITM meant.  He then\n  asked, 'Man in the middle?' but I still had no idea what that meant\n  or whether it was even a software engineering concept.  He replied,\n  'Learn everything you can about PKI and MITM.  We need to build a\n  digital signatures feature for one of our corporate banking\n  products.  That's the first thing we'll work on.'\n</p>\n<p>\n  Over the next few weeks, I studied RFCs and documentation related to\n  public key infrastructure, public key cryptography standards and\n  related topics.  At first, the material felt intimidating, but after\n  spending time each evening reading whatever relevant literature I\n  could find, things gradually began to make sense.  Concepts that\n  initially seemed complex and overwhelming eventually felt intuitive\n  and elegant.  I relocated to the new city a few weeks later and\n  delivered the digital signatures feature about a month after joining\n  the team.  We used the open source Bouncy Castle library to\n  implement digital signatures, which became my first real interaction\n  with the open source community.  After that I worked on other parts\n  of the product too.  The most rewarding part was knowing that the\n  code I was writing became part of a mature product used by hundreds\n  of banks and millions of users.  It was especially satisfying to see\n  the work pass security testing and audits and be considered ready\n  for release.\n</p>\n<p>\n  That was my first real engineering job.  My manager also turned out\n  to be an excellent mentor.  Working with him helped me develop new\n  skills and his encouragement gave me confidence that stayed with me\n  for years.  Nearly two decades have passed since then, yet the\n  product apparently still exists.  In fact, in my current phase of\n  life I sometimes happen to use that product as a customer.\n  Sometimes, I open the browser developer tools to view the page\n  source and can still see traces of the HTML generated by code I\n  wrote almost twenty years ago.\n</p>\n<h2 id=\"sphagetti-code\">Sphagetti Code<a href=\"#sphagetti-code\"></a></h2>\n<p>\n  Around 2007 or 2008, I began working on a proof of concept for\n  developing widgets for an OpenTV set-top box.  The work involved\n  writing code in a heavily trimmed-down version of C.  One afternoon,\n  while making good progress on a few widgets, I noticed that they\n  would occasionally crash at random.  I tried tracking down the bugs,\n  but I was finding it surprisingly difficult to understand my own\n  code.  I had managed to produce some truly spaghetti-like code,\n  complete with dubious pointer operations that were almost certainly\n  responsible for the crashes, yet I could not pinpoint where exactly\n  things were going wrong.\n</p>\n<p>\n  Ours was a small team of four people, each working on an independent\n  proof of concept.  The most senior person on the team acted as our\n  lead and architect.  Later that afternoon, I showed him my progress\n  and explained that I was still trying to hunt down the bugs causing\n  the widgets to crash.  He asked whether he could look at the code.\n  After going through it briefly and probably realising that it was a\n  bit of a mess, he asked me to send him the code as a tarball, which\n  I promptly did.\n</p>\n<p>\n  He then went back to his desk to study the code.  I remember\n  thinking, 'There is no way he is going to find the problem.  I have\n  been debugging this for hours and even I barely understand what I\n  have written.  This is the worst spaghetti code I have ever\n  produced.'  With little hope of a quick solution, I went back to\n  debugging on my own.\n</p>\n<p>\n  Barely five minutes later, he came back to my desk and asked me to\n  open a specific file.  He then showed me exactly where the pointer\n  bug was.  It had taken him only a few minutes not only to read my\n  tangled code but also to understand it well enough to identify the\n  fault and point it out.  As soon as I fixed that line, the crashes\n  disappeared.  I was genuinely in awe of his skill.\n</p>\n<p>\n  I have always loved computing and programming, so I had assumed I\n  was already fairly good at it.  That incident, however, made me\n  realise how much further I still had to go before I could consider\n  myself a good software developer.  I did improve significantly in\n  the years that followed and today I am far better at managing\n  software complexity than I was back then.\n</p>\n<h2 id=\"animated-television-widgets\">Animated Television Widgets<a href=\"#animated-television-widgets\"></a></h2>\n<p>\n  In another project from that period, we worked on another set-top\n  box platform that supported Java Micro Edition (Java ME) for widget\n  development.  One day, the same architect from the previous story\n  asked whether I could add animations to the widgets.  I told him\n  that it should be possible.  To make this story clearer, though, I\n  need to explain how the different stakeholders in the project were\n  organised.\n</p>\n<p>\n  Our small team effectively played the role of the software vendor.\n  The final product going to market would carry the brand of a major\n  telecom carrier, offering direct-to-home (DTH) television services,\n  with the set-top box being one of the products sold to customers.\n  The set top box was manufactured by another company.  So the project\n  was a partnership between three parties: our company as the software\n  vendor, the telecom carrier and the set-top box manufacturer.  The\n  telecom carrier wanted to know whether widgets could be animated on\n  screen with smooth slide-in and slide-out effects.  That was why the\n  architect approached me to ask whether it could be done, and I told\n  him it should be possible.\n</p>\n<p>\n  I then began working on animating the widgets.  Meanwhile, the\n  architect and a few senior colleagues attended a business meeting with\n  all the partners present.  During the meeting, he explained that we\n  were evaluating whether widget animations could be supported.  The\n  set-top box manufacturer immediately dismissed the idea, saying,\n  'That's impossible.  Our set-top box does not support animation.'\n  When the architect returned and shared this with us, I replied, 'I do\n  not understand.  If I can draw a widget, I can animate it too.  All\n  it takes is clearing the widget and redrawing it at slightly different\n  positions repeatedly.  In fact, I already have a working version.'\n  I then showed a demo of the animated widgets running on the emulator.\n</p>\n<p>\n  The following week, the architect attended another partners' meeting\n  where he shared updates about our animated widgets.  I was not\n  personally present, so what follows is second-hand information\n  passed on by those who were there.  I learnt that the set-top box\n  company reacted angrily.  For some reason, they were unhappy that we\n  had managed to achieve results using their set-top box and APIs that\n  they had officially described as impossible.  They demanded that we\n  stop work on animation immediately, arguing that our work could not\n  be allowed to contradict their official position.  If I remember\n  correctly, there were even suggestions of legal consequences.  At\n  that point, the telecom carrier's representative intervened and\n  bluntly told the set-top box representative to just shut up.  If the\n  set top box guy was furious, the telecom guy was even more so, 'You\n  guys told us animation was not possible and these people are showing\n  that it is.  You manufacture the set-top box.  How can you not know\n  what it is capable of?'\n</p>\n<p>\n  Meanwhile, I continued working and completed my proof-of-concept\n  implementation.  It worked very well in the emulator, but I did not\n  yet have access to the actual hardware.  The device was still in the\n  process of being shipped to us, so all my early proof-of-concepts\n  ran on the emulator.  The following week, the architect planned to\n  travel to the set-top box company's office to test my widgets on the\n  real hardware.\n</p>\n<p>\n  At the time, I was quite proud of having apparently proven the\n  manufacturer wrong.  Here I was, an engineer in his twenties working\n  on one of my first major projects, already demonstrating\n  capabilities that even the hardware maker believed were impossible.\n  But when the architect travelled to test the widgets on the actual\n  device, a problem emerged.  What looked like buttery smooth\n  animation on the emulator appeared noticeably choppy on a real\n  television.  Over the next few weeks, I experimented with frame\n  rates, buffering strategies and optimising the computation done in\n  the the rendering loop.  Each week, the architect travelled for\n  testing and returned with the same report: the animation was still\n  choppy.  The modest embedded hardware could not keep up with the\n  required computation and rendering.  In the end, the telecom carrier\n  decided that no animation was better than poor animation and dropped\n  the idea altogether.  So in the end, the set-top box developers\n  turned out to be correct after all.\n</p>\n<h2 id=\"good-blessings\">Good Blessings<a href=\"#good-blessings\"></a></h2>\n<p>\n  Back in 2009, after completing about a year at RSA Security, I began\n  looking for work that felt more intellectually stimulating,\n  especially projects involving mathematics and algorithms.  I spoke\n  with a few senior leaders about this, but nothing materialised for\n  some time.  Then one day, Dr Burt Kaliski, Chief Scientist at RSA\n  Laboratories, asked to meet me to discuss my career aspirations.  I\n  have written about this in more detail in another post here:\n  <a href=\"good-blessings.html\">Good Blessings</a>.  I will summarise\n  what followed.\n</p>\n<p>\n  Dr Kaliski met me and offered a few suggestions about the kinds of\n  teams I might approach to find more interesting work.  I followed\n  his advice and eventually joined a team that turned out to be an\n  excellent fit.  I remained with that team for the next six years.\n  During that time, I worked on parser generators, formal language\n  specification and implementation, as well as indexing and querying\n  components of a petabyte-scale database.  I learnt something new\n  almost every day during those six years, and it remains one of the\n  most enjoyable periods of my career.  I have especially fond\n  memories of working on parser generators alongside remarkably\n  skilled engineers from whom I learnt a lot.\n</p>\n<p>\n  Years later, I reflected on how that brief meeting with Dr Kaliski\n  had altered the trajectory of my career.  I realised I was not sure\n  whether I had properly expressed my gratitude to him for the role he\n  had played in shaping my path.  So I wrote to thank him and explain\n  how much that single conversation had influenced my life.  A few\n  days later, Dr Kaliski replied, saying he was glad to know that the\n  steps I took afterwards had worked out well.  Before ending his\n  message, he wrote this heart-warming note:\n</p>\n<blockquote>\n  &lsquo;One of my goals is to be able to provide encouragement to\n  others who are developing their careers, just as others have\n  invested in mine, passing good blessings from one generation to\n  another.&rsquo;\n</blockquote>\n<h2 id=\"the-ctf-scoreboard\">The CTF Scoreboard<a href=\"#the-ctf-scoreboard\"></a></h2>\n<p>\n  This story comes from 2019.  By then, I was no longer a\n  twenty-something engineer just starting out.  I was now a\n  middle-aged staff engineer with years of experience building both\n  low-level networking systems and database systems.  Most of my work\n  up to that point had been in C and C++.  I was now entering a new\n  phase where I would be developing microservices professionally in\n  languages such as Go and Python.  None of this was unfamiliar\n  territory.  Like many people in this profession, computing has long\n  been one of my favourite hobbies.  So although my professional work\n  for the previous decade had focused on C and C++, I had plenty of\n  hobby projects in other languages, including Python and Go.  I\n  cannot even say that I missed working in C and C++.  After all, who\n  wants to spend their days chasing memory bugs in core dumps when you\n  could be building features and delivering real value to customers?\n</p>\n<p>\n  In October 2019, during Cybersecurity Awareness Month, a Capture the\n  Flag (CTF) event was organised at our office.  The contest featured\n  all kinds of puzzles, ranging from SQL injection challenges to\n  insecure cryptography problems.  Some challenges also involved\n  reversing binaries and exploiting stack overflow vulnerabilities.\n</p>\n<p>\n  I am usually rather intimidated by such contests.  The whole idea of\n  competitive problem-solving under time pressure tends to make me\n  nervous.  But one of my colleagues persuaded me to participate in\n  the CTF.  And, somewhat to my surprise, I turned out to be rather\n  good at it.  Within about eight hours, I had solved roughly 90% of\n  the puzzles.  I finished at the top of the scoreboard.\n</p>\n<figure>\n  <img src=\"files/blog/ctf-2019.png\" alt=\"Scoreboard of a Capture the Flag (CTF) event\">\n  <figcaption>\n    CTF Scoreboard\n  </figcaption>\n</figure>\n<p>\n  In my younger days, I was generally known to be a good problem\n  solver.  I was often consulted when thorny problems needed solving\n  and I usually managed to deliver results.  I also enjoyed solving\n  puzzles.  I had a knack for them and happily spent hours, sometimes\n  days, working through obscure mathematical or technical puzzles and\n  sharing detailed write-ups with friends of the nerd variety.  So\n  tackling arcane and seemingly pointless puzzles was very much my\n  thing.  Seen in that light, my performance at the CTF probably\n  should not have surprised me.  Still, I was very pleased.  It was\n  reassuring to know that I could still rely on my systems programming\n  experience to solve obscure challenges.\n</p>\n<p>\n  During the course of the contest, my performance became something of\n  a talking point in the office.  Colleagues occasionally stopped by\n  my desk to appreciate how well I was doing in the CTF.  Two much\n  younger colleagues, both engineers I admired for their skill and\n  professionalism, were discussing the results nearby.  They were\n  speaking softly, but I could still overhear parts of their\n  conversation.  Curious, I leaned slightly and listened a bit more\n  carefully.  I wanted to know what these two people, whom I admired a\n  great deal, thought about my performance.\n</p>\n<p>\n  One of them remarked on how well I was doing in the contest.  The\n  other replied, 'Of course he is doing well.  He has more than ten\n  years of experience in C.'  At that moment, I realised that no\n  matter how well I solved those puzzles, the result would naturally\n  be credited to experience.  In my younger days, when I solved tricky\n  problems, people would sometimes call me smart.  Now it was\n  expected.  Not that I particularly care for such labels anyway, but\n  it did make me realise how things had changed.  I was now simply the\n  person with many years of experience, and solving challenges that\n  involved dissecting binaries and solving technical puzzles was\n  expected rather than remarkable.\n</p>\n<p>\n  I continue to sharpen my technical skills to this day.  While my\n  technical results may now simply be attributed to experience, I hope\n  I can continue to make a good impression through my professionalism,\n  ethics and kindness towards the people I work with.  If those leave\n  a lasting impression, that is good enough for me.\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/twenty-five-years-of-computing.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/technology.html\">#technology</a> |\n  <a href=\"https://susam.net/tag/programming.html\">#programming</a>\n</p>\n\n",
    "description": "Last year, I completed 20 years in professional software development. I wanted to write a post to mark the occasion back then, but couldn't find the time. This post is my attempt to make up for that omission. In fact, I have been involved in software development for slightly longer than 20 years. Although I had my first taste of computer programming as a child, it was only when I entered university about 25 years ago that I seriously got into software development. So I'll start my stories from t",
    "is_fulltext": true,
    "source": "Susam Pal",
    "pub_date": "Fri, 06 Feb 2026 00:00:00 +0000",
    "fetched_at": "2026-02-06T12:20:45.880859",
    "url_hash": "c920c9acf54cd5b297bbac6f830b1c28"
  },
  {
    "title": "Let's compile Quake like it's 1997!",
    "link": "https://fabiensanglard.net/compile_like_1997/index.html",
    "content": "",
    "description": "",
    "is_fulltext": false,
    "source": "Fabien Sanglard",
    "pub_date": "05 Feb 2026 00:00:00 +0000",
    "fetched_at": "2026-02-06T12:20:58.493297",
    "url_hash": "48293b23be2bcebf4fcbe27acef43fe3"
  }
]