[
  {
    "title": "Adding TILs, releases, museums, tools and research to my blog",
    "link": "https://simonwillison.net/2026/Feb/20/beats/#atom-everything",
    "content": "\n    <p>I've been wanting to add indications of my various other online activities to my blog for a while now. I just turned on a new feature I'm calling \"beats\" (after story beats, naming this was hard!) which adds five new types of content to my site, all corresponding to activity elsewhere.</p>\n<p>Here's what beats look like:</p>\n<p><img src=\"https://static.simonwillison.net/static/2026/three-beats.jpg\" alt=\"Screenshot of a fragment of a page showing three entries from 30th Dec 2025. First: [RELEASE] &quot;datasette-turnstile 0.1a0 — Configurable CAPTCHAs for Datasette paths usin…&quot; at 7:23 pm. Second: [TOOL] &quot;Software Heritage Repository Retriever — Download archived Git repositories f…&quot; at 11:41 pm. Third: [TIL] &quot;Downloading archived Git repositories from archive.softwareheritage.org — …&quot; at 11:43 pm.\" style=\"max-width: 100%;\" /></p>\n<p>Those three are from <a href=\"https://simonwillison.net/2025/Dec/30/\">the 30th December 2025</a> archive page.</p>\n<p>Beats are little inline links with badges that fit into different content timeline views around my site, including the homepage, search and archive pages.</p>\n<p>There are currently five types of beats:</p>\n<ul>\n<li>\n<a href=\"https://simonwillison.net/elsewhere/release/\">Releases</a> are GitHub releases of my many different open source projects, imported from <a href=\"https://github.com/simonw/simonw/blob/main/releases_cache.json\">this JSON file</a> that was constructed <a href=\"https://simonwillison.net/2020/Jul/10/self-updating-profile-readme/\">by GitHub Actions</a>.</li>\n<li>\n<a href=\"https://simonwillison.net/elsewhere/til/\">TILs</a> are the posts from my <a href=\"https://til.simonwillison.net/\">TIL blog</a>, imported using <a href=\"https://github.com/simonw/simonwillisonblog/blob/f883b92be23892d082de39dbada571e406f5cfbf/blog/views.py#L1169\">a SQL query over JSON and HTTP</a> against the Datasette instance powering that site.</li>\n<li>\n<a href=\"https://simonwillison.net/elsewhere/museum/\">Museums</a> are new posts on my <a href=\"https://www.niche-museums.com/\">niche-museums.com</a> blog, imported from <a href=\"https://github.com/simonw/museums/blob/909bef71cc8d336bf4ac1f13574db67a6e1b3166/plugins/export.py\">this custom JSON feed</a>.</li>\n<li>\n<a href=\"https://simonwillison.net/elsewhere/tool/\">Tools</a> are HTML and JavaScript tools I've vibe-coded on my <a href=\"https://tools.simonwillison.net/\">tools.simonwillison.net</a> site, as described in <a href=\"https://simonwillison.net/2025/Dec/10/html-tools/\">Useful patterns for building HTML tools</a>.</li>\n<li>\n<a href=\"https://simonwillison.net/elsewhere/research/\">Research</a> is for AI-generated research projects, hosted in my <a href=\"https://github.com/simonw/research\">simonw/research repo</a> and described in <a href=\"https://simonwillison.net/2025/Nov/6/async-code-research/\">Code research projects with async coding agents like Claude Code and Codex</a>.</li>\n</ul>\n<p>That's five different custom integrations to pull in all of that data. The good news is that this kind of integration project is the kind of thing that coding agents <em>really</em> excel at. I knocked most of the feature out in a single morning while working in parallel on various other things.</p>\n<p>I didn't have a useful structured feed of my Research projects, and it didn't matter because I gave Claude Code a link to <a href=\"https://raw.githubusercontent.com/simonw/research/refs/heads/main/README.md\">the raw Markdown README</a> that lists them all and it <a href=\"https://github.com/simonw/simonwillisonblog/blob/f883b92be23892d082de39dbada571e406f5cfbf/blog/importers.py#L77-L80\">spun up a parser regex</a>. Since I'm responsible for both the source and the destination I'm fine with a brittle solution that would be too risky against a source that I don't control myself.</p>\n<p>Claude also handled all of the potentially tedious UI integration work with my site, making sure the new content worked on all of my different page types and was handled correctly by my <a href=\"https://simonwillison.net/2017/Oct/5/django-postgresql-faceted-search/\">faceted search engine</a>.</p>\n<h4 id=\"prototyping-with-claude-artifacts\">Prototyping with Claude Artifacts</h4>\n<p>I actually prototyped the initial concept for beats in regular Claude - not Claude Code - taking advantage of the fact that it can clone public repos from GitHub these days. I started with:</p>\n<blockquote>\n<p><code>Clone simonw/simonwillisonblog and tell me about the models and views</code></p>\n</blockquote>\n<p>And then later in the brainstorming session said:</p>\n<blockquote>\n<p><code>use the templates and CSS in this repo to create a new artifact with all HTML and CSS inline that shows me my homepage with some of those inline content types mixed in</code></p>\n</blockquote>\n<p>After some iteration we got to <a href=\"https://gisthost.github.io/?c3f443cc4451cf8ce03a2715a43581a4/preview.html\">this artifact mockup</a>, which was enough to convince me that the concept had legs and was worth handing over to full <a href=\"https://code.claude.com/docs/en/claude-code-on-the-web\">Claude Code for web</a> to implement.</p>\n<p>If you want to see how the rest of the build played out the most interesting PRs are <a href=\"https://github.com/simonw/simonwillisonblog/pull/592\">Beats #592</a> which implemented the core feature and <a href=\"https://github.com/simonw/simonwillisonblog/pull/595/changes\">Add Museums Beat importer #595</a> which added the Museums content type.</p>\n    \n        <p>Tags: <a href=\"https://simonwillison.net/tags/blogging\">blogging</a>, <a href=\"https://simonwillison.net/tags/museums\">museums</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/til\">til</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/claude-artifacts\">claude-artifacts</a>, <a href=\"https://simonwillison.net/tags/claude-code\">claude-code</a></p>\n    \n\n",
    "description": "I've been wanting to add indications of my various other online activities to my blog for a while now. I just turned on a new feature I'm calling \"beats\" (after story beats, naming this was hard!) which adds five new types of content to my site, all corresponding to activity elsewhere. Here's what beats look like: Those three are from the 30th December 2025 archive page. Beats are little inline links with badges that fit into different content timeline views around my site, including the homepag",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-20T23:47:10+00:00",
    "fetched_at": "2026-02-21T00:36:05.669961",
    "url_hash": "30e03f6e6f26c9a3c4dc16b82e3e181d"
  },
  {
    "title": "‘Starkiller’ Phishing Service Proxies Real Login Pages, MFA",
    "link": "https://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/",
    "content": "<p>Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealthy new phishing-as-a-service offering lets customers sidestep both of these pitfalls: It uses cleverly disguised links to load the target brand&#8217;s real website, and then acts as a relay between the target and the legitimate site &#8212; forwarding the victim&#8217;s username, password and multi-factor authentication (MFA) code to the legitimate site and returning its responses.</p>\n<p>There are countless phishing kits that would-be scammers can use to get started, but successfully wielding them requires some modicum of skill in configuring servers, domain names, certificates, proxy services, and other repetitive tech drudgery. Enter <strong>Starkiller</strong>, a new phishing service that dynamically loads a live copy of the real login page and records everything the user types, proxying the data from the legitimate site back to the victim.</p>\n<p>According to an analysis of Starkiller by the security firm <strong>Abnormal AI</strong>, the service lets customers select a brand to impersonate (e.g., Apple, Facebook, Google, Microsoft et. al.) and generates a deceptive URL that visually mimics the legitimate domain while routing traffic through the attacker&#8217;s infrastructure.</p>\n<p>For example, a phishing link targeting Microsoft customers appears as &#8220;login.microsoft.com@[malicious/shortened URL here].&#8221; The &#8220;@&#8221; sign in the link trick is an oldie but goodie, because everything before the &#8220;@&#8221; in a URL is considered username data, and the real landing page is what comes after the &#8220;@&#8221; sign. Here&#8217;s what it looks like in the target&#8217;s browser:</p>\n<div id=\"attachment_73226\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/starkillerphishinglink.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-73226\" decoding=\"async\" class=\"wp-image-73226\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/starkillerphishinglink.png\" alt=\"\" width=\"749\" height=\"121\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/starkillerphishinglink.png 860w, https://krebsonsecurity.com/wp-content/uploads/2026/02/starkillerphishinglink-768x124.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/starkillerphishinglink-782x126.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /></a><p id=\"caption-attachment-73226\" class=\"wp-caption-text\">Image: Abnormal AI. The actual malicious landing page is blurred out in this picture, but we can see it ends in .ru. The service also offers the ability to insert links from different URL-shortening services.</p></div>\n<p>Once Starkiller customers select the URL to be phished, the service spins up <a href=\"https://www.docker.com/resources/what-container/\" target=\"_blank\" rel=\"noopener\">a Docker container</a> running a <a href=\"https://developer.chrome.com/docs/chromium/headless\" target=\"_blank\" rel=\"noopener\">headless Chrome browser instance</a> that loads the real login page, Abnormal found.</p>\n<p>&#8220;The container then acts as a man-in-the-middle reverse proxy, forwarding the end user’s inputs to the legitimate site and returning the site&#8217;s responses,&#8221; Abnormal researchers <strong>Callie Baron</strong> and <strong>Piotr Wojtyla</strong> wrote in <a href=\"https://abnormal.ai/blog/starkiller-phishing-kit\" target=\"_blank\" rel=\"noopener\">a blog post on Thursday</a>. &#8220;Every keystroke, form submission, and session token passes through attacker-controlled infrastructure and is logged along the way.&#8221;</p>\n<p>Starkiller in effect offers cybercriminals real-time session monitoring, allowing them to live-stream the target&#8217;s screen as they interact with the phishing page, the researchers said.</p>\n<p>&#8220;The platform also includes keylogger capture for every keystroke, cookie and session token theft for direct account takeover, geo-tracking of targets, and automated Telegram alerts when new credentials come in,&#8221; they wrote. &#8220;Campaign analytics round out the operator experience with visit counts, conversion rates, and performance graphs—the same kind of metrics dashboard a legitimate SaaS [software-as-a-service] platform would offer.&#8221;</p>\n<p>Abnormal said the service also deftly intercepts and relays the victim&#8217;s MFA credentials, since the recipient who clicks the link is actually authenticating with the real site through a proxy, and any authentication tokens submitted are then forwarded to the legitimate service in real time.</p>\n<p>&#8220;The attacker captures the resulting session cookies and tokens, giving them authenticated access to the account,&#8221; the researchers wrote. &#8220;When attackers relay the entire authentication flow in real time, MFA protections can be effectively neutralized despite functioning exactly as designed.&#8221;</p>\n<div id=\"attachment_73227\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73227\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-73227\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/starkiller-urlmasker.png\" alt=\"\" width=\"750\" height=\"685\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/starkiller-urlmasker.png 860w, https://krebsonsecurity.com/wp-content/uploads/2026/02/starkiller-urlmasker-768x701.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/starkiller-urlmasker-782x714.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><p id=\"caption-attachment-73227\" class=\"wp-caption-text\">The &#8220;URL Masker&#8221; feature of the Starkiller phishing service features options for configuring the malicious link. Image: Abnormal.</p></div>\n<p><span id=\"more-73214\"></span></p>\n<p>Starkiller is just one of several cybercrime services offered by a threat group calling itself <strong>Jinkusu</strong>, which maintains an active user forum where customers can discuss techniques, request features and troubleshoot deployments. One a-la-carte feature will harvest email addresses and contact information from compromised sessions, and advises the data can be used to build target lists for follow-on phishing campaigns.</p>\n<p>This service strikes me as a remarkable evolution in phishing, and its apparent success is likely to be copied by other enterprising cybercriminals (assuming the service performs as well as it claims). After all, phishing users this way avoids the upfront costs and constant hassles associated with juggling multiple phishing domains, and it throws a wrench in traditional phishing detection methods like domain blocklisting and static page analysis.</p>\n<p>It also massively lowers the barrier to entry for novice cybercriminals, Abnormal researchers observed.</p>\n<p>&#8220;Starkiller represents a significant escalation in phishing infrastructure, reflecting a broader trend toward commoditized, enterprise-style cybercrime tooling,&#8221; their report concludes. &#8220;Combined with URL masking, session hijacking, and MFA bypass, it gives low-skill cybercriminals access to attack capabilities that were previously out of reach.&#8221;</p>\n",
    "description": "Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealthy new phishing-as-a-service offering lets customers sidestep both of these pitfalls: It uses cleverly disguised links to load the target brand's real website, and then acts as a relay between the target and the legitimate site -- forwarding the victim's username, password and multi-factor authentic",
    "is_fulltext": true,
    "source": "Krebs on Security",
    "pub_date": "Fri, 20 Feb 2026 20:00:30 +0000",
    "fetched_at": "2026-02-21T00:36:07.176958",
    "url_hash": "b3192555c03e811a8bb9d3215c3b7b24"
  },
  {
    "title": "CloudPebble Returns! Plus New Pure JavaScript and Round 2 SDK",
    "link": "https://repebble.com/blog/cloudpebble-returns-plus-pure-javascript-and-round-2-sdk",
    "content": "As mentioned in our software roadmap, we’ve been working on many improvements to Pebble’s already pretty awesome SDK and developer…",
    "description": "As mentioned in our software roadmap, we’ve been working on many improvements to Pebble’s already pretty awesome SDK and developer…",
    "is_fulltext": false,
    "source": "Eric Migicovsky's Blog RSS Feed",
    "pub_date": "Fri, 20 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-21T00:36:08.216112",
    "url_hash": "5bd668624849783ee10d864da514bf40"
  },
  {
    "title": "Teleoperation is Always the Butt of the Joke",
    "link": "https://idiallo.com/blog/teleoperation-is-the-butt-of-the-joke?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>A few years back, the term \"AI\" took an unexpected turn when it was redefined as \"Actual Indian\". As in, a person in India operating the machine remotely.</p>\n\t\t\t<p>I first heard the term when Amazon was boasting about their cashierless grocery stores. There was a big sign in the store that said \"Just Walk Out,\" meaning you grab your items, walk out, and get charged the correct amount automatically. How did they do it? According to Amazon, they used AI. What kind of AI exactly, nobody was quite sure.</p>\n\n<p>But customers started reporting something odd. They weren't charged immediately after leaving the store. Some said it took several days for a charge to appear on their account. It eventually came out that the technology was sophisticated tracking performed by Amazon's team in India. Workers would manually review footage of each customer's visit and charge them accordingly. What's fascinating is that this operation was impressive. Coordinating thousands of store visits, matching items to customers across multiple camera angles, and doing it accurately enough that most people never noticed the delay. But because it was buried under the \"AI\" label, the moment the truth came out, the whole thing became a punchline.</p>\n\n<p>In 2024, Tesla held their \"We, Robot\" event, where Optimus robots operated a bar. They were serving drinks, dancing, and mingling with guests. It was a pretty impressive display. The robots moved fluidly, held conversations, and handed off drinks without fumbling. Elon Musk <a href=\"https://old.reddit.com/r/BetterOffline/comments/1phullc/tesla_optimus_robot_that_elon_musk_claimed_was_ai/\">claimed they were AI-driven</a>, fully autonomous. People were genuinely impressed by the interactions, and for good reason. Fluid, bipedal locomotion in a crowded social environment is an extraordinarily hard robotics problem.</p>\n\n<p>The moment it came out that the robots were teleoperated, the sentiment flipped entirely. It didn't matter how dexterous or natural the movement was. It felt like a magic trick exposed. But think about what was actually being demonstrated. Humanoid robots walking through a crowd, responding in real time to a human operator's inputs, without tripping over guests or spilling drinks. That's not nothing. Slapping \"AI\" on it turned an engineering achievement into a scandal.</p>\n\n<p>More recently, the company 1X unveiled a friendly humanoid robot available for purchase at $20,000. The demo looks genuinely impressive. The robot can perform domestic tasks like doing laundry, folding clothes, and navigating a home environment. And if it doesn't know how to do something, it can be taught. You can authorize a remote worker to take control, demonstrate the task, and the robot learns from that demonstration, adding it to its growing repertoire. That's a legitimately interesting approach to machine learning through human guidance.</p>\n\n<p>What got glossed over is how much of the current capability relies on that remote worker. Right after the unveiling, the Wall Street Journal was invited to test the robots. In their video, the robot is being operated entirely by a person sitting in the next room. To be fair, the smoothness of that teleoperation is itself a technical achievement. Real-time control of a bipedal robot performing fine motor tasks, like folding a shirt, requires low-latency communication, precise motor control, and a well-designed interface for the operator. That's years of engineering work.</p>\n\n<p>But because teleoperation isn't the product being sold, AI is,that achievement gets treated as evidence of fraud rather than progress.</p>\n\n<p>We've built an environment where \"teleoperated\" has become a slur, and anything short of full autonomy is seen as cheating. Even Waymo, whose self-driving cars have logged millions of autonomous miles, feels compelled to <a href=\"https://waymo.com/blog/?modal=short-advice-not-control-the-role-of-remote-assistance\">publicly defend themselves</a> against accusations of secretly using remote operators. As if any human involvement would invalidate everything they've built.</p>\n\n<p>I think teleoperation is pretty impressive. It's a valuable technology in its own right. Surgeons use it to operate across continents. Industrial operators use it to work in places no human could safely go. In all of these cases, having a human-in-the-loop is the point.</p>\n\n<hr />\n\n<p>Every \"AI\" product that turns out to have a person behind the curtain makes the public more skeptical. In a parallel universe, there is a version of the tech industry that celebrates teleoperation as a stepping stone. Where we are building tools to make collaboration easier through teleoperation, and it's not viewed as an embarrassing secret.</p>\n\t\t\t\n\t\t\t\t",
    "description": "A few years back, the term \"AI\" took an unexpected turn when it was redefined as \"Actual Indian\". As in, a person in India operating the machine remotely. I first heard the term when Amazon was boasting about their cashierless grocery stores. There was a big sign in the store that said \"Just Walk Out,\" meaning you grab your items, walk out, and get charged the correct amount automatically. How did they do it? According to Amazon, they used AI. What kind of AI exactly, nobody was quite sure. But ",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Fri, 20 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-21T00:36:10.631686",
    "url_hash": "e70216df2a8cc39c9676a07ab726de25"
  },
  {
    "title": "Pluralistic: A perforated corporate veil (20 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/20/karioca-konzernrecht/",
    "content": "<p><!--\nTags:\ncorporate governance, finance law, brazil, limited liability, elon musk, starlink, twitter, joint and several liability, liability, scholarship, law and political economy, capital formation\n\nSummary:\nA perforated corporate veil; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/20/karioca-konzernrecht/\n\nTitle:\nPluralistic: A perforated corporate veil (20 Feb 2026) karioca-konzernrecht\n\nBullet:\n&#x1f5de;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/20Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#less-limited-liability\">A perforated corporate veil</a>: The Brazilian method for curbing corporate power.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#retro\">Object permanence</a>: Social media turned US parties into host organisms for third parties; \"Citizens\" are hired actors; Insured exoskeletons; Talking with Snowden and Gibson.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12454\"></span></p>\n<hr/>\n<p><a name=\"less-limited-liability\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A diagram of a seance in which a table has risen from the ground as two women rest their hands upon it. Below the table, we can see that it is being manipulated by a male figure. The male figure's head has been swapped with Elon Musk's. The background is a slightly desaturated Brazilian flag.\" src=\"https://i0.wp.com/craphound.com/images/brazil-corporate-veil.jpg?w=840&#038;ssl=1\"/></p>\n<h1>A perforated corporate veil (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#less-limited-liability\">permalink</a>)</h1>\n<p>\"Capitalist realism\" is the idea that the world's current economic and political arrangements are inevitable, and that any attempt to alter them is a) irrational; b) doomed; and c) dangerous. It's the ideology of Margaret Thatcher's maxim, \"There is no alternative.\"</p>\n<p>Obviously this is very convenient if you are a current beneficiary of the status quo. \"There is no alternative\" is a thought-stopping demand dressed up as an observation. It means, \"Don't try and think of alternatives.\"</p>\n<p>The thing is, alternatives <em>already exist</em> and work very well. The Mondragon co-ops in Spain constitute a fully worked out, long-term stable economic alternative to traditional capitalist enterprises, employing more than 100,000 people and generating tangible, empirically measured benefits to workers, customers and the region:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Mondragon_Corporation\">https://en.wikipedia.org/wiki/Mondragon_Corporation</a></p>\n<p>Proponents of capitalist realism will tell you that Mondragon doesn't count. Maybe it's just a one-off. Or maybe it's just not big enough. 100,000 workers sounds like a lot, but Amazon has over 1.5m employees and untold numbers of misclassified contractors who are employees in everything but name (and legal rights).</p>\n<p>This is some pretty transparent goalpost moving, but sure, let's stipulate that Mondragon doesn't prove that there are broadly applicable alternatives to the dominant capitalism of the mid-2020s. Are there other examples of \"an alternative?\"</p>\n<p>There sure are.</p>\n<p>Let's look at limited liability. Limited liability &#8211; the idea that a company's shareholders cannot be held liable for the company's misdeeds &#8211; is a bedrock of capitalist dogma. The story goes that until the advent of the \"joint stock enterprise\" (and its handmaiden, limited liability) there was no efficient way to do \"capital formation\" (raising money for a project or business).</p>\n<p>Because of this, the only ambitious, capital-intensive projects were those that caught the fancy of a king, a Pope, or an aristocrat. But once limited liability appears on the scene, many people of modest means can jointly invest in a project without worrying about being bankrupted if it turns out that the people running it are crooks or bumblers. That lets you, say, buy a single share of a company without having to keep daily tabs on the management's every action without worrying that if they go wrong, someone they've hurt will sue you for everything you've got.</p>\n<p>Capital formation is a real thing, and limited liability unquestionably facilitates capital formation. There are plenty of good things in the world that exist because limited liability protections allowed everyday people to help bring them into existence. This isn't just stuff that makes a lot of money for capitalism's true believers, it includes everything from the company that makes the printing presses that your favorite anarchist zine runs on to the mill that makes the alloys for the e-bike you use to get to a demonstration.</p>\n<p>This is where capitalist realism comes in. Capitalist realists will claim that there is no way to do capital formation for these beneficial goods without limited liability &#8211; and not just <em>any</em> limited liability, but <em>maximum</em> limited liability in which the \"corporate veil\" can never be pierced to assign culpability to any shareholder. The capitalist realist claim is that the corporate veil is like the skin of a balloon, and that any attempt to poke even the smallest hole in it will cause it to rupture and vanish.</p>\n<p>But this just isn't true, and we can tell, because one of the largest economies in the world has operated with a perforated corporate veil for nearly a century, and that economy hasn't suffered from capital formation problems. Quite the contrary, some of the world's largest (and most destructive) monopolies are headquartered in this country where the veil of limited liability is thoroughly perforated.</p>\n<p>The country I'm talking about is Brazil, which has had <em>limited</em> limited liability since <em>1937</em>:</p>\n<p><a href=\"https://lpeproject.org/blog/when-workers-pierce-the-corporate-veil-brazils-forgotten-innovation/\">https://lpeproject.org/blog/when-workers-pierce-the-corporate-veil-brazils-forgotten-innovation/</a></p>\n<p>As Mariana Pargendler writes for the <em>LPE Project</em>, Brazil put limits on limited liability to address a common pattern of corporate abuse. Companies would set up in Brazil, incur a lot of liabilities (say, by poisoning the land, water and air, or by stealing from or maiming workers), and then, when the wheels of justice caught up with them, the companies would fold and re-establish themselves the next day under a new name.</p>\n<p>Like I say, this happens all over the world. It's incredibly common, and even the pettiest of crooks know how to use this trick. I know someone whose NYC apartment was flooded by the upstairs neighbor, who decided that they didn't need to worry about the fact that their toilet wouldn't stop running &#8211; for months, until the walls of the apartment downstairs dissolved in a slurry of black mold. The upstairs neighbor owned the apartment through an LLC, which they simply folded up and walked away from, while my friend was stuck with a giant bill and no one to sue.</p>\n<p>The limited liability company is the scammer's best friend. In the UK, an anti-tax extremist invented a tax-evasion scam whereby landlords pretend that their empty commercial buildings are tax-exempt \"snail farms\" by scattering around some boxes with a few snails in them:</p>\n<p><a href=\"https://www.patreon.com/posts/149255928?collection=1941093\">https://www.patreon.com/posts/149255928?collection=1941093</a></p>\n<p>When this results in inevitable stonking fines and adverse judgments, the \"snail farmers\" duck liability by folding up their limited liability company after transferring its assets to a new LLC.</p>\n<p>Capitalist realists will tell you that this is just the price of efficient capital formation. Without total, airtight limited liability &#8211; the sort that allows for this kind of obvious, petty ripoff &#8211; no one would be able to raise capital for <em>anything</em>.</p>\n<p>Brazil begs to differ. In 1937, Brazil made parent companies liable for their subsidiaries' obligations, with a system of \"joint and several liability\" for LLCs. This was expanded with 1943's Consolidation of Labor Laws, and it worked so well that the Brazilian legislature expanded it again in 2017.</p>\n<p>Remember back in 2024, when Elon Musk defied a Brazilian court order about Twitter, only to have Brazil freeze <em>Starlink's</em> assets until Musk caved? That was the \"joint and several\" liability system:</p>\n<p><a href=\"https://www.nytimes.com/2024/09/13/world/americas/brazil-musk-x-starlink.html\">https://www.nytimes.com/2024/09/13/world/americas/brazil-musk-x-starlink.html</a></p>\n<p>As Pargendler writes, Brazil's liability system \"represented a distributive choice: prioritizing Brazilian workers’ ability to enforce their rights over foreign capital’s interest in minimizing costs through corporate structuring.\"</p>\n<p>Pargendler (who teaches at Harvard Law) co-authored a paper with São Paulo Law's Olívia Pasqualeto analyzing the impact that Brazil's limited liability system had on capital formation and corporate conduct:</p>\n<p><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=6105586\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=6105586</a></p>\n<p>Unsurprisingly, they find that there has been a steady pressure to erode the joint and several system, but also that some countries (the US and France) have a \"joint employer\" doctrine that is a weak form of this. Portugal, meanwhile, adopted the Brazilian system, 70 years after Brazil &#8211; this transposition of law from a former colony to a former colonial power is apparently called \"reverse convergence\":</p>\n<p><a href=\"https://lpeproject.org/blog/heterodox-corporate-laws-in-the-global-south/\">https://lpeproject.org/blog/heterodox-corporate-laws-in-the-global-south/</a></p>\n<p>More countries in the global south have adopted regimes similar to Brazil's, like Venezuela and Chile. Other countries go further, like Mozambique and Angola. Somewhere in between are other Latin American countries like Peru and Uruguay, where these rules have entered practice through judicial rulings, not legislation.</p>\n<p>The authors don't claim that perforating the corporate veil solves all the problems of exploitative, fraudulent or corrupt corporate conduct. Rather, they're challenging the capitalist realist doctrine that insists that this system couldn't possibly exist, and if it did, it would be a disaster.</p>\n<p>A hundred years of Brazilian law, and Brazil's globe-spanning corporate giants, beg to differ.</p>\n<p>(<i>Image: <a href=\"https://commons.wikimedia.org/wiki/File:Elon_Musk_(54349817783).jpg\">Gage Skidmore</a>, <a href=\"https://creativecommons.org/licenses/by-sa/2.0/deed.en\">CC BY-SA 2.0</a>, modified</i>)</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Rep. James Talarico On Confronting Christian Nationalism, And Strange Days In The Texas Legislature <a href=\"https://www.youtube.com/watch?v=oiTJ7Pz_59A\">https://www.youtube.com/watch?v=oiTJ7Pz_59A</a></p>\n</li>\n<li>\n<p>What Airlines Don't Want You to Know <a href=\"https://www.youtube.com/watch?v=wlNBdUDeoT4\">https://www.youtube.com/watch?v=wlNBdUDeoT4</a></p>\n</li>\n<li>\n<p>Ada Palmer on Inventing the Renaissance: How Golden and Dark Ages Are Constructed and Why They Matter  <a href=\"https://www.singularityweblog.com/ada-palmer-inventing-the-renaissance/\">https://www.singularityweblog.com/ada-palmer-inventing-the-renaissance/</a></p>\n</li>\n<li>\n<p>Humble Book Bundle: Terry Pratchett's Discworld <a href=\"https://www.humblebundle.com/books/terry-pratchetts-discworld-harpercollins-encore-2026-books\">https://www.humblebundle.com/books/terry-pratchetts-discworld-harpercollins-encore-2026-books</a></p>\n</li>\n<li>\n<p>New Report Helps Journalists Dig Deeper Into Police Surveillance Technology  <a href=\"https://www.eff.org/press/releases/new-report-helps-journalists-dig-deeper-police-surveillance-technology\">https://www.eff.org/press/releases/new-report-helps-journalists-dig-deeper-police-surveillance-technology</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#retro\">permalink</a>)</h1>\n<p>#15yrsago XKCD’s productivity tip: reboot your computer every time you get bored <a href=\"https://blog.xkcd.com/2011/02/18/distraction-affliction-correction-extensio/\">https://blog.xkcd.com/2011/02/18/distraction-affliction-correction-extensio/</a></p>\n<p>#10yrsago Infographic: what’s the TPP, what’s wrong with it, how’d we get here, and what do we do now? <a href=\"https://www.eff.org/deeplinks/2016/02/new-infographic-tpp-and-your-digital-rights\">https://www.eff.org/deeplinks/2016/02/new-infographic-tpp-and-your-digital-rights</a></p>\n<p>#10yrsago Hacker suspected in Anon raid on Boston hospital rescued at sea by Disney cruise ship, then arrested <a href=\"https://www.nbcnews.com/news/us-news/suspected-hacker-arrested-after-rescue-sea-during-disney-cruise-n520131\">https://www.nbcnews.com/news/us-news/suspected-hacker-arrested-after-rescue-sea-during-disney-cruise-n520131</a></p>\n<p>#10yrsago Tipping screws poor people, women, brown people, restaurateurs, local economies and…you <a href=\"https://web.archive.org/web/20160220234308/https://www.washingtonpost.com/news/wonk/wp/2016/02/18/i-dare-you-to-read-this-and-still-feel-ok-about-tipping-in-the-united-states/\">https://web.archive.org/web/20160220234308/https://www.washingtonpost.com/news/wonk/wp/2016/02/18/i-dare-you-to-read-this-and-still-feel-ok-about-tipping-in-the-united-states/</a></p>\n<p>#10yrsago Clay Shirky: social media turned Dems, GOP into host organisms for third party candidates <a href=\"https://web.archive.org/web/20160219231315/https://storify.com/cshirky/republican-and-democratic-parties-are-now-host-bod\">https://web.archive.org/web/20160219231315/https://storify.com/cshirky/republican-and-democratic-parties-are-now-host-bod</a></p>\n<p>#10yrsago Leaked memos suggest Volkswagen’s CEO knew about diesel cheating in 2014 <a href=\"https://www.nytimes.com/2016/02/19/business/volkswagen-memos-suggest-emissions-problem-was-known-earlier.html?smprod=nytcore-ipad&amp;amp;smid=nytcore-ipad-share&amp;amp;_r=0\">https://www.nytimes.com/2016/02/19/business/volkswagen-memos-suggest-emissions-problem-was-known-earlier.html?smprod=nytcore-ipad&amp;amp;smid=nytcore-ipad-share&amp;amp;_r=0</a></p>\n<p>#10yrsago “Citizens” who speak at town meetings are hired, scripted actors <a href=\"https://www.nbclosangeles.com/news/local/concerned-citizens-turn-out-to-be-political-theater/2021439/\">https://www.nbclosangeles.com/news/local/concerned-citizens-turn-out-to-be-political-theater/2021439/</a></p>\n<p>#10yrsago Women in Zika-affected countries beg online for abortion pills <a href=\"https://ticotimes.net/2016/02/18/with-abortion-banned-in-zika-countries-women-beg-on-web-for-abortion-pills\">https://ticotimes.net/2016/02/18/with-abortion-banned-in-zika-countries-women-beg-on-web-for-abortion-pills</a></p>\n<p>#10yrsago  Health insurance must pay for exoskeletons <a href=\"https://web.archive.org/web/20160217093325/https://motherboard.vice.com/read/robotic-exoskeleton-rewalk-will-be-covered-by-health-insurance\">https://web.archive.org/web/20160217093325/https://motherboard.vice.com/read/robotic-exoskeleton-rewalk-will-be-covered-by-health-insurance</a></p>\n<p>#5yrsago Uber loses court battle, steals wages, censors whistleblower <a href=\"https://pluralistic.net/2021/02/19/texas-lysenko/#unter\">https://pluralistic.net/2021/02/19/texas-lysenko/#unter</a></p>\n<p>#5yrsago How Republicans froze Texas solid <a href=\"https://pluralistic.net/2021/02/19/texas-lysenko/#mess-with-texas\">https://pluralistic.net/2021/02/19/texas-lysenko/#mess-with-texas</a></p>\n<p>#5yrsago Complicity, incompetence, leadership and Capitol Police <a href=\"https://pluralistic.net/2021/02/19/texas-lysenko/#capitol-riots\">https://pluralistic.net/2021/02/19/texas-lysenko/#capitol-riots</a></p>\n<p>#5yrsago My talks with Edward Snowden and William Gibson <a href=\"https://pluralistic.net/2021/02/19/texas-lysenko/#gibson-snowden\">https://pluralistic.net/2021/02/19/texas-lysenko/#gibson-snowden</a></p>\n<p>#5yrsago Pluralistic is five <a href=\"https://pluralistic.net/2025/02/19/gimme-five/#jeffty\">https://pluralistic.net/2025/02/19/gimme-five/#jeffty</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Oslo (remote): Seminar og lansering av rapport om «enshittification»<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#recent\">permalink</a>)</h1>\n<ul>\n<li>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/20/karioca-konzernrecht/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1037 words today, 32992 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links A perforated corporate veil: The Brazilian method for curbing corporate power. Hey look at this: Delights to delectate. Object permanence: Social media turned US parties into host organisms for third parties; \"Citizens\" are hired actors; Insured exoskeletons; Talking with Snowden and Gibson. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Coloph",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Fri, 20 Feb 2026 14:53:08 +0000",
    "fetched_at": "2026-02-21T00:36:13.444608",
    "url_hash": "1b4151e618f74f303d53b1b12a751f7c"
  },
  {
    "title": "Book Review: Families And How To Survive Them by John Cleese and Robin Skynner ★★⯪☆☆",
    "link": "https://shkspr.mobi/blog/2026/02/book-review-families-and-how-to-survive-them-by-john-cleese-and-robin-skynner/",
    "content": "<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/01/9781407011035-jacket-large.webp\" alt=\"Book cover.\" width=\"314\" height=\"500\" class=\"alignleft size-full wp-image-66927\">\n\n<p>This is a curious and mostly charming book about therapy. It is presented as a (somewhat contrived) Socratic dialogue between Skynner the teacher and Cleese the pupil. Skynner lectures on while Cleese interjects with \"that's too clever to be convincing\" and other witty remarks. It is fun to have a somewhat sceptical interlocutor but it does get a little wearisome after a while.</p>\n\n<p>The basic of the premise is much the same as Larkin's \"This Be The Verse\". We all have various neuroses and blockers that wall off parts of our personalities. These prevent us from living our best lives and are often (inadvertently) reinforced by our families and spouses. The solution? Go to therapy and take your family with you!</p>\n\n<p>Some of the notions within the book are a little outdated. The stuff about homosexuality and \"trans-sexuals\" probably doesn't stand up to modern scrutiny. They're neither cruel nor callous when discussing it, and seem to agree that so-called conversion will do more harm than good. Similarly, while not <em>excruciatingly</em> sexist, it is a bit painfully blokey. The constant whinging about \"women’s libbers\" doesn't help - nor the stuff about Cleese hitting his daughter - and the book would have been better if anyone other than a <abbr title=\"Pale, Stale, Male\">PSM</abbr> had been involved.</p>\n\n<p>Still, for a book written in 1983 there are some terrifyingly modern predictions within its pages:</p>\n\n<blockquote><p><strong>John</strong>:&nbsp;&nbsp;You mean a politician who’s been a rebel all his life might find it difficult to be sufficiently firm if he ever got put in a position of power?\n</p><p><strong>Robin</strong>:&nbsp;&nbsp;Either that, or else he’d become very authoritarian but pretend that all his decisions were really being made democratically, on behalf of the silent majority perhaps, or the proletariat.</p></blockquote>\n\n<p>I can't think of <em>anyone</em> like that. Can you?</p>\n\n<p>Similarly, the book is rather good at turning its ire onto groups of people:</p>\n\n<blockquote><p><strong>John</strong>:&nbsp;&nbsp;So if we look at mainstream British politics, it’s perfectly healthy that the parties should get worked up and angry with each other during a debate or an election, because they can let those feelings go later and talk to each other on a friendly basis.\n\n</p><p><strong>Robin</strong>:&nbsp;&nbsp;Yes. After all, politics is the art of the possible, isn’t it? No one’s going to have exactly the same views, so you need to respect each other’s differences and try to reach a reasonable compromise if you can.\n\n</p><p><strong>John</strong>:&nbsp;&nbsp;But the real extremists have difficulty with this, don’t they? They don’t seem to be able to see their political opponents as people who happen to hold different opinions. They really seem to view them as bad people.\n\n</p><p><strong>Robin</strong>:&nbsp;&nbsp;Well, you see, people like this need to use their opponents as dustbins, somewhere they can dump all the bits of themselves that they can’t accept. Just like the scapegoat in a sick family. So they need to hate their opponents to keep themselves sane.</p></blockquote>\n\n<p>Do you feel seen?</p>\n\n<p>Like lots of books, it is very keen on diagnosing the problem but slightly hazy about providing the solution. There aren't any exercises to do or worksheets to fill in. I think it is assumed that anyone reading the book will recognise themselves in the pages and immediately pick up the Yellow Pages to find a therapist.</p>\n\n<p>On a technical level, it is disappointing that the cartoon illustrations are extremely low resolution and blurry. There's also no alt text. That said, they're a bit naff; so you aren't missing out on much.</p>\n\n<p>An interesting enough curio, but there are probably more rigorous and useful books out there.</p>\n",
    "description": "This is a curious and mostly charming book about therapy. It is presented as a (somewhat contrived) Socratic dialogue between Skynner the teacher and Cleese the pupil. Skynner lectures on while Cleese interjects with &#34;that&#039;s too clever to be convincing&#34; and other witty remarks. It is fun to have a somewhat sceptical interlocutor but it does get a little wearisome after a while. The basic of…",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Fri, 20 Feb 2026 12:34:57 +0000",
    "fetched_at": "2026-02-21T00:36:14.425181",
    "url_hash": "c06cd589666e5caef53fe249d1a6438a"
  },
  {
    "title": "The 2026/2027 Seattle Symphony subscription season at a glance",
    "link": "https://devblogs.microsoft.com/oldnewthing/20260220-01/?p=112076",
    "content": "<p><a href=\"https://devblogs.microsoft.com/oldnewthing/20060419-59/?p=31463\"> For</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20070223-01/?p=27883\"> two</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20080229-01/?p=23253\"> decades</a>, <a href=\"https://devblogs.microsoft.com/oldnewthing/20090203-01/?p=19273\"> I&#8217;ve</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20100208-01/?p=15013\"> put</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20110121-01/?p=11693\"> together</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20120126-01/?p=8443\"> a</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20130121-01/?p=5503\"> little</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20140127-01/?p=1953\"> pocket</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20150216-01/?p=44663\"> guide</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20160229-01/?p=93094\"> to</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20170220-01/?p=95495\"> the</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20180223-01/?p=98095\"> Seattle</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20190222-01/?p=101066\"> Symphony</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20200224-01/?p=103474\"> subscription</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20210323-01/?p=104989\"> season</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20220325-01/?p=106386\"> for</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20230313-01/?p=107931\"> my</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20240308-01/?p=109506\"> symphony</a> <a href=\"https://devblogs.microsoft.com/oldnewthing/20250328-01/?p=111020\"> friends</a> to help them decide which ticket package they want. We stopped going to the symphony as a group years ago, but I still create this pocket guide out of tradition.</p>\n<p>Here&#8217;s the at-a-glance season guide for the 2026/2027 season still with no comments from me because it&#8217;s not worth trying to rate every piece to help my friends pick one concert. If you&#8217;re my friend and want recommendations, just call. Besides, you can probably preview nearly all of the pieces nowadays (minus the premieres) by searching on YouTube.</p>\n<ul>\n<li><a href=\"https://issuu.com/seattlesymphony/docs/2026_2027_season_announce_brochure\"> Official brochure</a></li>\n<li><a href=\"https://seattlesymphonypress.squarespace.com/pressreleases/2026/2/19/music-director-xian-zhang-and-the-seattle-symphony-announce-the-20262027-season\"> Press release</a></li>\n<li><a href=\"https://seattlesymphony.org/subscribe\"> Subscribe</a></li>\n</ul>\n<p>Xian Zhang enters her second season as music director of the Seattle Symphony. She will lead the orchestra on Opening Night as well as for twelve subscription concerts, expanding from the nine subscription concerts she conducted in her debut season. Associate Conductor Sunny Xia is not listed on any of the concerts, nor is she mentioned in the press release, so her contract may have expired. Not sure.</p>\n<table id=\"schedule\" style=\"border: solid 1.5pt currentcolor; border-collapse: collapse;\" border=\"1\" rules=\"all\" cellpadding=\"0\">\n<colgroup style=\"padding-left: 1ex; padding-right: 1ex;\" span=\"2\"></colgroup>\n<tbody>\n<tr valign=\"bottom\">\n<th class=\"all\" style=\"padding: 0 1ex;\">Week</th>\n<th class=\"all\" style=\"padding: 0 1ex;\">Program</th>\n<td style=\"border-right: 1pt solid currentcolor; padding: 0;\" rowspan=\"25\"><!-- avoid WP inserting space --></td>\n<th class=\"19\" style=\"padding: 0; font-size: 80%;\">19</th>\n<th class=\"13\" style=\"padding: 0; font-size: 80%;\">13</th>\n<th class=\"6AB\" style=\"padding: 0; font-size: 80%;\">6A<br />\n6B</th>\n<th class=\"7CD\" style=\"padding: 0; font-size: 80%;\">7C<br />\n7D</th>\n<th class=\"6EF\" style=\"padding: 0; font-size: 80%;\">6E<br />\n6F</th>\n<td style=\"border-right: 1pt solid currentcolor; padding: 0;\" rowspan=\"25\"><!-- avoid WP inserting space --></td>\n<th class=\"10G\" style=\"padding: 0; font-size: 80%;\">10G</th>\n<th class=\"**\" style=\"padding: 0; font-size: 80%;\">**</th>\n</tr>\n<tr class=\"all **\">\n<td style=\"padding: 0 1ex;\">09/19<br />\n2026</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Prokofiev: Suite from <i>Lieutenant Kijé</i><br />\nProkofiev: Piano Concerto #3</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n</tr>\n<tr class=\"all 6AB 10G 19\">\n<td style=\"padding: 0 1ex;\">09/24<br />\n2026</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Bruch: Violin Concerto #1<br />\nBerlioz: <i>Symphonie fantastique</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 13 19\">\n<td style=\"padding: 0 1ex;\">10/22<br />\n2026</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Bridge: <i>Enter Spring</i><br />\nSamuel Adams: <i>No Such Spring</i><br />\nSchumann: Symphony #1 &#8220;Spring&#8221;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6EF 13 19\">\n<td style=\"padding: 0 1ex;\">11/05<br />\n2026</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Unsuk Chin: <i>Rocaná</i> (Room of Light)<br />\nSzymanowski: Violin Concerto #2<br />\nStravinsky: <i>Petroushka</i> (1947)</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6AB 10G 19\">\n<td style=\"padding: 0 1ex;\">11/12<br />\n2025</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Tchaikovsky: Piano Concerto #1<br />\nR. Strauss: <i>Also sprach Zarathustra</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 10G 13 19\">\n<td style=\"padding: 0 1ex;\">11/19<br />\n2025</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Joe Pereira: Timpani Concerto¹<br />\nMozart: Requiem</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all **\">\n<td style=\"padding: 0 1ex;\">01/24</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Itzhak Perlman in recital</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n</tr>\n<tr class=\"all 6EF 13 19\">\n<td style=\"padding: 0 1ex;\">01/28<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Haydn: Symphony #82 &#8220;The Bear&#8221;<br />\nMozart: Piano Concerto #25, K.503<br />\nMozart: <i>Eine kleine Nachtmusik</i><br />\nHaydn: Symphony #87</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 10G\">\n<td style=\"padding: 0 1ex;\">02/04<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Ibert: <i>Concertino da camera</i><br />\nSteven Banks: <i>Come As You Are</i><br />\nTchaikovsky: <i>Manfred</i> Symphony</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6AB 19\">\n<td style=\"padding: 0 1ex;\">02/11<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Lalo: <i>Symphonie espagnole</i><br />\nGinastera: Four Dances from <i>Estancia</i><br />\nRimsky-Korsakov: <i>Cappricio espagnol</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6EF 10G 13 19\">\n<td style=\"padding: 0 1ex;\">02/25</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Chaplin: <i>Modern Times</i> (with film)</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 13 19\">\n<td style=\"padding: 0 1ex;\">03/11<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Smetana: <i>The Moldau</i><br />\nSteven Mackey: Concerto for Orchestra¹<br />\nRimsky-Korsakov: <i>Scheherezade</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6EF 10G 13 19\">\n<td style=\"padding: 0 1ex;\">03/18</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Berlioz: <i>Roméo et Juliette</i>, Op.17</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all **\">\n<td style=\"padding: 0 1ex;\">03/19</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Hayato Sumino (&#8220;Cateen&#8221;) recital</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n</tr>\n<tr class=\"all **\">\n<td style=\"padding: 0 1ex;\">03/19<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Anna Lapwood with Seattle Symphony<br />\nMax Richter: <i>Cosmology</i><br />\nJongen: Sinfonia Concertante</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n</tr>\n<tr class=\"all 6AB 19\">\n<td style=\"padding: 0 1ex;\">04/08<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Vaughan Williams: <i>The Lark Ascending</i><br />\nGrieg: <i>Peer Gynt</i> Suite (selections)<br />\nWebern: <i>Im Sommerwind</i> (In the Summer Wind)<br />\nScriabin: <i>Poem of Ecstasy</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 10G 13 19\">\n<td style=\"padding: 0 1ex;\">04/15<br />\n2017</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Dvořák: Violin Concerto<br />\nBeethoven: Symphony #6 &#8220;Pastoral&#8221;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6EF 10G 13 19\">\n<td style=\"padding: 0 1ex;\">04/22<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Gabriela Montero: Piano Concerto #1 &#8220;Latin&#8221;<br />\nRespighi: <i>Fountains of Rome</i><br />\nRespighi: <i>Pines of Rome</i></td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6AB 19\">\n<td style=\"padding: 0 1ex;\">04/29<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Saariaho: <i>Lumière et Pésanteur</i> (Light and Gravity)<br />\nLutosławski: Piano Concerto<br />\nShostakovich: Symphony #10</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 13 19\">\n<td style=\"padding: 0 1ex;\">05/13<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Ian Cusson: <i>IQ84: Sinfonietta Metamoderna</i><br />\nRachmaninov: Piano Concerto #2<br />\nSibelius: Symphony #2</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6AB 10G 19\">\n<td style=\"padding: 0 1ex;\">06/03<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">R. Strauss: <i>Träumerei am Kamin</i><br />\n (Dreaming by the Fireside) from <i>Intermezzo</i><br />\nDebussy: <i>Ariettes Oubliées</i> (Forgotten Songs)<br />\n (arr. Brett Dean)<br />\nMahler: Symphony #4</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 6EF 10G 13 19\">\n<td style=\"padding: 0 1ex;\">06/17<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Brahms: Symphony in #3<br />\nBrahms: Violin Concerto</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n</tr>\n<tr class=\"all 7CD 13 19\">\n<td style=\"padding: 0 1ex;\">06/24<br />\n2027</td>\n<td style=\"padding: 0 1ex;\" nowrap=\"nowrap\">Liszt: Piano Concerto #2<br />\nWagner: <i>The Ring Without Words</i> (arr. Maazel)</td>\n<td style=\"background: #FF6600;\"> </td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td style=\"background: #FF6600;\"> </td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n</tr>\n<tr valign=\"top\">\n<th class=\"all\" style=\"padding: 0 1ex;\">Week</th>\n<th class=\"all\" style=\"padding: 0 1ex;\">Program</th>\n<th class=\"19\" style=\"padding: 0; font-size: 80%;\">19</th>\n<th class=\"13\" style=\"padding: 0; font-size: 80%;\">13</th>\n<th class=\"6AB\" style=\"padding: 0; font-size: 80%;\">6A<br />\n6B</th>\n<th class=\"7CD\" style=\"padding: 0; font-size: 80%;\">7C<br />\n7D</th>\n<th class=\"6EF\" style=\"padding: 0; font-size: 80%;\">6E<br />\n6F</th>\n<th class=\"10G\" style=\"padding: 0; font-size: 80%;\">10G</th>\n<th class=\"**\" style=\"padding: 0; font-size: 80%;\">**</th>\n</tr>\n</tbody>\n</table>\n<p>\n<script>\nfunction filter(c) {\n var rows = document.getElementById(\"schedule\").getElementsByTagName(\"TR\");\n for (var i = 0; i != rows.length; i++) {\n  var row = rows[i];\n  var className = row.className;\n  if (className != \"\") {\n   if (c == 'all' || className.indexOf(c) != -1) {\n    row.style.display = \"\";\n   } else {\n    row.style.display = \"none\";\n   }\n  }\n }\n}\n(function(){\n var headers = document.getElementById(\"schedule\").getElementsByTagName(\"TH\");\n for (var i = 0; i != headers.length; i++) {\n  (function(attr){\n    headers[i].onclick = function(){filter(attr);};\n  })(headers[i].className);\n }\n})();\n</script>\n</p>\n<p>¹ Seattle Symphony Co-commission and World Premiere</p>\n<p>Insider tip: Click a column header to focus on a specific series. (This feature has been around for several years, actually.)</p>\n<p>Legend:</p>\n<table class=\"cp3\" style=\"border: solid currentcolor .75pt; border-collapse: collapse;\" rules=\"all\" cellpadding=\"3\">\n<tbody>\n<tr>\n<td>19</td>\n<td>Symphonic Series 19-concert series (Choice of Thursdays or Saturdays)</td>\n</tr>\n<tr>\n<td>13</td>\n<td>Symphonic Series 13-concert series (Choice of Thursdays or Saturdays)</td>\n</tr>\n<tr>\n<td>6A</td>\n<td>Symphonic Series 6-concert series A (Thursdays)</td>\n</tr>\n<tr>\n<td>6B</td>\n<td>Symphonic Series 6-concert series B (Saturdays)</td>\n</tr>\n<tr>\n<td>7C</td>\n<td>Symphonic Series 7-concert series C (Thursdays)</td>\n</tr>\n<tr>\n<td>7D</td>\n<td>Symphonic Series 6-concert series D (Saturdays)</td>\n</tr>\n<tr>\n<td>6E</td>\n<td>Symphonic Series 6-concert series E (Thursdays)</td>\n</tr>\n<tr>\n<td>6F</td>\n<td>Symphonic Series 7-concert series F (Saturdays)</td>\n</tr>\n<tr>\n<td>10G</td>\n<td>Symphonic Series 10-concert series G (Sunday afternoons)</td>\n</tr>\n<tr>\n<td>**</td>\n<td>Various special concerts (individually priced)</td>\n</tr>\n</tbody>\n</table>\n<p>For those not familiar with the Seattle Symphony ticket package line-ups: Most of the ticket packages are named <i>Symphonic Series nX</i> (formerly named <i>Masterworks nX</i>) where <i>n</i> is the number of concerts in the package, and the letter indicates the variation. Ticket packages have been combined if they are identical save for the day of the week. For example, 7C and 7D are the same concerts; the only difference is that 7C is for Thursday nights, while 7D is for Saturday nights. The exception is the column I marked **, which is just a grab bag of special concerts.</p>\n<p>Notes and changes:</p>\n<ul>\n<li>The main symphony season has been reduced from 21 programs to 19. The A, B, E, and F series have consequently been reduced from 7 concerts to 6. The Sunday series has been expanded from 8 to 10 concerts, which the Seattle Symphony claims is due to popular demand. The four-concert Friday series has been dropped.</li>\n<li>The 6A/6B, 7C/7D, and 6E/6F concert series do not overlap, so you can create your own pseudo-series by taking any two of them, or recreate the 19-concert series by taking all three.</li>\n<li>The 13-concert series is the same as the 7C/7D and 6E/6F series combined.</li>\n<li>The Saturday concert for the weekend of May 13 has been moved to Friday.</li>\n<li>The 2026/2027 season will be the first to take advantage of the <a href=\"https://www.seattlesymphony.org/amplify\"> Amplify</a> project&#8217;s renovation of the public spaces.</li>\n<li>The <a href=\"https://www.seattlesymphony.org/concerttickets/special-offers/youth-tickets\"> Youth Tickets</a> program provides $25 tickets to up to children per concert for all Symphonic Series concerts, plus most other concerts. If you purchase an adult subscription, you can add a matching Youth Subscription at the same rate of $25 per concert.</li>\n<li>The Seattle Symphony is part of the <a href=\"https://www.seattlesymphony.org/concerttickets/special-offers/teen-tix\"> TeenTix</a> program which offers teenagers (ages 13 through 19) $5 day-of-show tickets for selected concerts. TeenTix members can also buy up to two $10 tickets for Sunday concerts for non-teenage friends and family.</li>\n<li>Notable guests: Special concerts by Itzhak Perlman and Hayato Sumino (who is apparently a popular YouTuber), and organist Anna Lapwood. Superstar pianist Yuja Wang performs on Opening Night (Prokofiev Piano Concerto #3). Other prominent soloists performing at regular season concerts are Emanuel Ax (Mozart Piano Concerto #25), Gil Shaham (Dvořák Violin Concerto), and Benjamin Grosvenor (Rachmaninov Piano Concerto #2).</li>\n<li>Conductor Emeritus Ludovic Morlot returns to conduct a Spring-themed concert on the weekend of October 22. There is also a Spain-and-South-America themed concert (led by Xian Zhang) on the weekend of February 11.</li>\n<li>Soundtrack-with-film concerts continue to remain popular, and for the first time I can recall, one of these concerts makes it to the regular subscription series: A performance of the score to <i>Modern Times</i> to accompany the film.</li>\n<li>The April 8, April 15, and April 22 concerts form an in-season <i>Nature in Music Festival</i>.</li>\n<li>Additional series not listed above include the <i>In Recital</i>, <i>Seattle Pops</i>, <i>Octave 9</i>, <i>Chamber</i>, <i>Tiny Tots</i>, and <i>Family Concerts</i>, as well as a collection of holiday concerts in December. (This year, we have <i>Messiah</i> but no Beethoven&#8217;s 9th.)</li>\n<li>Over the years, the format of the Seattle Symphony official brochure has gradually gotten closer and closer to the format of this pocket guide. This makes my job both easier and arguably superfluous.</li>\n</ul>\n<p>The post <a href=\"https://devblogs.microsoft.com/oldnewthing/20260220-01/?p=112076\">The 2026/2027 Seattle Symphony subscription season at a glance</a> appeared first on <a href=\"https://devblogs.microsoft.com/oldnewthing\">The Old New Thing</a>.</p>\n",
    "description": "The pocket reference guide for 2026/2027. The post The 2026/2027 Seattle Symphony subscription season at a glance appeared first on The Old New Thing.",
    "is_fulltext": true,
    "source": "The Old New Thing",
    "pub_date": "Fri, 20 Feb 2026 15:00:01 +0000",
    "fetched_at": "2026-02-21T00:36:17.401504",
    "url_hash": "e88e64f218cfd262cd08766493c510ae"
  },
  {
    "title": "The unbearable weight of cruft",
    "link": "https://www.joanwestenberg.com/the-unbearable-weight-of-cruft/",
    "content": "",
    "description": "",
    "is_fulltext": false,
    "source": "Westenberg.",
    "pub_date": "Fri, 20 Feb 2026 22:54:49 GMT",
    "fetched_at": "2026-02-21T00:36:36.645342",
    "url_hash": "7adffda4c2e47c6cafb2fbf131ef7347"
  },
  {
    "title": "Premium: The Hater's Guide to Anthropic",
    "link": "https://www.wheresyoured.at/premium-the-haters-guide-to-anthropic/",
    "content": "<p>In May 2021, Dario Amodei and a crew of other former OpenAI researchers <a href=\"https://techcrunch.com/2021/05/28/anthropic-is-the-new-ai-research-outfit-from-openais-dario-amodei-and-it-has-124m-to-burn/?ref=wheresyoured.at\"><u>formed Anthropic</u></a> and dedicated themselves to building the single-most-annoying Large Language Model company of all time.&#xA0;</p><p>Pardon me, sorry, I mean <em>safest</em>, <a href=\"https://finance.yahoo.com/news/anthropic-ceo-says-why-quit-194409797.html?ref=wheresyoured.at\"><u>because that&#x2019;s the reason that Amodei and his crew claimed was why they left OpenAI</u></a>:</p><blockquote>Dario Amodei: Yeah. So there was a group of us within OpenAI, that in the wake of making GPT-2 and GPT-3, had a kind of very strong focus belief in two things. I think even more so than most people there. One was the idea that if you pour more compute into these models, they&apos;ll get better and better and that there&apos;s almost no end to this. I think this is much more widely accepted now. But, you know, I think we were among the first believers in it. And the second was the idea that you needed something in addition to just scaling the models up, which is alignment or safety. You don&apos;t tell the models what their values are just by pouring more compute into them. And so there were a set of people who believed in those two ideas. We really trusted each other and wanted to work together. And so we went off and started our own company with that idea in mind.</blockquote><p>I&#x2019;m also being a little sarcastic. Anthropic, a &#x201C;public benefit corporation&#x201D; (a company that is quasi-legally required to sometimes sort of focus on goals that aren&#x2019;t profit driven, and in this case, one that chose to incorporate in Delaware as opposed to California, where it would have actual obligations), is the only meaningful competitor to OpenAI, one that went from (allegedly) <a href=\"https://www.theinformation.com/articles/anthropics-claude-drives-strong-revenue-growth-while-powering-manus-sensation?rc=9mzoog&amp;ref=wheresyoured.at\"><u>making about $116 million in March 2025</u></a> <a href=\"https://www.anthropic.com/news/anthropic-raises-30-billion-series-g-funding-380-billion-post-money-valuation?ref=wheresyoured.at\"><u>to making $1.16 billion in February 2026</u></a>, in the very same month it raised $30 billion from <em>thirty-seven different investors,</em> including a &#x201C;partial&#x201D; investment from NVIDIA and Microsoft <a href=\"https://www.anthropic.com/news/microsoft-nvidia-anthropic-announce-strategic-partnerships?ref=wheresyoured.at\"><u>announced in November 2025</u></a> that was meant to be &#x201C;up to&#x201D; $15 billion.&#xA0;</p><p><a href=\"https://arena.ai/leaderboard?ref=wheresyoured.at\"><u>Anthropic&#x2019;s models regularly dominate the various LLM model leaderboards</u></a>, and its Claude Code command-line interface tool (IE: a terminal you type stuff into) has become quite popular with developers who either claim it writes every single line of their code, or that it&#x2019;s vaguely useful in some situations.&#xA0;</p><p>CEO Dario Amodei <a href=\"https://futurism.com/six-months-anthropic-coding?ref=wheresyoured.at\"><u>predicted</u></a> last March that in six months AI would be writing 90% of code, and when that didn&#x2019;t happen, <a href=\"https://finance.yahoo.com/news/anthropic-ceo-predicts-ai-models-233113047.html?ref=wheresyoured.at\"><u>he simply made the same prediction again in January</u></a>, because, and I do not say this lightly, <em>Dario Amodei is full of shit.</em></p><p>You see, Anthropic has, for the best part of five years, been framing itself as the <em>trustworthy</em>, <em>safe</em> alternative to OpenAI, focusing more on its paid offerings and selling to businesses (realizing that <a href=\"https://ludic.mataroa.blog/blog/brainwash-an-executive-today/?ref=wheresyoured.at\"><u>the software sales cycle usually focuses on dimwitted c-suite executives rather than those who actually use the products</u></a>), as opposed to building a giant, expensive free product that lots of people use but almost nobody pays for.&#xA0;</p><p>Anthropic, separately, has avoided following OpenAI in making gimmicky (and horrendously expensive) image and video generation tools, which I assume is partly due to the cost, but also because neither of those things are likely something that an enterprise actually cares about.&#xA0;</p><p>Anthropic also caught on early to the idea that coding was the one use case that Large Language Models fit naturally:</p><ul><li>Thanks to sites like Stack Overflow and Github, as well as the trillions of lines of open source code in circulation, there&#x2019;s an absolute fuckton of material to train the model on.</li><li>Software engineers are data perverts (I mean this affectionately), and will try basically anything to speed up, automate or &#x201C;add efficiency&#x201D; to their work.</li><li>Software engineering is a job that most members of the media don&#x2019;t understand.</li><li>Software engineers <em>never shut the fuck up</em> when they&#x2019;ve found something new that feels good.</li><li>Software engineers will spend hours only defending the honour of any corporation that courts them.</li><li>Software engineers will at times overestimate their capabilities, as demonstrated by <a href=\"https://www.theregister.com/2025/07/11/ai_code_tools_slow_down/?ref=wheresyoured.at\"><u>&#xA0;the METR study that found that developers believed they were 24% faster when using LLMs, when in fact coding models made them 19% slower</u></a>.<ul><li>This, naturally, makes them quite defensive of the products they use, and whether or not they&#x2019;re actually seeing improvements.</li></ul></li></ul><p>Anthropic has held the lead in coding LLMs <a href=\"https://venturebeat.com/ai/the-code-whisperer-how-anthropics-claude-is-changing-the-game-for-software-developers?ref=wheresyoured.at\"><u>since the launch of June 2024&#x2019;s Claude Sonnet 3.5</u></a>, and as a story from The Information from December 2024 explained, <a href=\"https://www.theinformation.com/articles/how-anthropic-got-inside-openais-head?rc=kz8jh3&amp;ref=wheresyoured.at\"><u>this <em>terrified</em> OpenAI</u></a>:</p><blockquote>Earlier this fall, OpenAI leaders got a shock when they saw the performance of Anthropic&#x2019;s artificial intelligence model for automating computer programming tasks, which had gained an edge on OpenAI&#x2019;s models, according to its own internal benchmarks. AI for coding is one of OpenAI&#x2019;s strong suits and one of the main reasons why millions of people subscribe to its chatbot, ChatGPT.<br><br>OpenAI leaders were already on edge after Cursor, a startup OpenAI funded last year, in July made Anthropic&#x2019;s Claude model the default for Cursor&#x2019;s AI coding assistant instead of OpenAI&#x2019;s models, as it had previously done, according to an OpenAI employee. In a podcast in October, Cursor co-founder Aman Sanger called the latest version of Anthropic&#x2019;s model, Claude 3.5 Sonnet, the &#x201C;net best&#x201D; for coding in part because of its superior understanding of what customers ask it to do.</blockquote><p>Cursor would, of course, eventually go on to become its own business, <a href=\"https://techcrunch.com/2025/05/04/cursor-is-reportedly-raising-funds-at-9-billion-valuation-from-thrive-a16z-and-accel/?ref=wheresyoured.at\"><u>raising</u></a> <a href=\"https://www.cnbc.com/2025/11/13/cursor-ai-startup-funding-round-valuation.html?ref=wheresyoured.at\"><u>$3.2 billion</u></a> in 2025 to compete with Claude Code, a product made by Anthropic, which Cursor pays to offer its models through its AI coding product. <a href=\"https://www.theinformation.com/newsletters/dealmaker/anthropic-revenue-pace-nears-5-billion-run-mega-round?ref=wheresyoured.at&amp;rc=kz8jh3\"><u>Cursor is Anthropic&#x2019;s largest customer, with the second being Microsoft&#x2019;s Github Copilot</u></a>. I have heard from multiple sources that Cursor is spending more than 100% of its revenue on API calls, with the majority going to Anthropic and OpenAI, both of whom now compete with Cursor.</p><h1 id=\"dario-amodei-is-an-even-bigger-liar-than-sam-altman-he%E2%80%99s-just-better-with-the-media\">Dario Amodei Is An Even Bigger Liar Than Sam Altman, He&#x2019;s Just Better With The Media</h1><p>Anthropic sold itself as the stable, thoughtful, safety-oriented AI lab, with Amodei himself saying in <a href=\"https://www.dwarkesh.com/p/dario-amodei?ref=wheresyoured.at\"><u>an August 2023 interview</u></a> that he purposefully avoided the limelight:</p><blockquote>Dwarkesh Patel (01:56:14 - 01:56:26):<br><br>You&apos;ve been less public than the CEOs of other AI companies. You&apos;re not posting on Twitter, you&apos;re not doing a lot of podcasts except for this one. What gives? Why are you off the radar?<br><br>Dario Amodei (01:56:26 - 01:58:03):<br><br>I aspire to this and I&apos;m proud of this. If people think of me as boring and low profile, this is actually kind of what I want. I&apos;ve just seen cases with a number of people I&apos;ve worked with, where attaching your incentives very strongly to the approval or cheering of a crowd can destroy your mind, and in some cases, it can destroy your soul.<br><br>I&apos;ve deliberately tried to be a little bit low profile because I want to defend my ability to think about things intellectually in a way that&apos;s different from other people and isn&apos;t tinged by the approval of other people. I&apos;ve seen cases of folks who are deep learning skeptics, and they become known as deep learning skeptics on Twitter. And then even as it starts to become clear to me, they&apos;ve sort of changed their mind. This is their thing on Twitter, and they can&apos;t change their Twitter persona and so forth and so on.<br><br>I don&apos;t really like the trend of personalizing companies. The whole cage match between CEOs approach. I think it distracts people from the actual merits and concerns of the company in question. I want people to think in terms of the nameless, bureaucratic institution and its incentives more than they think in terms of me. Everyone wants a friendly face, but actually, friendly faces can be misleading.</blockquote><p>A couple of months later in October 2023, Amodei <a href=\"https://www.theloganbartlettshow.com/archive/ep-82-dario-amodeis-ai-predictions-through-2030?ref=wheresyoured.at\"><u>joined The Logan Bartlett show</u></a>, saying that he &#x201C;didn&#x2019;t like the term AGI&#x201D; because, and I shit you not, &#x201C;...because we&#x2019;re closer to the kinds of things that AGI is pointing at,&#x201D; making it &#x201C;no longer a useful term.&#x201D; He said that there was a &#x201C;future point&#x201D; where a model could &#x201C;build dyson spheres around the sun and calculate the meaning of life,&#x201D; before rambling incoherently and suggesting that these things were both very close and far away at the same time. He also predicted that &#x201C;no sooner than 2025, maybe 2026&#x201D; that AI would &#x201C;really invent new science.&#x201D;</p><p>This was all part of Anthropic&#x2019;s use of well-meaning language to tell a story that said &#x201C;you should be scared&#x201D; and &#x201C;only Anthropic will save you.&#x201D; <a href=\"https://www.judiciary.senate.gov/imo/media/doc/2023-07-26_-_testimony_-_amodei.pdf?ref=wheresyoured.at\"><u>In July 2023</u></a>, Amodei spoke before a senate committee about AI oversight and regulation, starting sensible (IE: if AI does become powerful, we should have regulations to mitigate those problems) and eventually veering aggressively into marketing slop:</p><blockquote>The medium-term risks are where I would most like to draw the subcommittee&#x2019;s attention. Simply put, a straightforward extrapolation of the pace of progress suggests that, in 2-3 years, AI systems may facilitate extraordinary insights in broad swaths of many science and engineering disciplines. This will cause a revolution in technology and scientific discovery, but also greatly widen the set of people who can wreak havoc. In particular, I am concerned that AI systems could be misused on a grand scale in the domains of cybersecurity, nuclear technology, chemistry, and especially biology.&#xA0;</blockquote><h2 id=\"dario-amodei-manipulates-the-media-with-baseless-proclamations-built-to-scare-readers-trick-businesses-and-raise-funding\">Dario Amodei Manipulates The Media With Baseless Proclamations Built To Scare Readers, Trick Businesses, and Raise Funding</h2><p>This is Amodei&#x2019;s favourite marketing trick &#x2014; using a vague timeline (2-3 years) to suggest that something vaguely bad that&#x2019;s also good for Anthropic is just around the corner, but managed correctly, could also be good for society (a revolution in technology and science! But also, <em>havoc!</em>). Only Dario has&#xA0; the answers (regulations that start with &#x201C;securing the AI supply chain&#x201D; meaning &#x201C;please stop China from competing&#x201D;).&#xA0;</p><p>In retrospect, this was the most honest that he&#x2019;d ever be. In 2024, Amodei would quickly learn that he <em>loved</em> personalizing companies, and that destroying his soul fucking <em>rocked.&#xA0;</em></p><p>In October 2024,<em> </em>Amodei <a href=\"https://www.darioamodei.com/essay/machines-of-loving-grace?ref=wheresyoured.at\"><u>put out a 15,000-word-long blog</u></a> &#x2014; ugh, AI is coming for my job! &#x2014; where he&#x2019;d say that Anthropic needed to &#x201C;avoid the perception of propaganda&#x201D; while also saying that &#x201C;as early as 2026 (but there are also ways it could take much longer),&#x201D; AI would be smarter than a Nobel Prize winner, autonomously able to complete weeks-long tasks, and be the equivalent of a &#x201C;country of geniuses in a datacenter.&#x201D;&#xA0;</p><p>This piece, like all of his proclamations, had two goals: generating media coverage and investment. Amodei is a deeply dishonest man, couching &#x201C;predictions&#x201D; based on nothing in terms like &#x201C;maybe,&#x201D; &#x201C;possibly,&#x201D; or &#x201C;as early as,&#x201D; knowing that the media will simply ignore those words and report what he says as a wise, evidence-based fact.&#xA0;</p><p>Amodei (and by extension Anthropic) nakedly manipulates the media by having them repeat these things without analysis or counterpoints &#x2014; <a href=\"https://arstechnica.com/ai/2025/01/anthropic-chief-says-ai-could-surpass-almost-all-humans-at-almost-everything-shortly-after-2027/?ref=wheresyoured.at\"><u>such as that &#x201C;AI could surpass almost all humans at almost everything shortly after 2027</u></a> (which I&#x2019;ll get back to in a bit).&#x201D; He knows that these things aren&#x2019;t true. He knows he doesn&#x2019;t have any proof. And he knows that nobody will ask, and that his bullshit will make for a sexy traffic-grabbing headline.</p><p>To be clear, that statement was made three months after Amodei&#x2019;s essay said that AI labs needed to avoid &#x201C;the perception of propaganda.&#x201D; Amodei is a con artist that knows he can&#x2019;t sell Anthropic&#x2019;s products by explaining what they actually do, and everybody is falling for it.</p><p>And, almost always, these predictions match up with Anthropic&#x2019;s endless fundraising. On September 23, 2024, <a href=\"http://theinformation.com/articles/openai-rival-anthropic-has-floated-40-billion-valuation-in-early-talks-about-new-funding?rc=kz8jh3&amp;ref=wheresyoured.at\"><u>The Information reported</u></a> that Anthropic was raising a round at a $30-$40 billion valuation, and on October 12 2024, <a href=\"https://www.darioamodei.com/essay/machines-of-loving-grace?ref=wheresyoured.at\"><u>Amodei pooped out Machines of Loving Grace</u></a> with the express position that he and Anthropic &#x201C;had not talked that much about powerful AI&#x2019;s upsides.&#x201D;&#xA0;</p><p><a href=\"https://techcrunch.com/2024/11/22/anthropic-raises-an-additional-4b-from-amazon-makes-aws-its-primary-cloud-partner/?ref=wheresyoured.at\"><u>A month later on November 22, 2024</u></a>, Anthropic would raise another $4 billion from Amazon, a couple of weeks after doing <a href=\"https://lexfridman.com/dario-amodei-transcript/?ref=wheresyoured.at\"><u>a <em>five-hour-long </em>interview with Lex Fridman</u></a> in which he&#x2019;d say that &#x201C;someday AI would be better at everything.&#x201D;&#xA0;</p><p><a href=\"https://www.newcomer.co/p/listen-to-anthropics-dario-amodei?ref=wheresyoured.at\"><u>On November 27, 2024</u></a>, Amodei would do a fireside chat at Eric Newcomer&#x2019;s Cerebral Valley AI Summit where he&#x2019;d say that in 2025, 2026, or 2027 (yes, he was that vague), AI could be as &#x201C;good as a Nobel Prize winner, polymathic across many fields,&#x201D; and have &#x201C;agency [to] act on its own for hours or days,&#x201D; the latter of which deliberately laid foundation for one of Anthropic&#x2019;s greatest lies: that AI can &#x201C;work uninterrupted&#x201D; for periods of time, leaving the reader or listener to fill in the (unsaid) gap of &#x201C;...and actually create useful stuff.&#x201D;</p><p>Amodei crested 2024 with <a href=\"https://www.ft.com/content/e75e3388-4700-413d-ab67-778410c2d977?ref=wheresyoured.at\"><u>an interview with the Financial Times</u></a>, and let slip what I believe will eventually become Anthropic&#x2019;s version of <a href=\"https://www.asimplemodel.com/bips/bip-feed/community-adjusted-ebitda?ref=wheresyoured.at\"><u>WeWork&#x2019;s Community-Adjusted EBITDA</u></a>, by which I mean &#x201C;a way to lie and suggest profitability when a company isn&#x2019;t profitable&#x201D;:</p><blockquote>Let&#x2019;s just take a hypothetical company. Let&#x2019;s say you train a model in 2023. The model costs $100mn dollars. And, then, in 2024, that model generates, say, $300mn of revenue. Then, in 2024, you train the next model, which costs $1bn. And that model isn&#x2019;t done yet, or it gets released near the end of 2024. Then, of course, it doesn&#x2019;t generate revenue until 2025.&#xA0;<br><br>So, if you ask &#x201C;is the company profitable in 2024&#x201D;, well, you made $300mn and you spent $1bn, so it doesn&#x2019;t look profitable. If you ask, was each model profitable? Well, the 2023 model cost $100mn and generated several hundred million in revenue. So, the 2023 model is a profitable proposition.<br><br>These numbers are not Anthropic numbers. But what I&#x2019;m saying here is: the cost of the models is going up, but the revenue of each model is going up and there&#x2019;s a mismatch in time because models are deployed substantially later than they&#x2019;re trained.</blockquote><p>Yeah man, if a company made $300 million in revenue and spent $1 billion. No amount of DarioMath about how a model &#x201C;costs this much and makes this much revenue&#x201D; changes the fact that profitability is when a company makes more money than it spends.&#xA0;</p><p>On January 5, 2025, Forbes <a href=\"https://www.forbes.com/sites/alexkonrad/2025/01/08/anthropic-60-billion-valuation-will-make-all-seven-cofounders-billionaires/?ref=wheresyoured.at\"><u>would report that Anthropic was working on a $60 billion round that would make Amodei, his sister Daniela, and five other cofounders billionaires</u></a>.</p><p>Anyway, as I said at Davos on January 21, 2025, <a href=\"https://www.youtube.com/watch?v=7LNyUbii0zw&amp;ref=wheresyoured.at\"><u>Amodei said</u></a> that he was &#x201C;more confident than ever&#x201D; that we&#x2019;re &#x201C;very close&#x201D; to &#x201C;powerful capabilities,&#x201D; defined as &#x201C;systems that are better than almost all humans at almost all terms,&#x201D; citing his long, boring essay. A day later, <a href=\"https://www.cnbc.com/2025/01/22/google-agrees-to-new-1-billion-investment-in-anthropic.html?ref=wheresyoured.at\"><u>Anthropic would raise another $1 billion from Google</u></a>.</p><p>On January 27, 2025, he&#x2019;d <a href=\"https://youtu.be/uvMolVW_2v0?si=7t3rnG0BEUU51jf8&amp;t=2261&amp;ref=wheresyoured.at\"><u>tell Economist editor-in-chief Zanny Minton Beddoes</u></a> that AI would get &#x201C;as good and eventually better&#x201D; at thinking as human beings, and that the ceiling of what models could do was &#x201C;well above humans.&#x201D;&#xA0;</p><p>On February 18, 2025, he&#x2019;d tell Beddoes that we&#x2019;d get a model &#x201C;...that can do everything a human can do at the level of a Nobel laureate across many fields&#x201D; by 2026 or 2027, and that we&#x2019;re &#x201C;on the eve of something that has great challenges&#x201D; that would &#x201C;upend the balance of power&#x201D; because we&#x2019;d have &#x201C;10 million people smarter than any human alive&#x2026;&#x201D; oh god, I&#x2019;m not fucking writing it out. I&#x2019;m sorry. It&#x2019;s always the same shit. The models are people, we&#x2019;re so scared.&#xA0;</p><p>On February 28, 2025, <a href=\"https://www.nytimes.com/2025/02/28/podcasts/hardfork-anthropic-dario-amodei.html?showTranscript=1&amp;ref=wheresyoured.at\"><u>Amodei would join the New York Times&#x2019; Hard Fork</u></a>, saying that he wanted to &#x201C;slow down authoritarians,&#x201D; and that &#x201C;public officials and leaders at companies&#x201D; would &#x201C;look back at this period [where humanity would become a &#x201C;post-powerful AI society that co-exists with powerful intelligences]&#x201D; and &#x201C;feel like a fool,&#x201D; and that that was the number one goal of these people. Amodei would also add that he had been in the field for 10 years &#x2014; something he loves to say! &#x2014; and that there was a 70-80% chance that we will &#x201C;get a very large number of AI systems that are much smarter than humans at almost everything&#x201D; before the end of the decade.</p><p>Three days later, <a href=\"https://www.anthropic.com/news/anthropic-raises-series-e-at-usd61-5b-post-money-valuation?ref=wheresyoured.at\"><u>Anthropic would raise $3.5 billion at a $61.5 billion valuation</u></a>.</p><p>Beneath the hype, Anthropic is, like OpenAI, a company making LLMs that can generate code and text, and that can interpret data from images and videos, all while burning billions of dollars and having no path to profitability. <a href=\"https://www.theinformation.com/articles/anthropic-lowers-profit-margin-projection-revenue-skyrockets?rc=kz8jh3&amp;ref=wheresyoured.at\"><u>Per The Information</u></a>, Anthropic made $4.5 billion in revenue and <em>lost $5.2 billion</em> generating it, and <a href=\"https://www.wheresyoured.at/costs/\"><u>based on my own reporting from last year</u></a>, costs appear to scale linearly above revenue.</p><h2 id=\"dario-amodei-admits-training-costs-are-never-going-away-%E2%80%94-and-need-to-be-considered-part-of-every-ai-lab%E2%80%99s-gross-margins\">Dario Amodei Admits Training Costs Are Never Going Away &#x2014; And Need To Be Considered Part Of Every AI Lab&#x2019;s Gross Margins</h2><p>Some will argue that the majority of Anthropic&#x2019;s losses ($4.1 billion) were from training, and I think it&#x2019;s time we had a chat about what &#x201C;training&#x201D; means, especially <a href=\"https://www.theinformation.com/articles/anthropic-hikes-2026-revenue-forecast-20-delays-will-go-cash-flow-positive?rc=kz8jh3&amp;ref=wheresyoured.at\"><u>as Anthropic plans to spend $100 billion on it in the next four years</u></a>. Per my piece from last week:</p><blockquote>While most people know about pretraining &#x2014; the shoving of large amounts of data into a model (this is a simplification I realize) &#x2014; in reality a lot of the current spate of models use <a href=\"https://towardsdatascience.com/different-ways-of-training-llms-c57885f388ed/?ref=wheresyoured.at\"><u>post-training</u></a>, which covers everything from small tweaks to model behavior to full-blown reinforcement learning where experts reward or punish particular responses to prompts.<br><br>To be clear, all of this is well-known and documented, but the nomenclature of &#x201C;training&#x201D; suggests that it might stop one day, versus the truth: training costs are increasing dramatically, and &#x201C;training&#x201D; covers anything from training new models to bug fixes on existing ones. And, more fundamentally, it&#x2019;s an ongoing cost &#x2014; something that&#x2019;s an essential and unavoidable cost of doing business.&#xA0;</blockquote><p><a href=\"https://www.dwarkesh.com/p/dario-amodei-2?ref=wheresyoured.at\"><u>In an interview on the Dwarkesh Podcast</u></a>, Amodei even admitted that if you &#x201C;never train another model&#x201D; you &#x201C;don&#x2019;t have any demand because you&#x2019;ll fall behind.&#x201D; Training is opex, and should be part of gross margins.</p><p>It&#x2019;s time we had an honest conversation about Anthropic.&#xA0;</p><p>Despite its positioning as the trustworthy, &#x201C;nice&#x201D; AI lab, Anthropic is as big, ugly and wasteful as OpenAI, and Dario Amodei is an even bigger bullshit artist than Sam Altman. It burns just as much of its revenue on inference (59%, or <a href=\"https://www.theinformation.com/articles/anthropic-lowers-profit-margin-projection-revenue-skyrockets?rc=kz8jh3&amp;ref=wheresyoured.at\"><u>$2.79 billion on $4.5 billion of revenue</u></a>, versus <a href=\"https://www.theinformation.com/articles/openais-first-half-results-4-3-billion-sales-2-5-billion-cash-burn?ref=wheresyoured.at&amp;rc=kz8jh3\"><u>OpenAI&#x2019;s 62%, or $2.5 billion&#xA0; on $4.3 billion of revenue in the first half of 2025</u></a>, if you use The Information&#x2019;s numbers), and shows no sign of any &#x201C;efficiency&#x201D; or &#x201C;cost-cutting.&#x201D;</p><p>Worse still, Anthropic continually abuses its users through varying rate limits to juice revenues and user numbers &#x2014; along with Amodei&#x2019;s gas-leak-esque proclamations &#x2014; to mislead the media, the general public, and investors about the financial condition of the company.&#xA0;</p><p>Based on an analysis of many users&#x2019; actual token burn on Claude Code, I believe Anthropic is burning anywhere from $3 to $20 to make $1, and that the product that users are using (and the media is raving about) is not one that Anthropic can actually support long-term.&#xA0;</p><p>I also see signs that Amodei himself is playing fast and loose with financial metrics in a way that will blow up in his face if Anthropic ever <a href=\"https://www.wsj.com/tech/ai/anthropic-ai-board-chris-liddell-1df5545b?gaa_at=eafs&amp;gaa_n=AWEtsqfNKD2LgPo463_9OcqzY2Ba9CmMYehC8WgffNTzXC_dlAKv8QN57HNerbgN4GE%3D&amp;gaa_ts=6995155d&amp;gaa_sig=B7vLmFMES_vR_LUBlacwOgz4q0W_-V7cWzf7Ccg9pX2HL2teC2CxD00IHqPf8BAS9o6q3m3nbh04jbD8OTeIGg%3D%3D&amp;ref=wheresyoured.at\"><u>files its paperwork to go public</u></a>. In simpler terms, Anthropic&#x2019;s alleged &#x201C;<a href=\"https://www.theinformation.com/articles/anthropic-lowers-profit-margin-projection-revenue-skyrockets?ref=wheresyoured.at\"><u>38% gross margins</u></a>&#x201D; are, if we are to believe Amodei&#x2019;s own words, not the result of &#x201C;revenue minus COGS&#x201D; but &#x201C;how much a model costs and how much revenue it&#x2019;s generated.&#x201D;</p><p>Anthropic is also making promises it can&#x2019;t keep. It&#x2019;s <a href=\"https://www.anthropic.com/news/microsoft-nvidia-anthropic-announce-strategic-partnerships?ref=wheresyoured.at\"><u>promising to spend $30 billion on Microsoft Azure</u></a> (and an additional &quot;up to one gigawatt&#x201D;), <a href=\"https://www.anthropic.com/news/expanding-our-use-of-google-cloud-tpus-and-services?ref=wheresyoured.at\"><u>&#x201C;tens of billions&#x201D; on Google Cloud</u></a>, <a href=\"https://www.cnbc.com/2025/12/11/broadcom-reveals-its-mystery-10-billion-customer-is-anthropic.html?ref=wheresyoured.at\"><u>$21 billion on Google TPUs with Broadcom</u></a>, <a href=\"https://www.anthropic.com/news/anthropic-invests-50-billion-in-american-ai-infrastructure?ref=wheresyoured.at\"><u>&#x201C;$50 billion on American infrastructure,&#x201D;</u></a> <a href=\"https://www.datacenterdynamics.com/en/news/hut-8-signs-245mw-capacity-deal-with-fluidstack-as-part-of-multi-gigawatt-partnership-with-anthropic/?ref=wheresyoured.at\"><u>as much as $3 billion on Hut8&#x2019;s data center in Louisiana</u></a>, and an unknowable (yet likely in the billions) amount of money with Amazon Web Services. Not to worry, Dario also adds that if you&#x2019;re off by a couple of years on your projections of revenue and ability to pay for compute, <a href=\"https://www.datacenterdynamics.com/en/news/anthropic-ceo-the-way-you-buy-these-data-centers-if-youre-off-by-a-couple-years-can-be-ruinous/?ref=wheresyoured.at\"><u>it&#x2019;ll be &#x201C;ruinous.&#x201D;</u></a></p><p>I think that he&#x2019;s right. Anthropic cannot afford to pay its bills, as the ruinous costs of training &#x2014; which will never, ever stop &#x2014; and inference will always outpace whatever spikes of revenue it can garner through media campaigns built on deception, fear-mongering, and an exploitation of reporters unwilling to ask or think about the hard questions.&#xA0;</p><p>I see no difference between <a href=\"https://www.wheresyoured.at/the-enshittifinancial-crisis/#ai-accelerated-the-enshittification-of-the-stock-market\"><u>OpenAI&#x2019;s endless bullshit non-existent deal announcements</u></a> and what Anthropic has done in the last few months. Anthropic is as craven and deceptive as OpenAI, and Dario Amodei is as willing a con artist as Altman, and I believe is desperately jealous of his success.</p><p>And after hours and hours of listening to Amodei talk, I think he is one of the most annoying, vacuous, bloviating fuckwits in tech history. He rambles endlessly, stutters more based on how big a lie he&#x2019;s telling, and will say anything and everything to get on TV and say noxious, fantastical, intentionally-manipulative bullshit to people who should know better but never seem to learn. He stammers, he blithers, he rambles, he continually veers between &#x201C;this is about to happen&#x201D; and &#x201C;actually it&#x2019;s far away&#x201D; so that nobody can say he&#x2019;s a liar, but that&#x2019;s exactly what I call a person who intentionally deceives people, even if they couch their lies in &#x201C;maybes&#x201D; and &#x201C;possiblies.&#x201D;&#xA0;</p><p>Dario Amodei fucking sucks, and it&#x2019;s time to stop pretending otherwise. Anthropic has no more soul or ethics than OpenAI &#x2014; it&#x2019;s just done a far better job of conning people into believing otherwise.</p><p>This is the Hater&#x2019;s Guide To Anthropic, or &#x201C;DarioWare: Get It Together.&#x201D;&#xA0;</p>",
    "description": "In May 2021, Dario Amodei and a crew of other former OpenAI researchers formed Anthropic and dedicated themselves to building the single-most-annoying Large Language Model company of all time.&#xA0;Pardon me, sorry, I mean safest, because that&#x2019;s the reason that Amodei and his crew claimed was why",
    "is_fulltext": true,
    "source": "Ed Zitron's Where's Your Ed At",
    "pub_date": "Fri, 20 Feb 2026 18:26:41 GMT",
    "fetched_at": "2026-02-21T00:36:44.246925",
    "url_hash": "a914b38bddd0340952a9f11360b3f2f2"
  },
  {
    "title": "Gabriel Knight 3: Blood of the Sacred, Blood of the Damned",
    "link": "https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/",
    "content": "<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/4124769-gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned-windows/\" rel=\"attachment wp-att-6659\"><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter size-medium wp-image-6659\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/4124769-gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned-windows-500x600.jpg\" alt=\"\" width=\"500\" height=\"600\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/4124769-gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned-windows-500x600.jpg 500w, https://www.filfre.net/wp-content/uploads/2026/02/4124769-gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned-windows.jpg 666w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></p>\n<hr />\n<div style=\"margin-bottom: 8px; text-align: center;\"><strong>This article tells part of the story of <a href=\"/tag/jensen/?order=asc\">Jane Jensen</a>.</strong></div>\n<div style=\"margin-bottom: 32px;\">\n<hr />\n</div>\n<blockquote><p>I think I became convinced when I went to CES [in January of 1997] and I walked around the show looking at all these titles that were the big new things, and not one screen had full-motion video. I realized that if I wanted anyone to look at the game, it had to be in 3D.</p>\n<p style=\"text-align: right;\">&#8212; Jane Jensen</p>\n</blockquote>\n<p><em>Gabriel Knight 3: Blood of the Sacred, Blood of the Damned</em> is proof that miracles do occur in gaming. It was remarkable enough that the game ever got made at all, in the face of gale-force headwinds blowing against the adventure genre. But the truly miraculous thing is that it turned out as well as it did. In <a href=\"/2026/02/ultima-ix\">my last article</a>, I told you about <em>Ultima IX</em>, the sad-sack conclusion to another iconic series. The story of <em>Gabriel Knight 3&#8242;</em>s development is eerily similar in the broad strokes: the same real or perceived need to chase marketplace trends, the same unsupportive management, the same morale problems that resulted in an absurdly high turnover rate on the team. But <em>Gabriel Knight 3</em> had one thing going for it that <em>Ultima IX</em> did not. Whereas Richard Garriott, the father of <em>Ultima</em>, always seemed to be somewhere else when someone might be on the verge of asking him to get his hands dirty, Jane Jensen was on the scene from first to last with her project. Just as much as the first two games, <em>Gabriel Knight 3</em> managed at the last to reflect her unique vision more than some corporate committee&#8217;s view of what an adventure game should be in 1999. And that made all the difference.</p>\n<p>In fact, I&#8217;m going to go out on a limb right here and now and deliver this article&#8217;s bombshell up-front: in defiance of the critical consensus, <em>Gabriel Knight 3</em> is actually my favorite of the trilogy. As always, I don&#8217;t necessarily expect you to agree with me, but I will do my best to explain just what it is that delights, intrigues, and even moves me so much about this game.</p>\n<hr />\n<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/painting/\" rel=\"attachment wp-att-6660\"><img decoding=\"async\" class=\"aligncenter size-medium wp-image-6660\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/painting-426x600.jpg\" alt=\"\" width=\"426\" height=\"600\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/painting-426x600.jpg 426w, https://www.filfre.net/wp-content/uploads/2026/02/painting-726x1024.jpg 726w, https://www.filfre.net/wp-content/uploads/2026/02/painting-768x1083.jpg 768w, https://www.filfre.net/wp-content/uploads/2026/02/painting.jpg 800w\" sizes=\"(max-width: 426px) 100vw, 426px\" /></a></p>\n<p>Before we get to that, though, we need to turn the dial of our time machine back another few years from 1999, to late 1995, when Jane Jensen has just finished <a href=\"/2021/08/the-beast-within-a-gabriel-knight-mystery\"><em>The Beast Within</em></a>, her second <em>Gabriel Knight</em> game. That game was the product of a giddy but ultimately brief-lived era at Sierra On-Line, when the company&#8217;s founders Ken and Roberta Williams were convinced that the necessary future of mass-market gaming was a meeting of the minds of Silicon Valley and Hollywood: it would be a case of players making the decisions for real live actors they saw on the screen. Sierra was so committed to this future that it built its own professional-grade sound stage in its hometown of tiny Oakhurst, California. <em>Gabriel Knight 2</em> was the second game to emerge from this facility, following Roberta Williams&#8217;s million-selling <a href=\"/2021/08/making-sierra-pay\"><em>Phantasmagoria</em></a>. But, although <em>Gabriel Knight 2</em> acquitted itself vastly better as both a game and a work of fiction than that schlocky splatter-fest, it sold only a fraction as many copies. &#8220;I thought we&#8217;d done a hell of a job,&#8221; says Jensen. &#8220;I thought it would appeal to that mass market out there. I thought it would be top ten. And it was &#8212; for about a week. I watched the charts in the months after shipping and saw the games that outsold [it], and I thought, &#8216;Ya know, I&#8217;m in the wrong industry.'&#8221;</p>\n<p>The underwhelming sales figures affected more than just the psyche of Jane Jensen. Combined with the similarly disappointing sales figures of other, similar games, they sent the Siliwood train careening off the rails when it had barely left the station. In the aftermath, everyone was left to ponder hard questions about the fate of the <em>Gabriel Knight</em> series, about the fate of Sierra, and about the fate of adventure games in general.</p>\n<p>No offer to make a third <em>Gabriel Knight</em> game was immediately forthcoming. Jane Jensen took a year&#8217;s sabbatical from Sierra, busying herself with the writing of novelizations of the first two games for Roc Books. While she was away, the new, more action-focused genres of the first-person shooter and real-time strategy completed their conquest of the computer-gaming mainstream, and Sierra itself <a href=\"/2025/04/the-end-of-sierra-as-we-knew-it-part-1-the-acquisition\">was taken over</a> by an unlikely buyer of obscure provenance and intent known as CUC.</p>\n<p>Thus she found that everything was different when she returned to Sierra, bubbling over with excitement about a new idea she had. During her break, she had read a purportedly non-fiction book called <a href=\"https://www.goodreads.com/book/show/1036543.The_Tomb_of_God\"><em>The Tomb of God</em></a>, the latest in a long and tangled skein of literature surrounding the tiny French village of Rennes-le-Château. The stories had begun with a mysteriously wealthy nineteenth-century priest and rumors of some treasure he may have hidden in or around the village, then grown in the telling to incorporate the Holy Grail, Mary Magdalene, <a href=\"/2022/07/broken-sword-the-shadow-of-the-templars\">the Knights Templar</a>, the Freemasons, the true bloodline of Jesus Christ, and the inevitable millennia-spanning conspiracy to control the world and hide The Truth. The bizarre cottage industry would reach its commercial zenith a few year into the 21st century, with Dan Brown&#8217;s novel <em>The Da Vinci Code</em> and the movie of same that followed. It&#8217;s unclear whether Jensen herself truly believed any of it, but she did see a way to add vampires to the equation &#8212; she had long intended the third <em>Gabriel Knight</em> game to deal with vampires &#8212; and turn it into an adventure game that blended history and horror in much the same audacious way as <em>Gabriel Knight 2</em>, which had dared to posit that &#8220;Mad King&#8221; Ludwig II of Bavaria had been a werewolf, then went on to make an uncannily believable case for that nutso proposition.</p>\n<p>Sierra&#8217;s new management agreed to make the game, for reasons that aren&#8217;t crystal clear but can perhaps be inferred. It was the end of 1996, still early enough that a sufficiently determined industry observer could make the case that <a href=\"/2022/06/toonstruck-or-a-case-study-in-the-death-of-adventure-games\">the failure of the adventure genre</a> to produce any new million-selling hits of late might be more of a fluke than a long-term trend. Ken Williams was still on the scene at Sierra, albeit with greatly diminished influence in comparison to the years when he alone had called the shots. For better and <a href=\"/2019/07/chief-gates-comes-to-oakhurst-a-cop-drama\">sometimes for worse,</a> he had always loved the idea of &#8220;controversial&#8221; games. The would-be <em>Gabriel Knight 3</em> certainly seemed like it would fit that bill, what with being based around the heretical premise that Jesus Christ had not been celibate, had in fact married Mary Magdalene and conceived children with her in the biological, less-than-immaculate way. A few centuries earlier, saying that sort of thing would have gotten you drawn and quartered or burnt at the stake; now, it would just leave every priest, preacher, and congregation member in the country spluttering with rage. It was one way to get people talking about adventure games again.</p>\n<p>Even so, it wasn&#8217;t as if everything could just be business as usual for the genre. The times were changing: digitized human actors were out, real-time 3D was in, and even an unfashionable straggler of a genre like this one would have to adapt. So, <em>Gabriel Knight 3</em> would be done in immersive 3D, both for the flexibility it lent when contrasted with the still photographs and chunks of canned video around which <em>Gabriel Knight 2</em> had been built and because it ought to be, theoretically at least, considerably cheaper than trying to film a whole cast of professional actors cavorting around a sound stage. The new game would be made from Sierra&#8217;s new offices in Bellevue, Washington, to which the company had been gradually shifting development for the past few years.</p>\n<p>Jane Jensen officially returned to Sierra in December of 1996, to begin putting together a script and a design document while a team of engineers got started on the core technology. The planned ship date was Christmas of 1998. But right from the get-go, there were aspects of the project to cause one to question the feasibility of that timeline.</p>\n<p>Sierra actually had three projects going at the same time which were all attempting to update the company&#8217;s older adventure series for this new age of real-time 3D. And yet there was no attempt made to develop a single shared engine to power them, despite the example of <a href=\"/2016/08/sierra-gets-creative\">SCI</a>, one of the key building blocks of Sierra&#8217;s earlier success, which had powered all of its 2D adventures from late 1988 on. <em>Gabriel Knight 3</em> was the last of the three 3D projects to be initiated, coming well after <a href=\"/2025/04/the-end-of-sierra-as-we-knew-it-part-2-the-scandal\"><em>King&#8217;s Quest: Mask of Eternity</em></a> and <a href=\"/2025/05/the-end-of-sierra-as-we-knew-it-part-3-the-dog-days-of-oakhurst\"><em>Quest for Glory V</em></a>. Its engine, dubbed the G-Engine for obvious reasons, was primarily the creation of a software engineer named Jim Napier, who set the basics of it in place during the first half of 1997. Unfortunately, Napier was transferred to work on <a href=\"https://www.mobygames.com/game/845/swat-3-close-quarters-battle/\"><em>SWAT 3</em></a> after that, leaving the technology stack in a less than ideal state.</p>\n<p>Abrupt transfers like this one would prove a running theme. The people working on <em>Gabriel Knight 3</em> were made to feel like the dregs of the employee rolls, condemned to toil away on Sierra&#8217;s least commercially promising game. Small wonder that poor morale and high turnover would be constant issues for the project. Almost 50 people would be assigned to <em>Gabriel Knight 3</em> before all was said and done, but never more than twenty at a time. Among them would be two producers, three art directors, and three project leads. The constant chaos, combined with the determination to reinvent the 3D-adventure wheel every time it was taken for a spin, undermined any and all cost savings that might otherwise have flowed from the switch from digitized video to 3D graphics. Originally projected to cost around $1.5 million, <em>Gabriel Knight 3</em> would wind up having cost no less than $4.2 million by the time it was finished. That it was never cancelled was more a result of inertia and an equally insane churn rate in Sierra&#8217;s executive suites than any real belief in the game&#8217;s potential.</p>\n<p>For her part, Jane Jensen displayed amazing resilience and professionalism throughout. She had shot too high with <em>Gabriel Knight 2</em>, turning in a script that had to be cut down by 25 percent or more during development, leaving behind some ugly plot and gameplay holes to be imperfectly papered over. This time around, she kept in mind that game development, like politics, is the art of the possible. Despite all the problems, very little of her design would be cut this time.</p>\n<p>The people around her were a mixture of new faces who were there because they had been ordered to be and a smattering of old-timers who shared her passion for this set of themes and characters. Among these latter was her husband Robert Holmes, who provided his third moody yet hummable soundtrack for the series, and Stu Rosen, who had directed the voice-acting cast in <a href=\"/2019/08/gabriel-knight-sins-of-the-fathers\"><em>Gabriel Knight 1</em></a>. Rosen convinced Tim Curry, who had voiced the title role in that game but sat out the live-action <em>Gabriel Knight 2</em>, to return for this one. His exaggerated New Orleans drawl is not to all tastes, but it did provide a welcome note of continuity through all of the technological changes the series had undergone. Recording sessions began already in November of 1997, just after Jane Jensen returned from her first in-person visit to Rennes-le-Château.</p>\n<p>But as we saw with <em>Ultima IX</em>, such sessions are superficial signs of progress only, and as such are often the refuge of those in denial about more fundamental problems. When one Scott Bilas arrived in early 1998 to become <em>Gabriel Knight 3&#8242;</em>s latest Technical Lead, he concluded that &#8220;the engineering team must have been living in a magical dream world. I can&#8217;t find any other way to explain it. At that point, the game was a hacked-up version of a sample application that Jim Napier wrote some time earlier to demonstrate the G-Engine.&#8221; Bilas spent months reworking the G-Engine and adding an SCI-like scripting language called Sheep to separate the game design from low-level engine programming. His postmortem of the project, written for <em>Game Developer</em> magazine about six months after <em>Gabriel Knight 3&#8242;</em>s release, makes for brutal reading. For most of the people consigned to it, the project was more of a death march than a labor of love, being a veritable encyclopedia of project-management worst practices.</p>\n<blockquote>\n<p style=\"text-align: left;\">There was a serious lack of love and appreciation [from Sierra&#8217;s management] throughout the project. Recognition of work (other than relief upon its completion) was very rare, lacked sincerity, and was always too little, too late. Internally, a lot of the team believed that the game was of poor quality. And of course, the many websites and magazines that proclaimed &#8220;adventure games are dead&#8221; only made things worse. Tim Schafer&#8217;s Grim Fandango, although a fabulous game and critically acclaimed, was supposedly (we heard) performing poorly in the marketplace&#8230;</p>\n<p>The low morale resulted in a lot of send-off lunches for developers seeking greener pastures. Gabriel Knight 3 had a ridiculous amount of turnover that never would have been necessary had these people been properly cast or well-treated&#8230;</p>\n<p>After a certain amount of time on a project like this, morale can sink so low that the team develops an incredible amount of passive resistance to any kind of change. Developers can get so tired of the project and build up such hatred for it that they avoid doing anything that could possibly make it ship later. This was a terrible problem during the last half of the Gabriel Knight 3 development cycle&#8230;</p>\n<p>Our engineers never had an accurate development schedule; the schedules we had were so obviously wrong that everybody on the team knew there was no way to meet them. Our leads often lied to management about progress, tasks, and estimates, and I believe this was because they were in over their heads and weren&#8217;t responding well to the stress. Consequently, upper management thought the project was going to be stable and ready to ship long before it actually was, and we faced prolonged crunch times to deliver promised functionality&#8230;</p>\n<p>Most of the last year of the project we spent in [crunch] mode, which meant that even small breaks for vacations, attending conferences, and often even taking off nights and weekends were looked down upon. It was time that the team &#8220;could not afford to lose.&#8221; The irony is that this overtime didn&#8217;t help anyway; the project didn&#8217;t move any faster or go out any sooner. The lack of respect for our personal lives and attention to our well-being caused our morale to sink&#8230;</p>\n<p>Gabriel Knight 3 became a black hole that sucked in many developers from other projects, often at the expense of those projects. Artists were shifted off the team to cut the burn rate, and then pulled back on later because there was so much work left to do&#8230;</p>\n<p>Management, thinking that it would save time, often encouraged content developers to hack and work around problems rather than fix them properly&#8230;</p></blockquote>\n<p>All of this happened against a backdrop of thoroughgoing confusion and dysfunction at Sierra in general. A sidelined Ken Williams got fed up and left the company he had founded in August of 1997. At the end of that year, Sierra&#8217;s new parent CUC merged with another large conglomerate called HFS to create a new entity named Cendant. Just a few months later, CUC was revealed to have been a house of cards the whole time, the locus of one of the biggest accounting scandals in the history of American business. For a long stretch of the time that <em>Gabriel Knight 3</em> was in the works, there was reason to wonder whether there would even still be a Sierra for the team to report to in a week or a month. Finally, in November of 1998, Sierra was bought again, this time by the French media mega-corp Vivendi, whose long-term plan was, it slowly became evident, to end all internal game development and leverage the label&#8217;s brand recognition by turning it into a publisher only. Needless to say, this did nothing for the morale of the people who were still making games there.</p>\n<p>Sierra&#8217;s Oakhurst office <a href=\"/2025/05/the-end-of-sierra-as-we-knew-it-part-4-chainsaw-monday\">was shut down</a> in February of 1999. The first wave of layoffs swept through Bellevue the following summer, while the <em>Gabriel Knight 3</em> team were striving desperately to get the game out in time for the Christmas of 1999 instead of 1998. In a stunning testimony to corporate cluelessness about the psychology of human beings, some of those working on <em>Gabriel Knight 3</em> were told straight-up that they were to be fired, but not until they had given the last of their blood, sweat, and tears to finish the game. &#8220;Having a group of people who are (understandably) upset with your company for laying them off and actively looking for a job while still trying to contribute to a project is a touchy situation that should be avoided,&#8221; understates Scott Bilas. The words &#8220;no shit, Sherlock&#8221; would seem to apply here.</p>\n<p>But the one person who comes in for sustained praise in Bilas&#8217;s postmortem is Jane Jensen, whose vision and commitment never wavered.</p>\n<blockquote><p>Gabriel Knight 3 would have simply fallen over and died had we had a less experienced designer than Jane Jensen. Throughout the entire development process, the one thing that we could count on was the game design. It was well thought-out and researched, and had an entertaining and engrossing story. Best of all, Jane got it right well in advance; aside from some of the puzzles, nothing really needed to be reworked during development. She delivered the design on time and maintained it meticulously as the project went on.</p></blockquote>\n<p>This was <em>Gabriel Knight 3&#8242;</em>s secret weapon, the thing that prevented it from becoming a disaster like <em>Ultima IX</em>. With Jane Jensen onboard, there was always someone to turn to who knew exactly what the game was meant to do and be. The vision thing matters.</p>\n<hr />\n<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/murray/\" rel=\"attachment wp-att-6661\"><img decoding=\"async\" class=\"aligncenter size-medium wp-image-6661\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/Murray-600x329.jpg\" alt=\"\" width=\"600\" height=\"329\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/Murray-600x329.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/Murray.jpg 715w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>When <em>Gabriel Knight 3: Blood of the Sacred, Blood of the Damned</em> shipped in November of 1999, it marked the definitive end of an era, being the last Sierra adventure game ever, the final destination of a cultural tradition that stretched all the way back to <a href=\"/2011/10/mystery-house-part-1\"><em>Mystery House</em></a> almost twenty years before, to a time when the computer-game industry was more inchoate than concrete. During the graphic adventure&#8217;s commercial peak of the early 1990s, Sierra and LucasArts had been the yin and the yang of the field, the bones of endless partisan contentions among gamers. It&#8217;s therefore intriguing and perhaps instructive to compare the press reception of <em>Gabriel Knight 3</em> with that of 1998&#8217;s <a href=\"/2024/11/grim-fandango\"><em>Grim Fandango</em></a>, the most recent high-profile adventure release from LucasArts.</p>\n<p><em>Grim Fandango</em> was taken up as a sort of <em>cause célèbre</em> by critics, who rightly praised its unusual setting, vividly drawn characters, and moving story, even as they devoted less attention to its clumsy interface and convoluted and illogical puzzle structure. Those who wrote about games tended to be a few years older on average than those who simply played them. Many of this generation of journalists had grown up with <a href=\"/2015/07/a-new-force-in-games-part-3-scumm\"><em>Maniac Mansion</em></a> and/or <a href=\"/2017/03/monkey-island-or-how-ron-gilbert-made-an-adventure-game-that-didnt-suck\"><em>The Secret of Monkey Island</em></a>. They were bothered by the notion of a LucasArts that no longer made adventure games, and sought to make this one enough of a success to avoid that outcome. At times, their reviews took on almost a hectoring tone: you <em>must</em> buy this game, they lectured their readers. The pressure campaign failed to fully accomplish its goal; <em>Grim Fandango</em> wasn&#8217;t a complete flop, but it did no more than break even at best, providing LucasArts with no particularly compelling financial argument for making more games like it.</p>\n<p>Alas, when it arrived a year later, <em>Gabriel Knight 3</em> was not given the same benefit of the doubt as to its strengths and weaknesses. Some of the reviews were not just negative but savagely so, almost as if their writers were angry at the game for daring to exist at all in this day and age. <em>GameSpot</em> pronounced this third installment fit &#8220;only for the most die-hard fans of the series.&#8221; Even the generally sober-minded <em>Computer Gaming World</em>, the closest thing the industry had to a mature journal of record, came at this game with knives out. In a two-stars-out-of-five review, Tom Chick said that &#8220;you&#8217;ll spend a lot of time fumbling in limbo, wandering aimlessly, trying to trigger whatever unknowable act will end the time block.&#8221; Okay &#8212; but it&#8217;s very hard to reconcile this criticism with the same magazine&#8217;s four-and-a-half star, &#8220;Editor&#8217;s Choice&#8221;-winning review of <em>Grim Fandango</em>. In my experience at least, aimless wandering and unknowable acts are far more of a fact of life in that game than in <em>Gabriel Knight 3</em>, which does a far better job of telling you what your goals are from story beat to story beat.</p>\n<p>What might be going on here? To begin with, we do have to factor in that LucasArts had historically enjoyed better reviews and the benefit of more doubts than Sierra, whose adventure games came more frequently but really did tend to be rougher around the edges in the aggregate. Yet I don&#8217;t think that explains the contrast in its entirety. The taste-makers of mainstream gaming were still in a bargaining phase when it came to adventure games in 1998, still trying to find a place for them amidst all the changes that had come down the pipe since id Software unleashed <a href=\"/2020/06/the-shareware-scene-part-4-doom\"><em>DOOM</em></a> upon the world. That bargaining had been given up as a lost cause a year later. The adventure game, said the new conventional wisdom, was dead as a doorknob, and it wasn&#8217;t coming back. A pack mentality kicked in and everyone rushed to pile on. It&#8217;s a disconcerting, maybe even disturbing thing to witness, but such is this thing we call human nature sometimes. If the last few years of our more recent social history tell us anything, it is that cultural change can burst upon the scene with head-snapping speed and force to make yesterday&#8217;s conventional wisdom suddenly beyond the pale today.</p>\n<p>Adventure games would soon disappear entirely from the catalogs of the major publishers and from the tables of contents of the magazines and websites that followed them. In a rare sympathetic take on the genre&#8217;s travails, the website <em>Gamecenter</em> wrote just after the release and less than awe-inspiring commercial performance of <em>Gabriel Knight 3</em> that &#8220;now it seems people want more action than adventure. They would rather run around in short shorts <a href=\"/2023/06/tomb-raider\">raiding tombs</a> than experience real stories.&#8221; This was the true nub of the issue, for all that the belittling tone was no more necessary here than when it was directed in the opposite direction. People just wanted different things; a player of <em>Gabriel Knight 3</em> was not inherently more or less smart, wise, or culturally sophisticated than a player of <a href=\"/2024/07/starcraft-a-history-in-two-acts\"><em>Starcraft</em></a> or <em>Unreal Tournament</em>.</p>\n<p>So, then, at the risk of stating the obvious, the core problem for the adventure genre was a mismatch between the desires of the majority of gamers at the turn of the millennium and the things the adventure game could offer them. The ultimate solution was for the remaining adventure fans to get their own cottage industry to make for them the games that they enjoyed, plus their own media ecosystem to cover them, replete with sympathetic critics who wanted the same things from gaming that their readers did. That computer gaming as a whole could sustain being siloed off into parallel ecosystems was a testament to how much bigger the tent had gotten over the course of the 1990s. But as of 1999, the siloing hadn&#8217;t quite happened yet, leaving a game like <em>Gabriel Knight 3</em> trapped on the stage of an unfriendly theater, staring down an audience who were no longer interested in the type of entertainment it was peddling. While the game was still in development, Jane Jensen had mused about the controversial elements that may have helped to get it funded: &#8220;I guess the worst case would be that no one would care, or even notice.&#8221;</p>\n<p>The worst case came true. <em>Gabriel Knight 3</em> became its woebegone genre&#8217;s sacrificial lamb, controversial only for daring to exist at all as an ambitious adventure game in 1999. It deserved better, for reasons which I shall now go into.</p>\n<hr />\n<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/comic/\" rel=\"attachment wp-att-6662\"><img decoding=\"async\" class=\"aligncenter size-medium wp-image-6662\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/comic-366x600.jpg\" alt=\"\" width=\"366\" height=\"600\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/comic-366x600.jpg 366w, https://www.filfre.net/wp-content/uploads/2026/02/comic-625x1024.jpg 625w, https://www.filfre.net/wp-content/uploads/2026/02/comic.jpg 643w\" sizes=\"(max-width: 366px) 100vw, 366px\" /></a></p>\n<p>This final Sierra adventure game opens with something else that was not long for this world in 1999: a story setup that&#8217;s conveyed in the manual &#8212; or rather in an accompanying comic book &#8212; instead of in a cutscene. Four years on from their hunt for werewolves in <em>Gabriel Knight 2</em>, Gabriel and his assistant Grace Nakimura are asked to come to the Paris mansion of one Prince James, a scion of the Stuart line that once ruled Scotland and England. After they arrive, the good prince explains that he needs their help to protect his infant son from &#8220;Night Visitors&#8221; &#8212; i.e., vampires. Gabriel and Grace agree to take on the task, only to fail at it rather emphatically; the baby is kidnapped out from under their noses that very night. But Gabriel does manage to give chase, tracking the men or monsters who have absconded with the infant to the vicinity of Rennes-le-Château. Not sure how to proceed from here, he checks into a hotel in the village. The game proper begins the next morning.</p>\n<p>At breakfast, he learns that a tour group of treasure hunters has also just arrived at the hotel, all of them dreaming of the riches that are purported to be hidden somewhere in or near the village. In addition to the fetching French tour guide Madeline (to whom Gabriel reacts in his standard lecherous fashion), there are Emilio, a stoic Middle Easterner; Lady Lily Howard and Estelle Stiles, a British blue-blood and her companion; John Wilkes, an arrogant, muscle-bound Aussie; and Vittorio Buccheilli, an irritable Italian scholar. To this cast of characters worthy of an Agatha Christie novel we must add Gabriel&#8217;s old New Orleans running buddy Detective Frank Mosely, who, in a coincidence that would cause Charles Dickens to roll over in his grave, just happens to have joined this very tour group to try his hand at treasure hunting. Each member of the group has his or her own theory about the real nature of the treasure and how to find it, leaving Gabriel to try to sort out which ones really are the hopeless amateurs they seem to be and which ones have relevant secrets to hide, possibly involving the kidnapping which brought him here.</p>\n<div id=\"attachment_6663\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_1/\" rel=\"attachment wp-att-6663\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6663\" class=\"size-medium wp-image-6663\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_1-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_1-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_1.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6663\" class=\"wp-caption-text\">Gabriel has an unexpected meeting with Mosely.</p></div>\n<p>Anyone who has played the first two <em>Gabriel Knight</em> games will be familiar with this one&#8217;s broad approach to its story. It takes place over three days, each of which is divided up into a number of time blocks. Rather than running on clock time, the game runs on plot time: the clock advances only when you&#8217;ve fulfilled a set of requirements for ending a time block. Grace arrives at the hotel on the evening of the first day. Thereafter, you control her and Gabriel alternately, just as in <em>Gabriel Knight 2</em>, with Gabriel&#8217;s sections leaning harder on conversations and practical investigation, while Grace delves deep into the lore and conspiracy theories of Rennes-le-Château. Don&#8217;t let the fact that the whole game is compressed into just three days fool you: they&#8217;re three <em>busy</em> days (and nights), busier than any three days could reasonably be in real life.</p>\n<p>In this article, I won&#8217;t say anything more about the mystery of Rennes-le-Château. For the time being, you&#8217;ll just have to trust me when I tell you that it&#8217;s an endlessly fascinating rabbit hole. In fact, it fascinates on two separate levels: that of the tinfoil-hat theories themselves, and the meta-level of how they came to find such purchase here in this real world of ours, which is &#8212; spoiler alert! &#8212; actually not controlled by secret cabals of Knights Templar and the like. I&#8217;ll be exploring these subjects in some articles that will follow this one. It&#8217;s a digression from my normal beat, but one that I just can&#8217;t resist; I hope you&#8217;ll wind up agreeing with me that it was well worth it.</p>\n<p>Today, though, let me tell you about some of the other aspects of this game. One of Jane Jensen&#8217;s greatest talents as a writer is her skill at evoking a sense of place, whether her setting be Louisiana, Bavaria, or now southern France. If you ask me, this game is her magnum opus in this sense. The 3D graphics here are pretty crude &#8212; far from state of the art even by the standards of 1999, never mind today. Characters move more like zombies or robots than real people and look like collections of interchangeable parts crudely sewn together. Gabriel&#8217;s hair looks like an awkwardly shaped helmet that&#8217;s perpetually in danger of falling right off his head, while trees and plants are jagged-edged amalgamations of pixels that look like they could slice him right open if he bumped into them. And yet darned if playing this game doesn&#8217;t truly feel like exploring a sun-kissed village on the edge of the French Riviera. The screenshots may not come off very well in an article like this one, but there&#8217;s an Impressionistic quality (how French, right?) to the game&#8217;s aesthetics that may actually serve it better than more photo-realistic graphics would. When I think back on it now, I do so almost as I might a memorable vacation, the kind whose contours are blended and softened by the soothing hand of sentiment. If a good game is a space where you want to go just to hang out, then <em>Gabriel Knight 3</em> is a very good game indeed.</p>\n<p>The geography is fairly constrained, meaning you&#8217;ll be visiting the same places again and again as the plot unfolds. Far from a drawback, I found this too oddly soothing. I mentioned Agatha Christie earlier; let me double-down on that reference now, and say that the geography is tight enough to remind me of a locked-room cozy mystery. The fact that you&#8217;re staying in a hotel with a gaggle of tourists only enhances the feeling of being on a virtual holiday. Playing this game, you never sense the stress and conflict and exhaustion that were so frequently the lot of its developers. Call it one more way in which <em>Gabriel Knight 3</em> is kind of miraculous; most games reflect the circumstances of their creation much more indelibly.</p>\n<div id=\"attachment_6665\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_3/\" rel=\"attachment wp-att-6665\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6665\" class=\"size-medium wp-image-6665\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_3-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_3-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_3.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6665\" class=\"wp-caption-text\">I suppose it could be considered a problem with <em>Gabriel Knight 3</em> as a piece of fiction that the setting comes off so bucolic when the stakes are meant to be so high. But I don&#8217;t care. I like it here; I really like it.</p></div>\n<p>Meet the story where it lives and let it unfold at its own pace, and you&#8217;ll be amply rewarded. Both the backstory of the historical conspiracy and the foreground plot with which it becomes intertwined, about finding the vampiric kidnappers, become riveting. I often play games on the television in the living room while my wife Dorte reads or crochets or does something else, popping up from time to time with a comment, usually one making fun of whatever nerdy thing I happen to be up to tonight. But <em>Gabriel Knight 3</em> grabbed her too, something that doesn&#8217;t happen all that often. She had to go off to a week-long course just as I was getting close to the end. She informed me in no uncertain terms that I was <em>not</em> allowed to finish without her, because she wanted to see how it ended as well. Trust me when I tell you that that is really saying something.</p>\n<p>The 3D engine that powers all of this is one of a goodly number of alternative approaches to the traditional point-and-click adventure that appeared as the genre was flailing against the dying of the mainstream light, aimed at helping it to feel more in tune with the times and, in some cases, making it <a href=\"/2024/01/televising-the-revolution\">a more friendly fit</a> with alternative platforms like the Sony PlayStation. Few of these reinventions make much of a case for their own existence in my opinion, but the G-Engine is an exception. It&#8217;s a surprisingly effective piece of kit. Instead of relying on fixed camera angles, as <em>Grim Fandango</em> does in its 3D engine, <em>Gabriel Knight 3</em> gives you a free-floating camera that you can move about at will. The environment fills the whole screen; there are no fixed interface elements. Clicking on a hot spot brings up a context-sensitive menu of interaction possibilities. And naturally, you can delve into an inventory screen to look at and combine the items you&#8217;re carrying, or to snatch them up for use out in the world. I really, really like the system, which genuinely does add something extra that you wouldn&#8217;t get from 2D pixel graphics. You can look up and down, left and right, under and on top of things. A room suddenly feels like a real space, full of nooks and crannies to be explored.</p>\n<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_4/\" rel=\"attachment wp-att-6666\"><img decoding=\"async\" class=\"aligncenter size-medium wp-image-6666\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_4-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_4-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_4.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>Admittedly, the setup is kind of weird on a conceptual level, in that you&#8217;re doing all of this exploration while Gabriel or Grace, whichever one you happen to be controlling, is standing stock still. This game, in other words, lends fresh credence to <a href=\"/tag/scott-adams/?order=asc\">Scott Adams&#8217;s</a> age-old conception of the player of an adventure game being in command of a &#8220;puppet&#8221; that does her bidding. Here you&#8217;re a disembodied spirit who does all the real work, pressing Gabriel or Grace into service only when you have need of hands, feet, or a mouth. You can even &#8220;inspect&#8221; an object in the room without their assistance &#8212; doing so shows it to you in close-up &#8212; although you do need them to help you &#8220;look,&#8221; which elicits a verbal description from your puppet. <em>Gabriel Knight 3</em> doesn&#8217;t take place in a contiguous world; discrete &#8220;rooms&#8221; are loaded in when you direct your puppet to cross a boundary from one to another. Nevertheless, some of the rooms can be quite large. When you&#8217;re out and about on the streets of Rennes-le-Château, for example, the camera might be a block away from Gabriel or Grace, well out of his or her line of sight. It&#8217;s odd to think about, but it works a treat in practice.</p>\n<div id=\"attachment_6667\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_5/\" rel=\"attachment wp-att-6667\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6667\" class=\"size-medium wp-image-6667\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_5-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_5-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_5.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6667\" class=\"wp-caption-text\">One of the strangest things about the G-Engine is how the camera seems to have a corporeal form. You can get it hung up behind objects like this bench.</p></div>\n<p>The G-Engine doesn&#8217;t add much in the way of emergent possibility. Reading between the lines of some of the reviews, one can&#8217;t help but sense that some critics thought the switch to 3D ought to make <em>Gabriel Knight 3</em> play more like <em>Tomb Raider</em> &#8212; and who knows, perhaps this was even envisioned by the developers as well at one time. The game we have, however, is very much an adventure game of the old school, a collection of set-piece puzzles with set-piece solutions, with a set-piece plot that is predestined to play out in one and only one way. Some alternative solutions are provided, even some optional pathways and puzzles that you can engage with for extra points, but there&#8217;s no physics engine to speak of here, and definitely no possibility to do anything that Jane Jensen never anticipated for you to do.</p>\n<p>That said, there are a few places where the game demands timing and reflexes, especially at the climax. These bits aren&#8217;t horrible, but they aren&#8217;t likely to leave you wishing there were more of them either. In the end, they too are set-piece exercises, more <a href=\"/2013/05/the-dawn-of-multimedia\"><em>Dragon&#8217;s Lair</em></a> than <em>Tomb Raider</em>.</p>\n<hr />\n<div id=\"attachment_6668\" style=\"width: 439px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/murray-2/\" rel=\"attachment wp-att-6668\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6668\" class=\"size-full wp-image-6668\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/murray-1.jpg\" alt=\"\" width=\"429\" height=\"462\" /></a><p id=\"caption-attachment-6668\" class=\"wp-caption-text\">Erik and Chet, the pair of teenage <a href=\"/2023/04/the-next-generation-in-graphics-part-1-three-dimensions-in-software-or-quake-and-its-discontents\"><em>Quake</em></a> fanatics who wrote <em>Gabriel Knight 3</em> into gaming history for all the wrong reasons via their website <em>Old Man Murray</em>. Ah, well&#8230; they were no kinder to themselves than they were to this game. Erik described himself as a &#8220;fat, girl-looking boy&#8221;; Chet &#8220;likes Ministry and not much else.&#8221;</p></div>\n<p>We can&#8217;t avoid it anymore, my friends. It&#8217;s impossible to discuss <em>Gabriel Knight 3&#8242;</em>s puzzles in any depth without addressing the elephant &#8212; or rather the cat-hair mustache &#8212; that&#8217;s been in the room with us this whole time. The uninitiated among you, assuming there are any, will require a bit of explanation.</p>\n<p>During the burgeoning years of the World Wide Web, many gaming sites popped up to live on the hazy border between fanzines and professional media organs. One of these went for some reason by the name of <a href=\"https://www.oldmanmurray.com\"><em>Old Man Murray</em></a>, a place for irreverent teenage takes on the games that <em>Computer Gaming World</em> was covering with more earnestness and less profanity. One of the proprietors, who went by the name of simply &#8220;Erik,&#8221; took exception to one particular puzzle that crops up fairly early on in <em>Gabriel Knight 3</em>. He vented his frustration in a&#8230; a column, I guess we can call it?&#8230;  published on September 11, 2000 &#8212; i.e., ten months after the game&#8217;s release, and well after its lackluster commercial fate had already been decided.</p>\n<p><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_6/\" rel=\"attachment wp-att-6669\"><img decoding=\"async\" class=\"aligncenter size-medium wp-image-6669\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_6-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_6-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_6.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>Gabriel needs to get his hands on some form of transportation in order to explore the countryside around Rennes-le-Château. Unfortunately, the motorbike rental lot right next door to the hotel mostly offers only sissy-looking mopeds of a sort that he wouldn&#8217;t be caught dead riding. The sole exception is a gleaming Harley-Davidson &#8212; but it has been reserved, by, of all people, his old buddy Mosely. Gabriel must engage in an extended round of subterfuge to pretend to be Mosely and secure the bike. This will turn out to involve, among other things, stealing the poor fellow&#8217;s passport and concocting a disguise for himself that involves masking tape, maple syrup, and a stray tuft of cat hair. I&#8217;ll let Erik tell you more about it. (The bold text below is present in the original.)</p>\n<blockquote><p>Dumb as your television enjoying ass probably is, you&#8217;re smarter than the genius adventure gamers who, in a truly inappropriate display of autism-level concentration, willingly played the birdbrained events. Permit me to summarize:</p></blockquote>\n<ul style=\"padding-left: 3em; margin-top: -10px;\">\n<li><em>Gabriel Knight must disguise himself as a man called Mosley [sic] in order to fool a French moped rental clerk into renting him the shop&#8217;s only motorcycle.</em></li>\n<li><em>In order to construct the costume, Gabriel Knight must manufacture a fake moustache. Utilizing the style of logic adventure game creators share with morons, Knight must do this even though <strong>Mosely does not have a moustache</strong>.</em></li>\n<li><em>So in order to even begin formulating your strategy, you have to follow daredevil of logic Jane Jensen as she pilots Gabriel Knight 3 right over common sense, like Evel Knievel jumping Snake River Canyon. Maybe Jane Jensen was too busy reading difficult books by Pär Lagerkvist to catch what stupid Quake players learned from watching the A-Team: The first step in making a costume to fool people into thinking you&#8217;re a man without a moustache, is <strong>not to construct a fake moustache</strong>.</em></li>\n<li><em>Still, you might think that you could yank some hair from one of the many places it grows out of your own body and attach it to your lip with the masking tape in your inventory. But obviously, Ms. Jensen felt that an insane puzzle deserved a genuinely deranged solution. In order to manufacture the moustache, you must attach the masking tape to a hole at the base of a toolshed then chase a cat through the hole. In the real world, such as the one that stupid people like me and Adrian Carmack use to store our televisions, this would result in a piece of masking tape with a few cat hairs stuck to it, or a cat running around with tape on its back. Apparently, in Jane Jensen&#8217;s exciting, imaginative world of books, masking tape is some kind of powerful neodymium supermagnet for cat hair.</em></li>\n<li><em>Remember how shocked you were at the end of the Sixth Sense when it turned out Bruce Willis was a robot? Well, check this out: At the end of this puzzle, you have to affix the improbable cat hair moustache to your lip <strong>with maple syrup!</strong> Someone ought to give Jane Jensen a motion picture deal and also someone should CAT scan her brain.</em></li>\n</ul>\n<p>A penetrating work of satire for the ages this column is not, but it nevertheless went viral, until it seemed to be absolutely everywhere on the Internet. In an ironic, backhanded way, <em>Gabriel Knight 3&#8242;</em>s cat-hair mustache puzzle became one of the most famous puzzles in all of adventure-gaming history, right up there with the Babel Fish in <a href=\"/2013/11/hitchhiking-the-galaxy-infocom-style\"><em>The Hitchhiker&#8217;s Guide to the Galaxy</em></a> or <em>Monkey Island&#8217;</em>s Insult Sword-Fighting. It became so famous that it has <a href=\"https://en.wikipedia.org/wiki/Cat_hair_mustache_puzzle\">its own Wikipedia page</a> today. At the same time, it became Exhibit Number One in the burgeoning debate over Why Adventure Games Died. Right up to this day, whenever talk turns to the genre&#8217;s fall from grace at the end of the twentieth century, a reference to the cat-hair mustache cannot be long in coming. For a considerable number of people today, <em>Gabriel Knight 3</em> is not a game about vampires or the source material of <em>The Da Vinci Code</em> before Dan Brown discovered it; it&#8217;s a game about a cat-hair mustache.</p>\n<p>So, what is a <em>Gabriel Knight 3</em> apologist like myself supposed to do with this? First, let me acknowledge that this is not a great puzzle in strictly mimetic terms, in that it&#8217;s impossible to take seriously as a part of the game&#8217;s fiction. Setting aside all of the other improbable steps Gabriel has to go through, he <em>steals and defaces</em> &#8212; more on the latter in a moment &#8212; his good friend&#8217;s passport in order to work the scam. All of this instead of just, you know, asking his buddy to help him out. (Mosely is gruff on the outside, but he&#8217;s a good egg underneath, as Gabriel knows better than anyone.) Or he could just suck it up and ride a moped for a few days, given that the fate of an innocent baby and who knows what else may depend on it.</p>\n<p>Of course, <em>Gabriel Knight 3</em> is hardly the only adventure game that makes sociopathic behavior a staple of its puzzle tree. This is the root of the genre&#8217;s centrifugal pull toward comedy, which almost invariably injects a patina of goofiness even into allegedly serious games like this one. Stuff like this is more naturally at home in a game like <em>Monkey Island</em>. But leave it entirely out of any sort of adventure, and you run the risk of having a game without enough gameplay. If we aren&#8217;t afraid of a little bit of whataboutism, we might defend the adventure game by noting here that it&#8217;s hardly the only genre whose gameplay is frequently at odds with its fiction: think of putting saving the world on hold in order to hunt down lost pets and carry out a hundred other piddling side-quests in a CRPG, or researching the same technologies over and over from scratch in an RTS campaign. I&#8217;ll leave you to decide for yourself how compelling such a defense is.</p>\n<p>For what it&#8217;s worth, there are reports that this puzzle was not in Jane Jensen&#8217;s original design, that it was swapped in late in the day in place of another one that had proved impractical to implement. Rest assured that you won&#8217;t catch me calling it <a href=\"/2018/11/ten-great-adventure-game-puzzles\">a great puzzle</a>, either in the context of this game or of adventure history.</p>\n<p>But here&#8217;s the thing: mimesis aside, it&#8217;s nowhere near as terrible a puzzle as the one that our friend Erik describes either. I played this game a few months ago for the first time, knowing vaguely that it included an infamous puzzle involving a cat-hair mustache &#8212; how could I not? &#8212; but knowing nothing of the specifics. I went in fully expecting the worst, keeping in mind the design issues I remembered from the first two <em>Gabriel Knight</em> games. I was therefore surprised by how smoothly &#8212; and, yes, even enjoyably &#8212; the whole puzzle played out for me. Perhaps I was helped by the knowledge I brought with me into the game, but I never had the feeling that I was relying on it, never felt that I couldn&#8217;t have progressed without it. There are two hugely important mitigating factors which Erik neglects to mention.</p>\n<p>The first is that there actually is a logic to Gabriel making a mustache for himself to imitate the clean-shaven (more or less) Mosely. He thinks that the facial hair will disguise the very different facial bone structures of the two men. Therefore he <em>draws a mustache onto Mosely&#8217;s passport photo with a marker</em> &#8212; how would you like to have a friend like him? &#8212; to complete the deception.</p>\n<div id=\"attachment_6670\" style=\"width: 484px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_7/\" rel=\"attachment wp-att-6670\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6670\" class=\"size-full wp-image-6670\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_7.jpg\" alt=\"\" width=\"474\" height=\"355\" /></a><p id=\"caption-attachment-6670\" class=\"wp-caption-text\">Notice that Mosely does have a mustache in his passport photo now.</p></div>\n<p>The second factor is more thoroughgoing: the player is guided through all of the steps quite explicitly by Gabriel himself. (Who&#8217;s the puppet now, right?) In addition to &#8220;Look&#8221; and &#8220;Inspect,&#8221; many hot spots pop up a handy light-bulb icon when you click them: &#8220;Think.&#8221; These provide vital guidance on, well, what your character is thinking &#8212; or rather what Jane Jensen is thinking, what avenues she expects you to explore to advance the story. It&#8217;s not a walkthrough &#8212; what fun would that be? &#8212; but it does give you the outlines of what you&#8217;re trying to accomplish. In this case, looking carefully at and &#8220;thinking&#8221; about all of the objects involved turn a puzzle that truly would be absurdly unfair without this extra information into one that&#8217;s silly on the face of it, yes, but pretty good fun all the same. I&#8217;ve <a href=\"/2015/07/the-14-deadly-sins-of-graphic-adventure-design\">ranted plenty</a> over bad adventure-game puzzles in the past, the kind where you have no clue what the game wants you to do or how it wants you to do it. This is not one of those. This puzzle doesn&#8217;t deserve the eternal infamy in which <em>Old Man Murray</em> draped it.</p>\n<p>In point of fact, <em>Gabriel Knight 3</em> is a major leap forward over the first two games in terms of pure design. Although it&#8217;s not trivial to solve by any means, nor does it seem to hate its player in the way of so many older Sierra games. The &#8220;Think&#8221; verb is one example. And for another one: once you solve the cat-hair-mustache-puzzle, get on your ill-gotten Harley, and start visiting the places around Rennes-le-Château, you can start to ask the game to show you where you still need to accomplish things in your current time block; this alone does much to alleviate the sense of &#8220;fumbling around in limbo,&#8221; as Tom Chick described it in <em>Computer Gaming World</em>. I don&#8217;t know whether the more soluble design of this game is a result of Jane Jensen improving her craft, unsung heroes on the team she worked with, or possibly even directives that came down from the dreaded upper management. I just know that it&#8217;s really, really nice to see &#8212; nice to be surprised by a game that turns out to be better than its reputation.</p>\n<div id=\"attachment_6671\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_8/\" rel=\"attachment wp-att-6671\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6671\" class=\"size-medium wp-image-6671\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_8-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_8-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_8.jpg 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6671\" class=\"wp-caption-text\">Solving the <em>Le Serpent Rouge</em> puzzle. Jane Jensen cribbed all this business about &#8220;sacred geometries&#8221; from the book <em>The Tomb of God</em>, which in turn borrowed it from Renaissance and Early Modern hermetic philosophy. (Johannes Kepler was very big on this sort of thing when he wasn&#8217;t developing <a href=\"https://analog-antiquarian.net/2025/11/28/chapter-8-an-elliptical-universe/\">the first credible model of our heliocentric solar system</a>.) It may be nonsense, but it&#8217;s wonderfully evocative nonsense when it&#8217;s embedded in a story like this one.</p></div>\n<p>The other puzzles here are a commodious grab bag of types. A few of them are every bit as silly as the cat-hair mustache, but most of them more pertinent to the mysteries you&#8217;re actually trying to solve. The most elaborate of them all is a whole chain of puzzles that become Grace&#8217;s principal focus over the second and third days, and that are almost as well-remembered within hardcore adventure circles today as the cat-hair mustache is outside of them. The <em>Le Serpent Rouge</em> puzzle sequence takes its name from a 1967 poem by an anonymous author that has become an indelible part of the conspiracy lore surrounding Rennes-le-Château.  The reliably bookish Grace has to ferret out its coded meanings, verse by verse, using a variety of software tools on her laptop computer. Some reviewers have called it the best adventure-game puzzle of all time.</p>\n<p>For my part, I can&#8217;t go quite that far. Like everything else in the G-Engine, the software Grace uses is more of a veneer over the set-piece design than a true simulation. At several stages, I more or less just clicked on things until the game told me I had it right. But if it has its limitations as a set of pure puzzles, <em>Le Serpent Rouge</em> succeeds brilliantly as interactive drama. You&#8217;re fully invested by the time it comes along, and the buzz you get as you close in on the heart of the mystery, step by step, is not to be dismissed lightly. In a more just world it would be these puzzles rather than the cat-hair-mustache one that would have taken a place in mainstream-gaming lore. For they show just how exciting and gripping smart, textured, context-appropriate adventure-game puzzles can be.</p>\n<p>Much the same sentiment can be applied to <em>Gabriel Knight 3</em> as a whole, a rare Sierra adventure game that I find to be underrated rather than overrated. I&#8217;ve not always been so kind toward Sierra&#8217;s games, as many of you know all too well. But almost twenty years on, just before they turned the lights out for good, they finally got everything right. This game is my favorite of the entire Sierra catalog. It&#8217;s the antithesis of <em>Ultima IX</em>, as high of a note to go out on as that game was a low one. Let&#8217;s hear it for lost causes and eleventh-hour miracles.</p>\n<hr />\n<div id=\"attachment_6672\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_9/\" rel=\"attachment wp-att-6672\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6672\" class=\"wp-image-6672 size-medium\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_9-600x450.jpg\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_9-600x450.jpg 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_9-768x576.jpg 768w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_9.jpg 800w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6672\" class=\"wp-caption-text\">Girls can ride Harleys too, y&#8217;all.</p></div>\n<p>I have to admit that my experience with <em>Gabriel Knight 3</em> has to some extent caused me to reevaluate the whole series of which it is a part. Bloody-minded iconoclast that I am, I find that I have to rank the games in reverse chronological order, the opposite of the typical fan&#8217;s ordering. I still can&#8217;t get fully behind <em>Gabriel Knight I</em>, even when I try to separate the story and setting from my nightmares about searching for a two-pixel-wide snake scale in a Bayou swamp and tapping out nonsensical codes on a bongo drum. <em>Gabriel Knight 2</em>, though&#8230; that really is an edge case for me. I still have my share of quibbles with its design, but its flaws are certainly less egregious than those of its predecessor, even as it has stuck in my memory in a way that very few of the narrative-oriented games which I&#8217;ve played for these histories have been able to do. Both the second and the third games make me feel emotions that aren&#8217;t primary-colored, that are more textured and complex than love and hate, fight and flight. And that is nothing to be sneezed at in the videogame medium.</p>\n<p>So, readers, I think I have to put both <em>Gabriel Knight 2</em> and <em>3</em> into <a href=\"/hall-of-fame\">my personal Hall of Fame</a>. It was a long time coming for the former, but I did come around to old Gabe and Gracie eventually. It&#8217;s only too bad that their story had to end here, just when it was starting to get juicy.</p>\n<div id=\"attachment_6673\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://www.filfre.net/2026/02/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned/gk3_10/\" rel=\"attachment wp-att-6673\"><img decoding=\"async\" aria-describedby=\"caption-attachment-6673\" class=\"size-medium wp-image-6673\" src=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_10-600x450.png\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https://www.filfre.net/wp-content/uploads/2026/02/gk3_10-600x450.png 600w, https://www.filfre.net/wp-content/uploads/2026/02/gk3_10.png 640w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p id=\"caption-attachment-6673\" class=\"wp-caption-text\">Oh là là!</p></div>\n<hr />\n<p><code> </code><br />\n<strong>Did you enjoy this article? If so, please think about pitching in to help me make many more like it. You can pledge any amount you like.</strong></p>\n<p><a href=\"https://www.patreon.com/DigitalAntiquarian\" rel=\"attachment wp-att-5598\"><img decoding=\"async\" class=\"aligncenter wp-image-5598 size-full\" src=\"https://www.filfre.net/wp-content/uploads/2023/04/Patreon-300x133-1.png\" alt=\"\" width=\"300\" height=\"133\" /></a></p>\n<hr />\n<p><code> </code></p>\n<p><strong>Sources</strong><strong>:</strong> The book <em>Gabriel Knight 3: Prima&#8217;s Official Strategy Guide</em> by Rick Barba and <em>Jane Jensen: Gabriel Knight, Adventure Games, Hidden Objects</em> by Anastasia Salter. <em>Computer Gaming World</em> of February 1999, June 1999, and April 2000; <em>Game Developer</em> of June 2000; <em>PC Zone</em> of July 1998; Sierra&#8217;s newsletter <em>InterAction</em> of Spring 1999.</p>\n<p>Online sources include <em>Adventure Gamer&#8217;</em>s interview with <a href=\"https://adventuregamers.com/article/adam_d-_bormann\"><em>Gabriel Knight 3</em></a> design assistant Adam D. Bormann, <em>Women Gamers&#8217;</em>s interview with <a href=\"https://web.archive.org/web/20051111173658/http://www.womengamers.com/interviews/jensen.php\">Jane Jensen</a>, the vintage <em>GameSpot</em> <a href=\"https://web.archive.org/web/20040607050251/http://www.gamespot.com/pc/adventure/gabrielknight3bloodotsbotd/review.html\">review of <em>Gabriel Knight 3</em></a>, the <a href=\"https://www.oldmanmurray.com/features/77.html\"><em>Old Man Murray</em> column</a> discussed in the article, and a <a href=\"https://gkpages.altervista.org/Interviews/DesignerDiaries_Home.html\">designer diary</a> that Jane Jensen wrote for <em>GameSpot</em> during the game&#8217;s development.</p>\n<p><strong>Where to Get It:</strong> <em><a href=\"https://www.gog.com/en/game/gabriel_knight_3_blood_of_the_sacred_blood_of_the_damned\">Gabriel Knight 3: Blood of the Sacred, Blood of the Damned</a> </em>is available as a digital purchase at GOG.com.</p>\n",
    "description": "This article tells part of the story of Jane Jensen. I think I became convinced when I went to CES [in January of 1997] and I walked around the show looking at all these titles that were the big new things, and not one screen had full-motion video. I realized that if I wanted anyone [&#8230;]",
    "is_fulltext": true,
    "source": "The Digital Antiquarian",
    "pub_date": "Fri, 20 Feb 2026 17:24:46 +0000",
    "fetched_at": "2026-02-21T00:36:47.319476",
    "url_hash": "31b30c20527572e957be9b1c6163f7f7"
  }
]