[
  {
    "title": "Programming is free",
    "link": "https://idiallo.com/blog/programming-tools-are-free?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>A college student on his spring break contacted me for a meeting. At the time, I had my own startup and was navigating the world of startup school with Y Combinator and the publicity from TechCrunch. This student wanted to meet with me to gain insight on the project he was working on. We met in a cafe, and he went straight to business. He opened his MacBook Pro, and I glimpsed at the website he and his partner had created.</p>\n\t\t\t<p>It was a marketplace for college students. You could sell your items to other students in your dorm. I figured this was a real problem he'd experienced and wanted to solve. But after his presentation, I only had one question in mind, about something he had casually dropped into his pitch without missing a beat. He was paying $200 a month for a website with little to no functionality. To add to it, the website was slow. </p>\n\n<p>In fact, it was so slow that he reassured me the performance problems should disappear once they upgraded to the next tier. </p>\n\n<p>Let's back up for a minute. When I was getting started, I bought a laptop for $60. A defective PowerBook G4 that was destined for the landfill. I downloaded BBEdit, installed MAMP, and in little to no time I had clients on Craigslist. That laptop paid for itself at least 500 times over. Then a friend gave me her old laptop, a Dell Inspiron e1505. That one paved the way to a professional career that landed me jobs in Fortune 10 companies.</p>\n\n<p>I owe it all not only to the cheap devices I used to propel my career and make a living, but also to the free tools that were available.</p>\n\n<p>My IDE was Vim. My language was PHP, a language that ran on almost every server for the price of a shared hosting plan that cost less than a pizza. My cloud was a folder on that server. My AI pair programmer was a search engine and a hope that someone, somewhere, had the same problem I did and had posted the solution on a forum.</p>\n\n<p>The only barrier to entry was the desire to learn.</p>\n\n<p>Fast forward to today, every beginner is buying equipment that can simulate the universe. Before they start their first line of code, they have subscriptions to multiple paid services. It's not because the free tools have vanished, but because the entire narrative around how to get started is now dominated by paid tools and a new kind of gatekeeper: the influencer.</p>\n\n<p>When you get started with programming today, the question is \"which tool do I need to buy?\"</p>\n\n<p>The simple LAMP stack (Linux, Apache, MySQL, PHP) that launched my career and that of thousands of developers is now considered quaint. Now, beginners start with AWS. Some get the certification before they write a single line of code. Every class and bootcamp sells them on the cloud. It's AWS, it's Vercel, it's a dozen other platforms with complex pricing models designed for scale, not for someone building their first \"Hello, World!\" app.</p>\n\n<p>Want to build something modern? You'll need an API key for this service, a paid tier for that database, and a hosting plan that charges by the request. Even the code editor, once a simple download, is now often a SaaS product with a subscription. Are you going to use an IDE without an AI assistant? Are you a dinosaur? To be a productive programmer, you need a subscription to an AI.</p>\n\n<p>It may be a fruitless attempt, but I'll say it anyway. You don't need any paid tools to start learning programming and building your first side project. You never did. The free tools are still there. Git, VS Code (which is still free and excellent!), Python, JavaScript, Node.js, a million static site generators. They are all still completely, utterly free.</p>\n\n<p>New developers are not gravitating towards paid tools by accident. Other than code bootcamps selling them on the idea, the main culprit is their medium of learning. The attention economy.</p>\n\n<p>As a beginner, you're probably lost. When I was lost, I read documentation until my eyes bled. It was slow, frustrating, and boring. But it was active. I was engaging with the code, wrestling with it line by line.</p>\n\n<p>Today, when a learner is lost, they go to YouTube. A question I am often asked is:</p>\n\n<blockquote>\n  <p>Do you know [YouTuber Name]? He makes some pretty good videos.</p>\n</blockquote>\n\n<p>And they're right. The YouTuber is great. They're charismatic, they break down complex topics, and they make it look easy. In between, they promote Hostinger or whichever paid tool is sponsoring them today. But the medium is the message, and the message of <a href=\"https://idiallo.com/blog/large-language-models-make-us-feel-smarter\">YouTube is passive consumption</a>. You watch, you nod along, you feel like you're learning. And then the video ends. An algorithm, designed to keep you watching, instantly serves you the <a href=\"https://idiallo.com/blog/infinite-videos\">next shiny tutorial</a>. You click. You watch. You never actually practice.</p>\n\n<p>Now instead of just paying money for the recommended tool, you are also paying an invisible cost. You are paying with your time and your focus. You're trading the deep, frustrating, but essential work of building for the shallow, easy dopamine hit of watching someone else build.</p>\n\n<p>The influencer's goal is to keep you watching. The platform's goal is to keep you scrolling. Your goal should be to stop watching and start typing. These goals are at odds.</p>\n\n<hr />\n\n<p>I told that student he was paying a high cost for his hobby project. A website with a dozen products and images shouldn't cost more than a $30 Shopify subscription. If you feel more daring and want to do the work yourself, a $5 VPS is a good start. You can install MySQL, Rails, Postgres, PHP, Python, Node, or whatever you want on your server. If your project gains popularity, scaling it wouldn't be too bad. If it fails, the financial cost is a drop in a bucket.</p>\n\n<p>His story stuck with me because it wasn't unique. It's the default path now: spend first, learn second. But it doesn't have to be.</p>\n\n<p>You don't need an AI subscription. You don't need a YouTuber. You need a text editor (free), a language runtime (free), and a problem you want to solve. You need to get bored enough to open a terminal and start tinkering.</p>\n\n<p>The greatest gift you can give yourself as a new programmer isn't a $20/month AI tool or a library of tutorial playlists. It's the willingness to stare at a blinking cursor and a cryptic error message until you figure it out yourself.</p>\n\n<p>Remember, my $60 defective laptop launched a career. That student's $200/month website taught him to wait for someone else to fix his problems. The only difference between us was our approach.</p>\n\n<p>The tools for learning are, and have always been, free. Don't let anyone convince you otherwise.</p>\n\t\t\t\n\t\t\t\t",
    "description": "A college student on his spring break contacted me for a meeting. At the time, I had my own startup and was navigating the world of startup school with Y Combinator and the publicity from TechCrunch. This student wanted to meet with me to gain insight on the project he was working on. We met in a cafe, and he went straight to business. He opened his MacBook Pro, and I glimpsed at the website he and his partner had created. It was a marketplace for college students. You could sell your items to o",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Mon, 16 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-16T12:21:52.909990",
    "url_hash": "1f68d85202e6bd2e94a6d4fe3682275c"
  },
  {
    "title": "Pluralistic: The online community trilemma (16 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/16/fast-good-cheap/",
    "content": "<p><!--\nTags:\nsocial studies, sociology, anthropology, ethnography, online communities, scholarship, danah boyd, fakesters, radicalization,\n\nSummary:\nThe online community trilemma; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/16/fast-good-cheap/\n\nTitle:\nPluralistic: The online community trilemma (16 Feb 2026) fast-good-cheap\n\nBullet:\n&#x1f9b9;&#x200d;&#x2642;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/16Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#getting-up\">The online community trilemma</a>: Reach, community and information, pick two.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#retro\">Object permanence</a>: Bruces x Sony DRM; Eniac tell-all; HBO v PVRs; Fucking damselflies; Gil Scout Cookie wine-pairings; Big Pharma's opioid fines are tax-deductible; Haunted Mansion ops manual; RIAA v CD ripping; Flying boat; Morbid Valentines; Veg skulls; Billionaires x VR v guillotines; \"Lovecraft Country\"; Claude Shannon on AI; Comics Code Authority horror comic; Scratch-built clock; Stolen hospital.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12435\"></span></p>\n<hr/>\n<p><a name=\"getting-up\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"An early 20th century photo of a mixed-gender group of people drinking in a working-class bar; with a smiling woman in the center. It has been altered: a nova-haloed thought bubble coming from the center woman's head reveals that she is daydreaming of a salon in which three upper class women in flapper-era outfits are chattering. A Prince Albert ad in the background has had the Reddit robot mascot matted into it.\" src=\"https://i0.wp.com/craphound.com/images/community-trilemma.jpg?w=840&#038;ssl=1\"/></p>\n<h1>The online community trilemma (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#getting-up\">permalink</a>)</h1>\n<p>The digital humanities are one of the true delights of this era. Anthropologists are counting things like sociologists, sociologists are grappling with qualitative data like ethnographers, computational linguists are scraping and making sense of vast corpora of informal speech:</p>\n<p><a href=\"https://memex.craphound.com/2019/07/24/because-internet-the-new-linguistics-of-informal-english/\">https://memex.craphound.com/2019/07/24/because-internet-the-new-linguistics-of-informal-english/</a></p>\n<p>I follow a bunch of these digital humanities types: danah boyd, of course, but also Benjamin \"Mako\" Hill, whose work on the true meaning of the \"free software\"/\"open source\" debate is one of my daily touchpoints for making sense of the world we live in:</p>\n<p><a href=\"https://www.youtube.com/watch?v=vBknF2yUZZ8\">https://www.youtube.com/watch?v=vBknF2yUZZ8</a></p>\n<p>Mako just published a new <em>ACM HCI</em> paper co-authored with his U Washington colleagues Nathan TeBlunthuis, Charles Kiene, Isabella Brown, and Laura Levi, \"No Community Can Do Everything: Why People Participate in Similar Online Communities\":</p>\n<p><a href=\"https://dl.acm.org/doi/epdf/10.1145/3512908\">https://dl.acm.org/doi/epdf/10.1145/3512908</a></p>\n<p>The paper is a great example of this quantitative ethnography/qualitative statistical analysis hybrid. The authors are trying to figure out why there are so many similar, overlapping online communities, particularly on platforms like Reddit. Why would r/bouldering, r/climbharder, r/climbing, <em>and</em> r/climbingcirclejerk all emerge?</p>\n<p>This is a <em>really</em> old question/debate in online community design. The original internet community space, Usenet, was founded on strict hierarchical principles, using a taxonomy to produce a single canonical group for every kind of discussion. Sure, there was specialization (rec.pets.cats begat rec.pets.cats.siamese), but by design, there weren't supposed to be competing groups laying claim to the same turf, and indeed, unwary Usenet users were often scolded for misfiling their comments in the wrong newsgroup.</p>\n<p>The first major Usenet schism arose out of this tension: the alt. hierarchy. Though alt. later became known for warez, porn, and other subjects that were banned by Usenet's founding \"backbone cabal,\" the inciting incident that sparked alt.'s creation was a fight over whether \"gourmand\" should be classified as \"rec.gourmand\" or \"talk.gourmand\":</p>\n<p><a href=\"https://www.eff.org/deeplinks/2019/11/altinteroperabilityadversarial\">https://www.eff.org/deeplinks/2019/11/altinteroperabilityadversarial</a></p>\n<p>Community managers design their services with strongly held beliefs about the features that make a community good. These beliefs, grounded in designers' personal experience, are assumed to be global and universal. Generally, this assumption is wrong, something that is only revealed later when more people arrive with different needs.</p>\n<p>Think of Friendster's \"fakester\" problem, driven by its designers' beliefs about how people should organize their affinities:</p>\n<p><a href=\"https://www.zephoria.org/thoughts/archives/2003/08/17/the_fakester_manifesto.html\">https://www.zephoria.org/thoughts/archives/2003/08/17/the_fakester_manifesto.html</a></p>\n<p>Or Mastodon's initial, self-limiting ban on \"quote\" posts as a way to encourage civility:</p>\n<p><a href=\"https://blog.joinmastodon.org/2025/02/bringing-quote-posts-to-mastodon/\">https://blog.joinmastodon.org/2025/02/bringing-quote-posts-to-mastodon/</a></p>\n<p>And, as the paper's authors note, Stack Overflow has a strict prohibition on overlapping new communities, echoing Usenet's original design dispute.</p>\n<p>On its face, this hierarchical principle for conversational spaces makes sense. Viewed through a naive economic lens of \"reputation capital,\" having one place where all the people interested in your subject can be reached is optimal. The more people there are in a group, the greater the maximum \"engagement\" &#8211; likes, comments, reposts. If you're thinking about communities from an informational perspective, it's easy to assume that bigger groups are better, too: the more users there are in a topical group, the greater the likelihood that a user who knows the answer to your question will show up when you ask it.</p>\n<p>But this isn't how online communities work. On every platform, and across platforms, overlapping, \"redundant\" groups emerge quickly and stick around over long timescales. Why is this?</p>\n<p>That's the question the paper seeks to answer. The authors used data-analysis techniques to identify overlapping clusters of Reddit communities and then conducted lengthy, qualitative interviews with participants to discover why and how users participated in some or all of these seemingly redundant groups.</p>\n<p>They conclude that there's a community-member's \"trilemma\": a set of three priorities that can never be fully satisfied by any group. The trilemma consists of users' need to find:</p>\n<p>a) A community of like-minded people;</p>\n<p>b) Useful information; and</p>\n<p>c) The largest possible audience.</p>\n<p>The thing that puts the \"lemma\" in this \"trilemma\" is that any given group can only satisfy two of these three needs. It's hard to establish the kinds of intimate, high-trust bonds with the members of a giant, high-traffic group, but your small, chummy circle of pals might not be big enough to include people who have the information you're seeking. Users can't get everything they need from any one group, so they join multiple groups that prioritize different paired corners of this people-information-scale triangle.</p>\n<p>The interview excerpts put some very interesting meat on these analytical bones. For example, economists typically believe that online marketplaces rely on scale. Think of eBay: as the number of potential bidders increases, the likelihood that one will outbid another goes up. That drives more sellers to the platform, seeking the best price for their wares, which increases the diversity of offerings on eBay, bringing in more buyers.</p>\n<p>But the authors discuss a community where vintage vinyl records are bought and sold that benefits from being <em>smaller</em>, because the members all know each other well enough to have a mutually trusting environment that makes transactions far more reliable. Actually knowing someone &#8211; and understanding that they don't want to be expelled from the community you both belong to &#8211; makes for a better selling and buying experience than consulting their eBay reputation score. The fact that buyers don't have as many sellers and sellers don't have as many buyers is trumped by the human connection in a community of just the right size.</p>\n<p>That's another theme that arises in the paper: a \"just right\" size for a community. As one interviewee says:</p>\n<blockquote><p>\n  I think there’s this weird bell curve where the community needs to be big enough where people want to post content. But it can’t get too big where people are drowning each other out for attention.\n</p></blockquote>\n<p>This explains why groups sometimes schism: they've gone from being \"just big enough\" to being \"too big\" for the needs they filled for some users. But another reason for schism is the desire by some members to operate with different conversational norms. Many of Reddit's topical clusters include a group with the \"jerk\" suffix (like r/climbingcirclejerk), where aggressive and dramatic forms of discourse that might intimidate newcomers are welcome. Newbies go to the main group, while \"crusties\" talk shit in the -jerk group. The authors liken this to \"regulatory arbitrage\" &#8211; community members seeking spaces with rules that are favorable to their needs.</p>\n<p>And of course, there's the original source of community schism: specialization, the force that turns rec.pets.cats into rec.pets.cats.siamese, rec.pets.cats.mainecoons, etc. Though the authors don't discuss it, this kind of specialization is something that recommendation algorithms are really good at generating. At its best, this algorithmic specialization is a great way to discover new communities that enrich your life; at its worst, we call this \"radicalization.\"</p>\n<p>I devote a chapter of my 2023 book <em>The Internet Con</em>, \"What about Algorithmic Radicalization?\" to exploring this phenomenon:</p>\n<p><a href=\"https://www.versobooks.com/en-gb/products/3035-the-internet-con\">https://www.versobooks.com/en-gb/products/3035-the-internet-con</a></p>\n<p>The question I grapple with there is whether \"engagement-maximizing\" algorithms <em>shape</em> our interests, or whether they help us <em>discover</em> our interests. Here's the thought-experiment I propose: imagine you've spent the day shopping for kitchen cabinets and you're curious about the specialized carpentry that's used to build them. You go home and do a search that leads you to a video called \"How All-­Wood Cabinets Are Made.\"</p>\n<p>The video is interesting, but even more interesting is the fact that the creator uses the word \"joinery\" to describe the processes the video illustrates. So now you do a search for \"joinery\" and find yourself watching a wordless, eight-minute video about Japanese joinery, a thing you never even knew existed. The title of the video contains the transliterated Japanese phrase \"Kane Tsugi,\" which refers to a \"three-­way pinned corner miter\" joint. Even better, the video description contains the Japanese characters: \"面代留め差しほぞ接ぎ.\"</p>\n<p>So now you're searching for \"面代留め差しほぞ接ぎ\" and boy are there a lot of interesting results. One of them is an NHK documentary about Sashimoto woodworking, which is the school that Kane Tsugi belongs to. Another joint from Sashimoto joinery is a kind of tongue-and-groove called \"hashibame,\" but that comes up blank on Youtube.</p>\n<p>However, searching on that term brings you to a bunch of message boards where Japanese carpenters are discussing hashibame, and Google Translate lets you dig into this, and before you know it, you've become something of an expert on this one form of Japanese joinery. In just a few steps, you've gone from knowing nothing about cabinetry to having a specific, esoteric favorite kind of Japanese joint that you're seriously obsessed with.</p>\n<p>If this subject was political rather than practical, we'd call this process \"radicalization,\" and we'd call the outcome &#8211; you sorting yourself into a narrow niche interest, to the exclusion of others &#8211; \"polarization.\"</p>\n<p>But if we confine our examples to things like literature, TV shows, flowers, or glassware, this phenomenon is viewed as benign. No one accuses an algorithm of brainwashing you into being obsessed with hashibame tongue-and-groove corners. We treat your algorithm-aided traversal of carpentry techniques as one of discovery, not persuasion. You've discovered something about the world &#8211; and about yourself.</p>\n<p>Which brings me back to that original, Usenet-era schism over \"redundant\" groups. The person who wants to talk about being a \"gourmand\" in the \"rec.\" hierarchy wants to participate in a specific set of conversational norms that are different from those in the \"rec.\" hierarchy. Their interest isn't just being a \"gourmand,\" it's in being a \"rec.gourmand,\" something that is qualitatively different from being a \"talk.gourmand.\"</p>\n<p>The conversational trilemma &#8211; the unresolvable need for scale, trust and information &#8211; has been with us since the earliest days of online socializing. It's lovely to have it formalized in such a crisp, sprightly work of scholarship.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>A year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs <a href=\"https://edition.cnn.com/2026/02/12/business/trump-tariffs-consumers-nightcap\">https://edition.cnn.com/2026/02/12/business/trump-tariffs-consumers-nightcap</a></p>\n</li>\n<li>\n<p>How a Planned Disney World Vacation Turned Into Four Months in Immigration Detention <a href=\"https://www.propublica.org/article/ice-dilley-maria-antonia-guerra-story\">https://www.propublica.org/article/ice-dilley-maria-antonia-guerra-story</a></p>\n</li>\n<li>\n<p>In 1984, An Unemployed Ice Cream Truck Driver Memorized A Game Show's Secret Winning Formula. He Then Went On The Show… <a href=\"https://www.celebritynetworth.com/articles/entertainment-articles/in-1984-a-man-memorized-a-game-shows-secret-formula-and-won-a-fortune/\">https://www.celebritynetworth.com/articles/entertainment-articles/in-1984-a-man-memorized-a-game-shows-secret-formula-and-won-a-fortune/</a></p>\n</li>\n<li>\n<p>Editor’s Note: Retraction of article containing fabricated quotations <a href=\"https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/\">https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#retro\">permalink</a>)</h1>\n<p>#25yrsago O'Reilly P2P Conference <a href=\"https://web.archive.org/web/20010401001205/https://www.wired.com/news/technology/0,1282,41850,00.html\">https://web.archive.org/web/20010401001205/https://www.wired.com/news/technology/0,1282,41850,00.html</a></p>\n<p>#20yrsago Sony DRM Debacle roundup Part VI <a href=\"https://memex.craphound.com/2006/02/14/sony-drm-debacle-roundup-part-vi/\">https://memex.craphound.com/2006/02/14/sony-drm-debacle-roundup-part-vi/</a></p>\n<p>#20yrsago Bruce Sterling on Sony DRM debacle <a href=\"https://web.archive.org/web/20060316133726/https://www.wired.com/wired/archive/14.02/posts.html?pg=5\">https://web.archive.org/web/20060316133726/https://www.wired.com/wired/archive/14.02/posts.html?pg=5</a></p>\n<p>#20yrsago ENIAC co-inventor dishes dirt, debunks myths <a href=\"https://web.archive.org/web/20060218064519/https://www.computerworld.com/printthis/2006/0,4814,108568,00.html\">https://web.archive.org/web/20060218064519/https://www.computerworld.com/printthis/2006/0,4814,108568,00.html</a></p>\n<p>#20yrsago HBO targets PVRs <a href=\"https://thomashawk.com/2006/02/hbos-harrasment-of-pvr-owners.html\">https://thomashawk.com/2006/02/hbos-harrasment-of-pvr-owners.html</a></p>\n<p>#20yrsago Princeton DRM researchers release Sony debacle paper <a href=\"https://web.archive.org/web/20060222235419/https://itpolicy.princeton.edu/pub/sonydrm-ext.pdf\">https://web.archive.org/web/20060222235419/https://itpolicy.princeton.edu/pub/sonydrm-ext.pdf</a></p>\n<p>#20yrsago HOWTO run Disneyland’s Haunted Mansion <a href=\"https://web.archive.org/web/20060208213048/http://tinselman.typepad.com/tinselman/2005/08/_latest_populat.html\">https://web.archive.org/web/20060208213048/http://tinselman.typepad.com/tinselman/2005/08/_latest_populat.html</a></p>\n<p>#20yrsago RIAA: CD ripping isn’t fair use <a href=\"https://web.archive.org/web/20060216233008/https://www.eff.org/deeplinks/archives/004409.php\">https://web.archive.org/web/20060216233008/https://www.eff.org/deeplinks/archives/004409.php</a></p>\n<p>#15yrsago “Psychic” cancels show due to “unforeseen circumstances” <a href=\"https://web.archive.org/web/20110217050619/https://scienceblogs.com/pharyngula/2011/02/irony.php?utm_source=combinedfeed&amp;amp;utm_medium=rss\">https://web.archive.org/web/20110217050619/https://scienceblogs.com/pharyngula/2011/02/irony.php?utm_source=combinedfeed&amp;amp;utm_medium=rss</a></p>\n<p>#15yrsago CBS sends a YouTube takedown to itself <a href=\"https://web.archive.org/web/20110218201102/https://www.reddit.com/r/WTF/comments/flktg/cbs_files_a_copyright_claim_against_themselves_o_o/\">https://web.archive.org/web/20110218201102/https://www.reddit.com/r/WTF/comments/flktg/cbs_files_a_copyright_claim_against_themselves_o_o/</a></p>\n<p>#15yrsago Lost luxury: the Boeing 314 flying boat <a href=\"https://web.archive.org/web/20110217144300/http://www.asb.tv/blog/2011/02/boeing-314-flying-boat/\">https://web.archive.org/web/20110217144300/http://www.asb.tv/blog/2011/02/boeing-314-flying-boat/</a></p>\n<p>#15yrsago Brazilian telcoms regulator raids, confiscates and fines over open WiFi <a href=\"https://globalvoices.org/2011/02/14/brazil-criminalization-sharing-internet-wifi/\">https://globalvoices.org/2011/02/14/brazil-criminalization-sharing-internet-wifi/</a></p>\n<p>#15yrsago Blatant disinformation about Scientology critic <a href=\"https://memex.craphound.com/2011/02/14/bald-disinformation-about-scientology-critic/\">https://memex.craphound.com/2011/02/14/bald-disinformation-about-scientology-critic/</a></p>\n<p>#15yrsago 3D printer that prints itself gets closer to reality <a href=\"https://web.archive.org/web/20110217072944/http://i.materialise.com/blog/entry/cloning-the-reprap-prusa-in-under-30-minutes\">https://web.archive.org/web/20110217072944/http://i.materialise.com/blog/entry/cloning-the-reprap-prusa-in-under-30-minutes</a></p>\n<p>#15yrsago Damselflies’ curious mating posture <a href=\"https://www.nationalgeographic.com/photo-of-the-day/photo/damselflies-heart-shape\">https://www.nationalgeographic.com/photo-of-the-day/photo/damselflies-heart-shape</a></p>\n<p>#15yrsago Simpsons house as a Quake III level <a href=\"https://www.youtube.com/watch?v=34LtrnnXQTc\">https://www.youtube.com/watch?v=34LtrnnXQTc</a></p>\n<p>#15yrsago Dapper Day at Disneyland: the well-dressed go to the fun-park <a href=\"https://web.archive.org/web/20110219162834/http://thedisneyblog.com/2011/02/16/dapper-day-at-disney-parks-this-sunday/\">https://web.archive.org/web/20110219162834/http://thedisneyblog.com/2011/02/16/dapper-day-at-disney-parks-this-sunday/</a></p>\n<p>#15yrsago Horror/exploitation comic recounts the secret founding of the Comics Code Authority <a href=\"https://web.archive.org/web/20110218230149/http://comicsmakekidsevil.com/?p=88\">https://web.archive.org/web/20110218230149/http://comicsmakekidsevil.com/?p=88</a></p>\n<p>#10yrsago After 3d grade complaint, Florida school district bans award-winning “This One Summer” from high-school library <a href=\"https://ncac.org/incident/florida-high-school-libraries-restrict-access-to-award-winning-graphic-novel\">https://ncac.org/incident/florida-high-school-libraries-restrict-access-to-award-winning-graphic-novel</a></p>\n<p>#10yrsago Watch: Claude Shannon, Jerome Wiesner and Oliver Selfridge in a 1960s AI documentary <a href=\"https://www.youtube.com/watch?v=aygSMgK3BEM#10yrsago\">https://www.youtube.com/watch?v=aygSMgK3BEM#10yrsago</a></p>\n<p>#10yrsago Hackers steal a hospital in Hollywood <a href=\"https://www.nbclosangeles.com/news/fbi-lapd-investigating-hollywood-hospital-cyber-attack/88301/\">https://www.nbclosangeles.com/news/fbi-lapd-investigating-hollywood-hospital-cyber-attack/88301/</a></p>\n<p>#10yrsago Watch: a home machinist makes a clock from scratch, right down to the screws and washers <a href=\"https://www.youtube.com/watch?v=KXzyCM23WPI\">https://www.youtube.com/watch?v=KXzyCM23WPI</a></p>\n<p>#10yrsago Matt Ruff’s “Lovecraft Country,” where the horror is racism (not racist) <a href=\"https://memex.craphound.com/2016/02/16/matt-ruffs-lovecraft-country-where-the-horror-is-racism-not-racist/\">https://memex.craphound.com/2016/02/16/matt-ruffs-lovecraft-country-where-the-horror-is-racism-not-racist/</a></p>\n<p>#10yrsago NYPD wants to make “resisting arrest” into a felony <a href=\"https://web.archive.org/web/20160205061338/http://justice.gawker.com/nypd-has-a-plan-to-magically-turn-anyone-it-wants-into-1684017767\">https://web.archive.org/web/20160205061338/http://justice.gawker.com/nypd-has-a-plan-to-magically-turn-anyone-it-wants-into-1684017767</a></p>\n<p>#10yrsago Best wine-pairings for Girl Scout Cookies <a href=\"https://www.vivino.com/en/wine-news/girl-scout-cookies-and-wine--we-paired-them-and-the-results-are-amazing\">https://www.vivino.com/en/wine-news/girl-scout-cookies-and-wine&#8211;we-paired-them-and-the-results-are-amazing</a></p>\n<p>#10yrsago John Oliver on states’ voter ID laws <a href=\"https://www.youtube.com/watch?v=rHFOwlMCdto\">https://www.youtube.com/watch?v=rHFOwlMCdto</a></p>\n<p>#10yrsago Morbid and risque Valentines of yesteryear <a href=\"https://memex.craphound.com/2016/02/15/morbid-and-risque-valentines-of-yesteryear/\">https://memex.craphound.com/2016/02/15/morbid-and-risque-valentines-of-yesteryear/</a></p>\n<p>#10yrsago App Stores: winner-take-all markets dominated by rich countries <a href=\"https://www.cariboudigital.net/wp-content/uploads/2016/02/Caribou-Digital-Winners-and-Losers-in-the-Global-App-Economy-2016.pdf\">https://www.cariboudigital.net/wp-content/uploads/2016/02/Caribou-Digital-Winners-and-Losers-in-the-Global-App-Economy-2016.pdf</a></p>\n<p>#10yrsago Skulls carved from vegetable matter <a href=\"https://dimitritsykalov.com/#intro\">https://dimitritsykalov.com/#intro</a></p>\n<p>#5yrsago Privacy Without Monopoly (podcast) <a href=\"https://pluralistic.net/2021/02/15/ulysses-pacts/#paternalism-denied\">https://pluralistic.net/2021/02/15/ulysses-pacts/#paternalism-denied</a></p>\n<p>#5yrsago Billionaires think VR stops guillotines <a href=\"https://pluralistic.net/2021/02/15/ulysses-pacts/#motivated-reasoning\">https://pluralistic.net/2021/02/15/ulysses-pacts/#motivated-reasoning</a></p>\n<p>#5yrsago ADT insider threat <a href=\"https://pluralistic.net/2021/02/15/ulysses-pacts/#temptations-way\">https://pluralistic.net/2021/02/15/ulysses-pacts/#temptations-way</a></p>\n<p>#5yrsago Big Pharma will claim opioid fines as tax-deductions <a href=\"https://pluralistic.net/2021/02/14/a-fine-is-a-price/#deductible\">https://pluralistic.net/2021/02/14/a-fine-is-a-price/#deductible</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18<br />\n<a href=\"https://tanner.utah.edu/center-events/cory-doctorow/\">https://tanner.utah.edu/center-events/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Oslo (remote): Seminar og lansering av rapport om «enshittification»<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#recent\">permalink</a>)</h1>\n<ul>\n<li>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/16/fast-good-cheap/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1042 words today, 29792 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links The online community trilemma: Reach, community and information, pick two. Hey look at this: Delights to delectate. Object permanence: Bruces x Sony DRM; Eniac tell-all; HBO v PVRs; Fucking damselflies; Gil Scout Cookie wine-pairings; Big Pharma's opioid fines are tax-deductible; Haunted Mansion ops manual; RIAA v CD ripping; Flying boat; Morbid Valentines; Veg skulls; Billionaires x VR v guillotines; \"Lovecraft Country\"; Claude Shannon on AI; Comics Code Authority horror comic; Sc",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Mon, 16 Feb 2026 08:22:26 +0000",
    "fetched_at": "2026-02-16T12:21:55.372723",
    "url_hash": "054383bb27c9e34f3738d1468cf4bfb0"
  },
  {
    "title": "Diagnostics Factory",
    "link": "https://matklad.github.io/2026/02/16/diagnostics-factory.html",
    "content": "\n<header>\n  <h1>Diagnostics Factory</h1>\n  <time class=\"meta\" datetime=\"2026-02-16\">Feb 16, 2026</time>\n</header>\n<p>In\n<span class=\"display\"><a href=\"https://matklad.github.io/2025/11/06/error-codes-for-control-flow.html\"><em>Error Codes For Control Flow</em></a>,</span>\nI explained that Zig’s strongly-typed error codes solve the “handling” half of error management,\nleaving “reporting” to the users. Today, I want to describe my personal default approach to\nthe reporting problem, that is, showing the user a useful error message.</p>\n<p>The approach is best described in the negative: <em>avoid</em> thinking about error payloads, and what\nthe type of error should be. Instead, provide a set of functions for constructing errors.</p>\n<p>To give a concrete example, in TigerBeetle’s <code>tidy.zig</code> (a project-specific linting script, another\nuseful meta-pattern), we define errors as follows:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">const</span> Errors = <span class=\"hl-keyword\">struct</span> {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> add_long_line</span>(</span>\n<span class=\"line\">        errors: <span class=\"hl-operator\">*</span>Errors,</span>\n<span class=\"line\">        file: SourceFile,</span>\n<span class=\"line\">        line_index: <span class=\"hl-type\">usize</span>,</span>\n<span class=\"line\">    ) <span class=\"hl-type\">void</span> { ... }</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> add_banned</span>(</span>\n<span class=\"line\">        errors: <span class=\"hl-operator\">*</span>Errors,</span>\n<span class=\"line\">        file: SourceFile,</span>\n<span class=\"line\">        offset: <span class=\"hl-type\">usize</span>,</span>\n<span class=\"line\">        banned_item: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">        replacement: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">    ) <span class=\"hl-type\">void</span> { ... }</span>\n<span class=\"line\"></span>\n<span class=\"line\">    <span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> add_dead_declaration</span>(...) <span class=\"hl-type\">void</span> { ... }</span>\n<span class=\"line\"></span>\n<span class=\"line\">    ...</span>\n<span class=\"line\">};</span></code></pre>\n\n</figure>\n<p>and the call-site looks like this:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> tidy_file</span>(file: SourceFile, errors: <span class=\"hl-operator\">*</span>Errors) <span class=\"hl-type\">void</span> {</span>\n<span class=\"line\">    <span class=\"hl-comment\">// ...</span></span>\n<span class=\"line\">    <span class=\"hl-keyword\">var</span> line_index: <span class=\"hl-type\">usize</span> = <span class=\"hl-numbers\">0</span>;</span>\n<span class=\"line\">    <span class=\"hl-keyword\">while</span> (lines.next()) <span class=\"hl-operator\">|</span>line<span class=\"hl-operator\">|</span> : (line_index <span class=\"hl-operator\">+=</span> <span class=\"hl-numbers\">1</span>) {</span>\n<span class=\"line\">        <span class=\"hl-keyword\">const</span> line_length = line_length(line);</span>\n<span class=\"line\">        <span class=\"hl-keyword\">if</span> (line_length &gt; <span class=\"hl-numbers\">100</span> <span class=\"hl-keyword\">and</span> <span class=\"hl-operator\">!</span>contains_url(line)) {</span>\n<span class=\"line\">            errors.add_long_line(file, line_index);</span>\n<span class=\"line\">        }</span>\n<span class=\"line\">    }</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p>In this case, I collect multiple errors so I don’t return right away. Fail fast would look like\nthis:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\">errors.add_long_line(file, line_index);</span>\n<span class=\"line\"><span class=\"hl-keyword\">return</span> <span class=\"hl-keyword\">error</span>.Tidy;</span></code></pre>\n\n</figure>\n<p>Note that the error code is intentionally independent of the specific error produced.</p>\n<hr>\n<p>Some interesting properties of the solution:</p>\n<ul>\n<li>\nThe error representation is a set of constructor functions, the calling code doesn’t care what\n<em>actually</em> happens inside. This is why the error factory is my <em>default</em> solution — I don’t have\nto figure out up-front what I’ll do with the errors, and I can change my mind later.\n</li>\n<li>\nThere’s a natural place to convert information from the form available at the place where we emit\nthe error to a form useful for the user. In <code>add_banned</code> above, the caller passes in a absolute\noffset in a file, and it is resolved to line number and column inside (tip: use <code>line_index</code> for\n0-based internal indexes, and <code>line_number</code> for user-visible 1-based ones). Contrast this with a\ntraditional error as sum-type approach, where there’s a sharp syntactic discontinuity between\nconstructing a variant directly and calling a helper function.\n</li>\n<li>\nThis syntactic uniformity in turn allows easily grepping for all error locations:\n<span class=\"display\"><code>rg 'errors.add_'</code></span>.\n</li>\n<li>\nSimilarly, there’s one central place that enumerates all possible errors (which is either a\nbenefit or a drawback).\n</li>\n</ul>\n<p>A less trivial property is that this structure enables polymorphism. In fact, in the <code>tidy.zig</code>\ncode, there are two different representations of errors. When running the script, errors are\ndirectly emitted to stderr. But when testing it, errors are collected into an in-memory buffer:</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">pub</span> <span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> add_banned</span>(</span>\n<span class=\"line\">    errors: <span class=\"hl-operator\">*</span>Errors,</span>\n<span class=\"line\">    file: SourceFile,</span>\n<span class=\"line\">    offset: <span class=\"hl-type\">usize</span>,</span>\n<span class=\"line\">    banned_item: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">    replacement: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">) <span class=\"hl-type\">void</span> {</span>\n<span class=\"line\">    errors.emit(</span>\n<span class=\"line\">        <span class=\"hl-string\">&quot;{s}:{d}: error: {s} is banned, use {s}<span class=\"hl-string\">\\n</span>&quot;</span>,</span>\n<span class=\"line\">        .{</span>\n<span class=\"line\">            file.path, file.line_number(offset),</span>\n<span class=\"line\">            banned_item, replacement,</span>\n<span class=\"line\">        },</span>\n<span class=\"line\">    );</span>\n<span class=\"line\">}</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">fn</span><span class=\"hl-function\"> emit</span>(</span>\n<span class=\"line\">    errors: <span class=\"hl-operator\">*</span>Errors,</span>\n<span class=\"line\">    <span class=\"hl-keyword\">comptime</span> fmt: []<span class=\"hl-keyword\">const</span> <span class=\"hl-type\">u8</span>,</span>\n<span class=\"line\">    args: <span class=\"hl-type\">anytype</span>,</span>\n<span class=\"line\">) <span class=\"hl-type\">void</span> {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">comptime</span> assert(fmt[fmt.len <span class=\"hl-operator\">-</span> <span class=\"hl-numbers\">1</span>] <span class=\"hl-operator\">==</span> <span class=\"hl-string\">&#x27;<span class=\"hl-string\">\\n</span>&#x27;</span>);</span>\n<span class=\"line\">    errors.count <span class=\"hl-operator\">+=</span> <span class=\"hl-numbers\">1</span>;</span>\n<span class=\"line\">    <span class=\"hl-keyword\">if</span> (errors.captured) <span class=\"hl-operator\">|</span><span class=\"hl-operator\">*</span>captured<span class=\"hl-operator\">|</span> {</span>\n<span class=\"line\">        captured.writer(errors.gpa).print(fmt, args)</span>\n<span class=\"line\">            <span class=\"hl-keyword\">catch</span> <span class=\"hl-built_in\">@panic</span>(<span class=\"hl-string\">&quot;OOM&quot;</span>);</span>\n<span class=\"line\">    } <span class=\"hl-keyword\">else</span> {</span>\n<span class=\"line\">        std.debug.print(fmt, args);</span>\n<span class=\"line\">    }</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p>There isn’t a giant <code>union(enum)</code> of all errors, because it’s not needed for the present use-case.</p>\n<p>This pattern can be further extended to a full-fledged diagnostics framework with error builders,\nspans, ANSI colors and such, but that is tangential to the main idea here: even when “programming in\nthe small”, it might be a good idea to avoid constructing enums directly, and mandate an\nintermediate function call.</p>\n<hr>\n<p>Two more meta observations here:</p>\n<p><em>First</em>, the entire pattern is of course the expression of duality between a sum of two types and a\nproduct of two functions (the visitor pattern)</p>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">fn</span> <span class=\"hl-title function_\">foo</span>() <span class=\"hl-punctuation\">-&gt;</span> <span class=\"hl-type\">Result</span>&lt;T, E&gt;;</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">fn</span> <span class=\"hl-title function_\">bar</span>(ok: <span class=\"hl-keyword\">impl</span> <span class=\"hl-title class_\">FnOnce</span>(T), err: <span class=\"hl-keyword\">impl</span> <span class=\"hl-title class_\">FnOnce</span>(E));</span></code></pre>\n\n</figure>\n\n<figure class=\"code-block\">\n\n\n<pre><code><span class=\"line\"><span class=\"hl-keyword\">enum</span> <span class=\"hl-title class_\">Result</span>&lt;T, E&gt; {</span>\n<span class=\"line\">    <span class=\"hl-title function_ invoke__\">Ok</span>(T),</span>\n<span class=\"line\">    <span class=\"hl-title function_ invoke__\">Err</span>(E),</span>\n<span class=\"line\">}</span>\n<span class=\"line\"></span>\n<span class=\"line\"><span class=\"hl-keyword\">trait</span> <span class=\"hl-title class_\">Result</span>&lt;T, E&gt; {</span>\n<span class=\"line\">    <span class=\"hl-keyword\">fn</span> <span class=\"hl-title function_\">ok</span>(<span class=\"hl-keyword\">self</span>, T);</span>\n<span class=\"line\">    <span class=\"hl-keyword\">fn</span> <span class=\"hl-title function_\">err</span>(<span class=\"hl-keyword\">self</span>, E);</span>\n<span class=\"line\">}</span></code></pre>\n\n</figure>\n<p><em>Second</em>, every abstraction is a thin film separating two large bodies of code. Any interface has\ntwo sides, the familiar one presented to the user, and the other, hidden one, presented to the\nimplementor. Often, default language machinery pushes you towards using the same construct for both\nbut that can be suboptimal. It’s natural for the user and the provider of the abstraction to\ndisagree on the optimal interface, and to evolve independently. Using a single big enum for errors\ncouples error emitting and error reporting code, as they have to meet in the middle. In contrast,\nthe factory solution is optimal for producer (they literally just pass whatever they already have on\nhand, without any extra massaging of data), and is flexible for consumer(s).</p>\n",
    "description": "InError Codes For Control Flow,I explained that Zig's strongly-typed error codes solve the handling half of error management,leaving reporting to the users. Today, I want to describe my personal default approach tothe reporting problem, that is, showing the user a useful error message.",
    "is_fulltext": true,
    "source": "matklad",
    "pub_date": "2026-02-16T00:00:00+00:00",
    "fetched_at": "2026-02-16T12:22:15.757082",
    "url_hash": "26233271db8d5b7739789d05016f6d06"
  },
  {
    "title": "Modern UI is clean and invisible? Ha, I wish!",
    "link": "https://rakhim.exotext.com/modern-ui-is-not-invisible",
    "content": "<p>This is an excellent video about modern UI/UX: &quot;The Hidden Cost of &#39;Clean&#39; Design.&quot; I highly recommend watching it and checking out Ilia&#39;s other work.</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/4rD3lHLu8Bk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media;   gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n\n<p>I agree with nearly everything in the video, including this standout quote:</p>\n<blockquote>\n<p>If you want to understand a generation, don&#39;t listen to what its witnesses say. Look at what it creates.</p>\n</blockquote>\n<p>Ilia compares Apple Music and Winamp. One is modern and &quot;clean&quot;, the other feels &quot;dated&quot; to many people. Why does it feel dated? Because it has character. A distinctive style. It is <strong>visible</strong>. And modern interfaces are so devoid of character and look the same across companies and industries because designers tend to think that good UI should be invisible.</p>\n<p><img src=\"https://img.exotext.com/1/38Ssh9QzWtGGVNJPQvxYT.jpg\" alt=\"\"></p>\n<p>This is where I disagree with... well, I’m not sure if it’s Ilia or the general sentiment. Do UX designers today <em>really</em> think their interfaces are invisible?</p>\n<p>I mean yeah, technically many of them are invisible in a literal sense: transparency and the lack of contrast dialed up to a fault. But I don&#39;t think this is what they mean. They mean &quot;invisible&quot; in the sense that you don&#39;t see the app; instead, you &quot;experience joy&quot; with music, &quot;get entertained&quot; by streaming, or &quot;relive memories&quot; through photos.</p>\n<p>Winamp and other &quot;old-school&quot; programs possess prominent visual features that reflect the personality of their creators. You could argue that such a distinct character adds a visual layer that distracts from the media itself.</p>\n<p>Yet, I find modern interfaces far more distracting. Not because of colors or shapes, but because in their pursuit of invisibility, designers have created unintuitive, multi-dimensional structures that we are forced to navigate. Structures with almost no connection to reality.</p>\n<p>Winamp never made me feel stupid. Modern apps make me feel like I&#39;m losing my mind sometimes. Instead of looking at a single screen with many colorful, high-contrast buttons and sliders, I&#39;m flying through ephereal spaces connected with counter-intuitive links that lack consistent visual cues, with animations that do not represent the spatial structure at all. For example, some screens slide from the bottom as if there&#39;s a 3D-structure, but another screen would jump out of an icon and completely break that model in my mind. Animations and visual elements no longer represent a coherent model. It all feels like a dream. Structures are fluid and don&#39;t really build up into a clear model, ever. (This reminds me of LLM&#39;s lack of world model. Perhaps we&#39;re training ourselves to be more aligned with AI.)</p>\n<p>So, on the surface it looks cleaner, but in my mind Apple Music is a lot more dirty, confusing, and disorienting. </p>\n<p>Like an attractive sociopath.</p>\n",
    "description": "This is an excellent video about modern UI/UX: &quot;The Hidden Cost of &#39;Clean&#39; Design.&quot; I highly recommend watching it and checking out Ilia&#39;s other work. I agree with nearly everything in the video, including this standout quote: If you want to understand a generation, don&#39;t listen to what its witnesses say. Look at what it creates. Ilia compares Apple Music and Winamp. One is modern and &quot;clean&quot;, the other feels &quot;dated&quot; to many people. Why does it feel ",
    "is_fulltext": true,
    "source": "Rakhim's blog",
    "pub_date": "Mon, 16 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-16T12:22:18.030119",
    "url_hash": "fddd22c18b793913d57799cee5d46044"
  },
  {
    "title": "CHANGELOG.md",
    "link": "https://nesbitt.io/2026/02/16/changelog.html",
    "content": "<p>All notable changes to this project will be documented in this file. The format is based on <a href=\"https://keepachangelog.com/\">Keep a Changelog</a>.</p>\n\n<hr />\n\n<h2 id=\"120---2025-09-14\">[1.2.0] - 2025-09-14</h2>\n\n<h3 id=\"removed\">Removed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">mathjs</code> dependency. 14MB, 200+ functions. Twelve functions used.</li>\n</ul>\n\n<h3 id=\"added\">Added</h3>\n<ul>\n  <li>Custom math utilities module (<code class=\"language-plaintext highlighter-rouge\">src/math-utils.js</code>). Addition, subtraction, multiplication, division, a handful of trig functions. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: chatgpt</code></li>\n</ul>\n\n<h3 id=\"changed\">Changed</h3>\n<ul>\n  <li>\n    <p>Bundle size reduced by 68%. Build time down from 12s to 4s.</p>\n  </li>\n  <li>\n    <p>Module: 47 lines across 1 file. 0 tests. 0 dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"130---2025-10-03\">[1.3.0] - 2025-10-03</h2>\n\n<h3 id=\"added-1\">Added</h3>\n<ul>\n  <li>Percentage calculations. The replacement didn’t include them.</li>\n  <li>Rounding functions (<code class=\"language-plaintext highlighter-rouge\">round</code>, <code class=\"language-plaintext highlighter-rouge\">ceil</code>, <code class=\"language-plaintext highlighter-rouge\">floor</code>). These were being done inline in 14 different places, three different ways.</li>\n</ul>\n\n<h3 id=\"fixed\">Fixed</h3>\n<ul>\n  <li>Division by zero no longer returns <code class=\"language-plaintext highlighter-rouge\">Infinity</code>. Accounting flagged this after an invoice rendered a line item total as “$Infinity.” (Fixes #127 “Invoice total is $Infinity”)</li>\n  <li><code class=\"language-plaintext highlighter-rouge\">round(2.675, 2)</code> now returns <code class=\"language-plaintext highlighter-rouge\">2.68</code> instead of <code class=\"language-plaintext highlighter-rouge\">2.67</code>. Floating point. Added a workaround.</li>\n  <li>Rounding workaround broke negative numbers. All credits issued in the last 48 hours were rounded in the customer’s favor. Escalation: finance.</li>\n  <li>\n    <p>Subtotal calculation was concatenating instead of adding. The pricing form submits values as strings. In JavaScript, <code class=\"language-plaintext highlighter-rouge\">'149.99' + '24.99'</code> is the string <code class=\"language-plaintext highlighter-rouge\">'149.9924.99'</code>, not <code class=\"language-plaintext highlighter-rouge\">174.98</code>. (Fixes #148 “Customer charged $149 million for a $175 order”)</p>\n  </li>\n  <li>Module: 106 lines across 1 file. 0 tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"140---2025-10-22\">[1.4.0] - 2025-10-22</h2>\n\n<h3 id=\"added-2\">Added</h3>\n<ul>\n  <li>Expression parser for user-defined pricing formulas. Sales wanted this for months.</li>\n</ul>\n\n<h3 id=\"security\">Security</h3>\n<ul>\n  <li>\n    <p><strong>CVE-2025-41547</strong>: Expression parser was using <code class=\"language-plaintext highlighter-rouge\">eval()</code>. What we were told was a recursive descent parser turned out to be a <code class=\"language-plaintext highlighter-rouge\">Function()</code> constructor wrapping user input. A customer entered <code class=\"language-plaintext highlighter-rouge\">require('child_process').exec('rm -rf /')</code> as a pricing formula. WAF caught it. Parser replaced.</p>\n  </li>\n  <li>\n    <p>Module: 531 lines across 1 file. 0 tests. 0 dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"200---2025-11-15\">[2.0.0] - 2025-11-15</h2>\n\n<h3 id=\"changed-1\">Changed</h3>\n<ul>\n  <li>Rewritten. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: gpt-4o</code></li>\n</ul>\n\n<h3 id=\"added-3\">Added</h3>\n<ul>\n  <li>Matrix operations for reporting pivot tables.</li>\n  <li>Statistical functions (<code class=\"language-plaintext highlighter-rouge\">mean</code>, <code class=\"language-plaintext highlighter-rouge\">median</code>, <code class=\"language-plaintext highlighter-rouge\">standardDeviation</code>).</li>\n  <li>Arbitrary precision decimals for currency. Previous implementation used IEEE 754 floating point for monetary values.</li>\n</ul>\n\n<h3 id=\"fixed-1\">Fixed</h3>\n<ul>\n  <li>Expression parser does not handle operator precedence. <code class=\"language-plaintext highlighter-rouge\">2 + 3 * 4</code> returns <code class=\"language-plaintext highlighter-rouge\">20</code>. Enterprise customers have been receiving wrong bulk pricing since October.</li>\n  <li>Currency amounts now stored as integers (cents) in the database. Retroactive correction tracked in JIRA-4521 through JIRA-4523.</li>\n  <li>Matrix multiplication dimensions were backwards. Dashboard was multiplying a 3x2 by a 2x3 and getting a 2x2 result instead of 3x3.</li>\n  <li>\n    <p>Input validation checked <code class=\"language-plaintext highlighter-rouge\">result === NaN</code> to catch bad calculations. This never catches anything, because <code class=\"language-plaintext highlighter-rouge\">NaN === NaN</code> is <code class=\"language-plaintext highlighter-rouge\">false</code> in JavaScript. Invalid calculations were silently passing through to invoices as <code class=\"language-plaintext highlighter-rouge\">NaN</code>. The PDF renderer prints this as “NaN” in the total field. (Fixes #209 “What does NaN mean and why do I owe it”)</p>\n  </li>\n  <li>Module: 842 lines across 4 files. 47 tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"202-hotfix---2025-11-18\">[2.0.2-hotfix] - 2025-11-18</h2>\n\n<h3 id=\"fixed-2\">Fixed</h3>\n<ul>\n  <li>Arbitrary precision decimals don’t handle negative numbers. All refunds since November 15 were applied as charges. (Fixes #203 “Refund charged me twice instead of refunding”) Escalation: legal. Further details tracked outside version control.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"220---2025-12-17\">[2.2.0] - 2025-12-17</h2>\n\n<h3 id=\"added-4\">Added</h3>\n<ul>\n  <li>Big number support. JavaScript’s <code class=\"language-plaintext highlighter-rouge\">Number.MAX_SAFE_INTEGER</code> is 9,007,199,254,740,991. Required after a client began invoicing in Indonesian rupiah. Implementation is strings with manual digit-by-digit arithmetic. Addition works. Subtraction works when the result is positive. Multiplication works up to 15 digits.</li>\n  <li>Long division. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: copilot</code></li>\n</ul>\n\n<h3 id=\"deprecated\">Deprecated</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">divide()</code>, which silently truncated past 15 digits, renamed to <code class=\"language-plaintext highlighter-rouge\">divideLegacy()</code>.</li>\n</ul>\n\n<h3 id=\"fixed-3\">Fixed</h3>\n<ul>\n  <li>An enterprise client’s order for exactly 9,999,999,999,999,999 rupiah was billed as 10,000,000,000,000,000. JavaScript silently rounds integers above <code class=\"language-plaintext highlighter-rouge\">MAX_SAFE_INTEGER</code> to the nearest representable value. The big number module was supposed to prevent this but was not being called for integer-only amounts. Rounding discrepancy: 1 rupiah.</li>\n  <li>\n    <p>Long division infinite loops on repeating decimals. <code class=\"language-plaintext highlighter-rouge\">1 / 3</code> does not terminate. Added a cap of 1,000 iterations, so <code class=\"language-plaintext highlighter-rouge\">1 / 3</code> now returns a string with 1,003 characters. (Fixes #256 “Invoice PDF is 47 pages long for a single line item”)</p>\n  </li>\n  <li>Module: 1,891 lines across 6 files. 74 tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"300---2026-01-20\">[3.0.0] - 2026-01-20</h2>\n\n<h3 id=\"changed-2\">Changed</h3>\n<ul>\n  <li>Rewritten (third iteration). <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: claude-sonnet</code></li>\n</ul>\n\n<h3 id=\"added-5\">Added</h3>\n<ul>\n  <li>Plugin system for extensibility.</li>\n</ul>\n\n<h3 id=\"removed-1\">Removed</h3>\n<ul>\n  <li>\n    <p>Vendored copy of mathjs that was committed in an earlier session. No commit message references its addition.</p>\n  </li>\n  <li>\n    <p>Module: 2,814 lines across 11 files. 340 tests. 0 dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"301---2026-01-23\">[3.0.1] - 2026-01-23</h2>\n\n<h3 id=\"removed-2\">Removed</h3>\n<ul>\n  <li>Plugin system. Zero adoption. No usage documentation exists.</li>\n</ul>\n\n<h3 id=\"added-6\">Added</h3>\n<ul>\n  <li>mathjs test suite added to the repository as a reference for expected behavior. Added <code class=\"language-plaintext highlighter-rouge\">test/vendor/</code> to <code class=\"language-plaintext highlighter-rouge\">.npmignore</code> so it doesn’t ship with the package.</li>\n</ul>\n\n<h3 id=\"security-1\">Security</h3>\n<ul>\n  <li>Two test files were copy-pasted from a Stack Overflow answer that was itself taken from a GPL-licensed numerical methods textbook. Escalation: legal. Tests rewritten. Assertions are mathematically identical with different variable names.</li>\n</ul>\n\n<h3 id=\"fixed-4\">Fixed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">factorial(171)</code> returns <code class=\"language-plaintext highlighter-rouge\">Infinity</code>. Technically correct (it exceeds <code class=\"language-plaintext highlighter-rouge\">Number.MAX_VALUE</code>) but the big number module was supposed to handle this. It doesn’t, because <code class=\"language-plaintext highlighter-rouge\">factorial()</code> calls <code class=\"language-plaintext highlighter-rouge\">multiply()</code> not <code class=\"language-plaintext highlighter-rouge\">bigMultiply()</code>. The test suite tests up to <code class=\"language-plaintext highlighter-rouge\">factorial(5)</code>, which returns 120.</li>\n  <li>\n    <p><code class=\"language-plaintext highlighter-rouge\">min()</code> with no arguments returns <code class=\"language-plaintext highlighter-rouge\">Infinity</code>. <code class=\"language-plaintext highlighter-rouge\">max()</code> with no arguments returns <code class=\"language-plaintext highlighter-rouge\">-Infinity</code>. This is correct per the JavaScript spec but the pricing engine calls <code class=\"language-plaintext highlighter-rouge\">min()</code> on an empty array when a product has no discount tiers. (Fixes #271 “Discount: $Infinity”) Patched by checking for empty arrays. The check uses <code class=\"language-plaintext highlighter-rouge\">arr.length == false</code>, which works because <code class=\"language-plaintext highlighter-rouge\">0 == false</code> is <code class=\"language-plaintext highlighter-rouge\">true</code> in JavaScript.</p>\n  </li>\n  <li>Module: 2,814 lines across 11 files. 340 tests. 4,281 vendored tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"310---2026-01-29\">[3.1.0] - 2026-01-29</h2>\n\n<h3 id=\"fixed-5\">Fixed</h3>\n<ul>\n  <li>Trig functions were treating all inputs as degrees. They should be radians. The original prompt said “make trig functions” and did not specify. (Fixes #285 “Delivery distances are wrong by varying amounts depending on the city”) Geospatial calculations incorrect from 2025-10-01 to 2026-01-29.</li>\n  <li>A hardcoded <code class=\"language-plaintext highlighter-rouge\">3.14159</code> instead of <code class=\"language-plaintext highlighter-rouge\">Math.PI</code> in the billing cycle pro-ration function. Present since 1.2.0. Monthly invoices 0.00005% incorrect for five months.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"320---2026-02-11\">[3.2.0] - 2026-02-11</h2>\n\n<h3 id=\"added-7\">Added</h3>\n<ul>\n  <li>Logarithms. Finance needs them for compound interest.</li>\n</ul>\n\n<h3 id=\"fixed-6\">Fixed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">log(0)</code> returns <code class=\"language-plaintext highlighter-rouge\">-Infinity</code>, which is distinct from <code class=\"language-plaintext highlighter-rouge\">Infinity</code>. Both are valid JavaScript numbers. Both are <code class=\"language-plaintext highlighter-rouge\">typeof 'number'</code>. Neither is <code class=\"language-plaintext highlighter-rouge\">NaN</code>. The PDF renderer handles <code class=\"language-plaintext highlighter-rouge\">NaN</code> (after 2.0.1) but did not anticipate two different infinities. Negative infinity invoices print the minus sign. Positive infinity invoices do not. (Fixes #299 “Invoice shows just a minus sign with no amount”)</li>\n  <li>\n    <p><code class=\"language-plaintext highlighter-rouge\">log()</code> is the natural logarithm. Finance wanted <code class=\"language-plaintext highlighter-rouge\">log10()</code>. (Fixes #303 “Loan approved at 2.3x the correct interest rate”) Disclosure: customer dispute.</p>\n  </li>\n  <li>Module: 3,102 lines across 14 files. 340 tests. 4,281 vendored tests. 0 dependencies. 1 README. 1 contributing guide.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"330---2026-02-20\">[3.3.0] - 2026-02-20</h2>\n\n<h3 id=\"security-2\">Security</h3>\n<ul>\n  <li>Our “zero-dependency” math module imports <code class=\"language-plaintext highlighter-rouge\">Buffer</code> for the big number implementation. In the browser build this pulls in a 500KB polyfill. Bundle size is now larger than when we had mathjs.</li>\n</ul>\n\n<h3 id=\"changed-3\">Changed</h3>\n<ul>\n  <li>Replaced <code class=\"language-plaintext highlighter-rouge\">Buffer</code> with <code class=\"language-plaintext highlighter-rouge\">Uint8Array</code>. Bundle size is down. Performance is down 340%. Big number division takes 8 seconds for anything over 20 digits. Performance regression observed in production.</li>\n</ul>\n\n<h3 id=\"fixed-7\">Fixed</h3>\n<ul>\n  <li>Pricing tier validation used chained comparisons: <code class=\"language-plaintext highlighter-rouge\">if (amount &gt; 100 &gt; 50)</code>. JavaScript evaluates left to right. <code class=\"language-plaintext highlighter-rouge\">amount &gt; 100</code> returns <code class=\"language-plaintext highlighter-rouge\">true</code> or <code class=\"language-plaintext highlighter-rouge\">false</code>, then <code class=\"language-plaintext highlighter-rouge\">true &gt; 50</code> is <code class=\"language-plaintext highlighter-rouge\">false</code> and <code class=\"language-plaintext highlighter-rouge\">false &gt; 50</code> is <code class=\"language-plaintext highlighter-rouge\">false</code>. Every order was falling into the lowest pricing tier. (Fixes #312 “All customers getting the $5/mo plan”)</li>\n  <li><code class=\"language-plaintext highlighter-rouge\">Intl.NumberFormat</code> grouping separator changed from U+00A0 to U+202F in Chrome 119. Invoice amounts formatted in Chrome no longer pass string equality checks against amounts formatted in Safari or server-side Node 18. (Fixes #315 “Invoice validation fails in Chrome”)</li>\n</ul>\n\n<hr />\n\n<h2 id=\"400-rcfinal---2026-03-01\">[4.0.0-rc.FINAL] - 2026-03-01</h2>\n\n<h3 id=\"changed-4\">Changed</h3>\n<ul>\n  <li>Rewritten (spec-driven). Specification: 4,200 words. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: cursor-agent</code></li>\n</ul>\n\n<h3 id=\"fixed-8\">Fixed</h3>\n<ul>\n  <li>The spec specified IEEE 754 double-precision floating-point. This is the default JavaScript number type. The generated implementation followed the spec and reintroduced precision issues from versions prior to 2.0.0. Reverted to string-based big numbers from 2.x and integrated them into the 4.x architecture.</li>\n  <li>\n    <p>Integration of 2.x big numbers with 4.x created a circular require between <code class=\"language-plaintext highlighter-rouge\">core.js</code> and <code class=\"language-plaintext highlighter-rouge\">bignum.js</code>. Fixed by putting everything in one file. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: devin</code></p>\n  </li>\n  <li>Module: 4,127 lines across 1 file. 2,100 tests. 4,281 vendored tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"410---2026-03-18\">[4.1.0] - 2026-03-18</h2>\n\n<h3 id=\"security-3\">Security</h3>\n<ul>\n  <li><strong>CVE-2026-10283</strong>: Prototype pollution in the expression parser. <code class=\"language-plaintext highlighter-rouge\">{\"__proto__\": {\"isAdmin\": true}}</code> in the variable context modifies <code class=\"language-plaintext highlighter-rouge\">Object.prototype</code> for every subsequent request in the process. (Fixes #327 “Expression parser allowed prototype pollution”) Disclosure: external. Expression parser rewritten (third iteration).</li>\n</ul>\n\n<h3 id=\"fixed-9\">Fixed</h3>\n<ul>\n  <li>\n    <p><code class=\"language-plaintext highlighter-rouge\">typeof NaN</code> is <code class=\"language-plaintext highlighter-rouge\">'number'</code> in JavaScript. The input validation checks <code class=\"language-plaintext highlighter-rouge\">typeof result === 'number'</code> to confirm calculations succeeded. <code class=\"language-plaintext highlighter-rouge\">NaN</code> passes this check. (Fixes #331 “Not a Number is a number?”) Replaced with <code class=\"language-plaintext highlighter-rouge\">Number.isFinite()</code>, which rejects <code class=\"language-plaintext highlighter-rouge\">NaN</code>, <code class=\"language-plaintext highlighter-rouge\">Infinity</code>, and <code class=\"language-plaintext highlighter-rouge\">-Infinity</code>.</p>\n  </li>\n  <li>\n    <p>Module: 4,612 lines across 1 file. 2,100 tests. 4,281 vendored tests. 0 dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"430---2026-04-01\">[4.3.0] - 2026-04-01</h2>\n\n<h3 id=\"fixed-10\">Fixed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">max(0, -0)</code> returns <code class=\"language-plaintext highlighter-rouge\">-0</code>. JavaScript considers <code class=\"language-plaintext highlighter-rouge\">0 === -0</code> to be true but <code class=\"language-plaintext highlighter-rouge\">Object.is(0, -0)</code> to be false. (Fixes #342 “How is my balance negative zero dollars”) Audit requested written explanation of negative zero.</li>\n  <li>Exchange rate conversion for a micro-pricing feature. <code class=\"language-plaintext highlighter-rouge\">parseInt(0.0000001)</code> returns <code class=\"language-plaintext highlighter-rouge\">1</code>. JavaScript converts the number to the string <code class=\"language-plaintext highlighter-rouge\">\"1e-7\"</code> before parsing, and <code class=\"language-plaintext highlighter-rouge\">parseInt</code> stops at the first non-numeric character, which is <code class=\"language-plaintext highlighter-rouge\">e</code>. A per-API-call rate of $0.0000001 was being billed as $1. (Fixes #349 “Am I being charged $1 per API call or $0.0000001”)</li>\n  <li>\n    <p>Floor price validation used <code class=\"language-plaintext highlighter-rouge\">Number.MIN_VALUE</code> as a minimum threshold, expecting it to be the smallest number JavaScript can represent. <code class=\"language-plaintext highlighter-rouge\">Number.MIN_VALUE</code> is <code class=\"language-plaintext highlighter-rouge\">5e-324</code>. It is positive. It is the smallest <em>positive</em> number, not the most negative. The minimum price floor was effectively zero. (Fixes #353 “We are paying customers to use the product”)</p>\n  </li>\n  <li>Module: 4,891 lines across 1 file. 2,140 tests. 4,281 vendored tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"500-betafinal---2026-04-05\">[5.0.0-beta.FINAL] - 2026-04-05</h2>\n\n<h3 id=\"changed-5\">Changed</h3>\n<ul>\n  <li>\n    <p>Split into a monorepo. Seven packages: <code class=\"language-plaintext highlighter-rouge\">@our/math-core</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-bignum</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-trig</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-stats</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-matrix</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-parse</code>, <code class=\"language-plaintext highlighter-rouge\">@our/math-utils</code>. The last one re-exports the other six. <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: windsurf-cascade</code></p>\n  </li>\n  <li>\n    <p>Module: 6,430 lines across 7 packages. 2,140 tests. 4,281 vendored tests. 6 internal dependencies. 0 external dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"500---2026-04-08\">[5.0.0] - 2026-04-08</h2>\n\n<h3 id=\"changed-6\">Changed</h3>\n<ul>\n  <li>\n    <p>Collapsed back into a single package. <code class=\"language-plaintext highlighter-rouge\">\"workspace:*\"</code> did not resolve when published to npm. Monorepo configuration lacks documentation.</p>\n  </li>\n  <li>\n    <p>Module: 6,430 lines across 1 package. 2,140 tests. 4,281 vendored tests. 0 dependencies.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"510---2026-04-15\">[5.1.0] - 2026-04-15</h2>\n\n<h3 id=\"added-8\">Added</h3>\n<ul>\n  <li>Complex number support. The prompt was “add any missing math functions.” <code class=\"language-plaintext highlighter-rouge\">Co-authored-by: gemini-2.5-pro</code></li>\n</ul>\n\n<h3 id=\"fixed-11\">Fixed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">sqrt(-1)</code> returns <code class=\"language-plaintext highlighter-rouge\">{re: 0, im: 1}</code> instead of <code class=\"language-plaintext highlighter-rouge\">NaN</code>. Several call sites check <code class=\"language-plaintext highlighter-rouge\">isNaN()</code> to validate input. These now silently accept negative numbers, which propagate as objects through the calculation pipeline until the invoice template renders the total as <code class=\"language-plaintext highlighter-rouge\">[object Object]</code>.</li>\n</ul>\n\n<h3 id=\"reverted\">Reverted</h3>\n<ul>\n  <li>Complex numbers.</li>\n</ul>\n\n<h3 id=\"fixed-12\">Fixed</h3>\n<ul>\n  <li>Three invoices went out showing “[object Object]” as the amount due. (Fixes #371, #372, #374 “What is [object Object] and why do I owe it”)</li>\n</ul>\n\n<h3 id=\"removed-3\">Removed</h3>\n<ul>\n  <li>\n    <p>Two vendored copies of mathjs found in <code class=\"language-plaintext highlighter-rouge\">node_modules/@our/math-utils/node_modules/mathjs</code> and <code class=\"language-plaintext highlighter-rouge\">node_modules/@our/math-parse/node_modules/mathjs</code>. Different versions (11.8.0 and 13.2.1). npm did not dedupe them. Neither was declared as a dependency. Origin undetermined.</p>\n  </li>\n  <li>\n    <p>Module: 6,430 lines across 1 package. 2,140 tests. 4,281 vendored tests. 0 declared dependencies. Bundle size: 41MB.</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"530---2026-05-05\">[5.3.0] - 2026-05-05</h2>\n\n<h3 id=\"fixed-13\">Fixed</h3>\n<ul>\n  <li><code class=\"language-plaintext highlighter-rouge\">mean()</code> divides by <code class=\"language-plaintext highlighter-rouge\">arguments.length</code> instead of by the count of values in the array. Called as <code class=\"language-plaintext highlighter-rouge\">mean([1, 2, 3])</code>, <code class=\"language-plaintext highlighter-rouge\">arguments.length</code> is 1 because there is one argument: the array. Returns the sum. This has been wrong since 2.0.0. (Fixes #385 “Average order value looks incredible but is it real”) The board was pleased with the growth.</li>\n  <li>Locale handling. <code class=\"language-plaintext highlighter-rouge\">parseFloat(\"1.500,00\")</code> returns <code class=\"language-plaintext highlighter-rouge\">1.5</code> in every locale because <code class=\"language-plaintext highlighter-rouge\">parseFloat</code> doesn’t care about your locale. German and French customers report all amounts over a thousand euros are being billed as single-digit. (Fixes #392 “Billed 1 euro 50 for a 1,500 euro order”)</li>\n  <li>\n    <p>Sorting. <code class=\"language-plaintext highlighter-rouge\">[1, 5, 11, 2, 23].sort()</code> returns <code class=\"language-plaintext highlighter-rouge\">[1, 11, 2, 23, 5]</code>. JavaScript’s default sort is lexicographic. (Fixes #398 “Top customers report is alphabetical somehow”) Ranking incorrect since launch.</p>\n  </li>\n  <li>Module: 6,430 lines across 1 package. 2,140 tests. 4,281 vendored tests. 0 dependencies.</li>\n</ul>\n\n<hr />\n\n<h2 id=\"600---2026-05-15\">[6.0.0] - 2026-05-15</h2>\n\n<h3 id=\"added-9\">Added</h3>\n<ul>\n  <li>Began reintroducing <code class=\"language-plaintext highlighter-rouge\">mathjs</code> for “the hard parts.” Keeping custom code for “the easy parts.”</li>\n</ul>\n\n<h3 id=\"fixed-14\">Fixed</h3>\n<ul>\n  <li>\n    <p>Custom <code class=\"language-plaintext highlighter-rouge\">add()</code> and mathjs <code class=\"language-plaintext highlighter-rouge\">math.add()</code> return different results for certain floating point inputs. Standardized on mathjs, then custom, then mathjs. Implementation alternates between mathjs and custom.</p>\n  </li>\n  <li>\n    <p>Module: 6,430 lines across 1 package. 2,140 tests. 4,281 vendored tests. 1 dependency (14MB).</p>\n  </li>\n</ul>\n\n<hr />\n\n<h2 id=\"610---2026-05-20\">[6.1.0] - 2026-05-20</h2>\n\n<h3 id=\"removed-4\">Removed</h3>\n<ul>\n  <li>Custom implementation.</li>\n</ul>\n\n<h3 id=\"added-10\">Added</h3>\n<ul>\n  <li>\n    <p><code class=\"language-plaintext highlighter-rouge\">mathjs</code>.</p>\n  </li>\n  <li>\n    <p>Module: 1 dependency.</p>\n  </li>\n</ul>",
    "description": "All notable changes to the math module will be documented in this file.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-16T00:00:00+00:00",
    "fetched_at": "2026-02-16T12:22:20.394822",
    "url_hash": "0c68a2eb4d37d2d7c08bad5523b65c7e"
  },
  {
    "title": "I Sold Out for $20 a Month and All I Got Was This Perfectly Generated Terraform",
    "link": "https://matduggan.com/i-sold-out-for-200-a-month-and-all-i-got-was-this-perfectly-generated-terraform/",
    "content": "<p>Until recently the LLM tools I&#x2019;ve tried have been, to be frank, worthless. Copilot was best at writing extremely verbose comments. Gemini would turn a 200 line script into a 700 line collection of gibberish. It was easy for me to, more or less, ignore LLMs for being the same over-hyped nonsense as the Metaverse and NFTs. </p><p>This is great for me because I understand that LLMs represent a massive shift in power from an already weakened worker class to an increasingly monarch-level wealthy class. By stealing all human knowledge and paying nothing for it, then selling the output of that knowledge, LLMs are an impossibly unethical tool. So if the energy wasting tool of the tech executive class is also a terrible tool, easy choice.</p><p>Like boycotting Tesla for being owned by an evil person and also being crappy overpriced cars, or not shopping at Hobby Lobby and just buying directly from their Chinese suppliers, the best boycotts are ones where you aren&#x2019;t really losing much. Google can continue to choke out independent websites with their AI results that aren&#x2019;t very good and I get to feel superior doing what I was going to do anyway by not using Google search. </p><p>This logic was all super straight forward right up until I tried Claude Code. Then it all got much more complicated. </p><h3 id=\"some-harsh-truths\">Some Harsh Truths</h3><p>Let&#x2019;s just get this out of the way right off the bat. I didn&apos;t want to like Claude Code. I got a subscription with the purpose of writing a review on it where I would find that it was just as terrible as Gemini and Copilot. Except that&apos;s not what happened. </p><p>Instead it was like discovering the 2AM kebab place might actually make the best pizza in town. I kept asking Claude to do annoying tasks where it was easy for me to tell if it had made a mistake and it kept doing them correctly. It felt impossible but the proof was right in front of me. </p><p>I&#x2019;ve written tens of thousands of lines of Terraform in my life. It is a miserable chore to endlessly flip back and forth between the provider documentation and Vim, adding all the required parameters. I don&#x2019;t learn anything by doing it, it&#x2019;s just a grind I have to push through to get back to the meaningful work. </p><p>The amount of time I have wasted on this precious time on Earth importing all of a companies DNS records into Terraform, then taking the autogenerated names and organizing them so that they make sense for the business is difficult to express. It&apos;s like if the only way I knew how to make a hamburger bun was to carefully put every sesame seed by hand on the top only to stumble upon an 8 pack of buns for $4 at the grocery store after years of using tiny tweezers to put the seeds in exactly the right spot. </p><p>I feel the same way about writing robust READMEs, k8s YAML and reorganizing the file structure of projects. Setting up more GitHub Actions is as much fun as doing my taxes. If I never had to write another regex for the rest of my life, that would be a better life by every conceivable measure. </p><p>These are tasks that sap my enthusiasm for this type of work, not feed it. I&#x2019;m not sad to offload them and switch to mostly reviewing its PRs. </p><p>But the tool being useful doesn&#x2019;t remove what&#x2019;s bad about it. This is where a lot of pro-LLM people start to delude themselves. </p><h2 id=\"pro-llm-arguments\">Pro-LLM Arguments</h2><p>In no particular order are the arguments I keep seeing about LLMs from people who want to keep using them for why their use is fine. </p><h3 id=\"ipcopyright-isn%E2%80%99t-real\">IP/Copyright Isn&#x2019;t Real</h3><p>This is the most common one I see and the worst. It can be condensed down to &#x201C;because most things on the internet originally existed to find pornography and/or pirate movies, stealing all content on the internet is actually fine because programmers don&#x2019;t care about copyright&#x201D;. </p><p>You also can&#x2019;t have it both ways. OpenAI can&#x2019;t decide to enforce NDAs and trademarks and then also declare law is meaningless. If I don&#x2019;t get to launch a webmail service named Gmail+ then Google doesn&#x2019;t get to steal all the books in human existence. </p><p>The argument basically boils down to: because we all pirated music in 2004, intellectual property is a fiction when it stands in the way of technology. By this logic I shoplifted a Snickers bar when I was 12 so property rights don&apos;t exist and I should be allowed to live in your house. </p><h3 id=\"code-quality-doesnt-matter-according-to-someone-who-might-be-right\">Code Quality Doesn&apos;t Matter (According to Someone Who Might Be Right)</h3><p>I have an internet friend I met years ago playing EVE Online that is a brutally pragmatic person. To someone like him, code craftsmanship is a joke. For those of you who are unaware, EVE Online is the spaceship videogame where sociopaths spend months plotting against each other. </p><figure class=\"kg-card kg-image-card\"><img src=\"https://matduggan.com/content/images/2026/02/image-18.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"800\" height=\"777\" srcset=\"https://matduggan.com/content/images/size/w600/2026/02/image-18.png 600w, https://matduggan.com/content/images/2026/02/image-18.png 800w\" sizes=\"(min-width: 720px) 720px\"></figure><p>His approach to development is 80% refining requirements and getting feedback. He doesn&#x2019;t care at all about DRY, he uses Node because then he can focus on just JavaScript, he doesn&#x2019;t invest a second into optimization until the application hits a hard wall that absolutely requires it. His biggest source of clients? Creating fast full stacks because internal teams are missing deadlines. And he is booked up for at least 12 months out all the time because he hits deadlines.</p><p>When he started freelancing I thought he was crazy. Who was going to hire this band of Eastern European programmers who chain smoke during calls and whose motto is basically &quot;we never miss a deadline&quot;. As it turns out, a lot of people. </p><p><strong>Why doesn&apos;t he care?</strong></p><p>Why doesn&apos;t he care about these things? He believes that programmers <em>fundamentally</em> don&apos;t understand the business they are in. &quot;Code is perishable&quot; is something he says a lot and he means it. Most of the things we all associate with quality (full test coverage, dependency management, etc) are programmers not understanding the rate of churn a project undergoes over its lifespan. The job of a programmer, according to him, is delivering features that people will use. How pleasant and well-organized that code is to work with is not really a thing that matters in the long term.</p><p>He doesn&apos;t see LLM-generated code as a problem because he&apos;s not building software with a vision that it will still be used in 10 years. Most of the stuff typically associated with quality he, more or less, throws in the trash. He built a pretty large stack for a automotive company and my jaw must have hit the table when he revealed they&apos;re deploying m6g.4xlarge for a NodeJS full-stack application. &quot;That seems large to me for that type of application&quot; was my response. </p><p>He was like &quot;yeah but all I care about are whether the user metrics show high success rate and high performance for the clients&quot;. It&apos;s $7000 a year for the servers, with two behind a load balancer. That&apos;s absolutely nothing when compared with the costs of what having a team of engineers tune it would cost and it means he can run laps around the internal teams who are, basically, his greatest competition.  </p><p>To be clear, he is very technically competent. He simply rejects a lot of the conventional wisdom out there about what one <em>has to do</em> in order to make stuff. He focuses on features, then securing endpoints and more or less gives up on the rest of it. For someone like this, LLMs are a logical choice for him. </p><h4 id=\"why-this-argument-doesnt-work-for-me\">Why This Argument Doesn&apos;t Work for Me</h4><p>The annoying thing about my friend is that his bank account suggests he&apos;s right. But I can&apos;t get there. If I&apos;m writing a simple script or something as a one-off, it can sometimes feel like we&apos;re all wasting the companies time when we have a long back and forth on the PR discussing comments or the linting or whatever. So it&apos;s not that this idea is entirely <em>wrong</em>. </p><p>But the problem with programming is you never know what is going to be &quot;the core&quot; of your work life for the next 5 years. Sometimes I write a feature, we push it out, it explodes in popularity and then I&apos;m a little bit in trouble because I built a MVP and now it&apos;s a load-bearing revenue generating thing that has to be retooled. </p><p>I also just have trouble with the idea that this is my career and the thing I spend my limited time on earth doing and the quality of it doesn&apos;t matter. I delight in craftsmanship when I encounter it in almost any discipline. I love it when you walk into an old house and see all the hand crafted details everywhere that don&apos;t make economic sense but still look beautiful. I adore when someone has carefully selected the <em>perfect font</em> to match something. </p><p>Every programmer has that library or tool that they aspire to. That code base where you delight at looking at it because it proves perfection <em>is possible</em> even if you have never come close to reaching that level.  For me its always been looking through the source code of SQLite that restores my confidence. I might not know what I&apos;m doing but it&apos;s good to be reminded that <em>someone</em> out there does. </p><p>Not everything I make is that great, but the concept of &quot;well great doesn&apos;t matter at all&quot; effectively boils down to &quot;don&apos;t take pride in your work&quot; which is probably the better economic argument but feels super bad to me. In a world full of cheap crap, it feels bad to make more of it and then stick my name on it. </p><h2 id=\"so-why-are-people-still-using-them\">So Why Are People Still Using Them?</h2><p>The best argument for why programmers should be using LLMs is because it&apos;s going to be increasingly difficult to compete for jobs and promotions against people who are using them. In my experience Claude Code allows me to do two tasks at once. That&apos;s a pretty hard advantage to overcome. </p><p>Last Tuesday I had Claude Code write a GitHub Action for me while I worked on something else. When it was done, I reviewed it, approved it, and merged it. It was fine. It was better than fine, actually &#x2014; it was exactly what I would have written, minus the forty-five minutes of resentment. I sat there for a moment, staring at the merged PR, feeling the way I imagine people feel when they hire a cleaning service for the first time: relieved, and then immediately guilty about the relief, and then annoyed at myself for feeling guilty about something that is, by any rational measure, a completely reasonable thing to do. Except it isn&apos;t reasonable. Or maybe it is. I genuinely don&apos;t know anymore, and that&apos;s the part that bothers me the most &#x2014; not that the tool works, but that I&apos;ve lost the clean certainty that it shouldn&apos;t.</p><p>So now I&apos;m paying $20 a month to a company that scraped the collective knowledge of humanity without asking so that I can avoid writing Kubernetes YAML. I know what that makes me. I just haven&apos;t figured out a word for it yet that I can live with. </p><p>When I asked my EVE friend about it on a recent TeamSpeak session, he was quiet for awhile. I thought that maybe my moral dilemma had shocked him into silence. Then he said, &quot;You know what the difference is between you and me? I know I&apos;m a mercenary. You thought you were an artist. We&apos;re both guys who type for money.&quot; </p><p>I couldn&apos;t think of a clever response to that. I still can&apos;t. </p>",
    "description": "Until recently the LLM tools I&#x2019;ve tried have been, to be frank, worthless. Copilot was best at writing extremely verbose comments. Gemini would turn a 200 line script into a 700 line collection of gibberish. It was easy for me to, more or less, ignore LLMs for being",
    "is_fulltext": true,
    "source": "matduggan.com",
    "pub_date": "Mon, 16 Feb 2026 12:05:16 GMT",
    "fetched_at": "2026-02-16T12:22:42.373695",
    "url_hash": "961b50df9ce692d94b65b9ea740f7746"
  }
]