[
  {
    "title": "Red/green TDD",
    "link": "https://simonwillison.net/guides/agentic-engineering-patterns/red-green-tdd/#atom-everything",
    "content": "\n    <p><em><a href=\"https://simonwillison.net/guides/agentic-engineering-patterns/\">Agentic Engineering Patterns</a> &gt;</em></p>\n    <p>\"<strong>Use red/green TDD</strong>\" is a pleasingly succinct way to get better results out of a coding agent.</p>\n<p>TDD stands for Test Driven Development. It's a programming style where you ensure every piece of code you write is accompanied by automated tests that demonstrate the code works.</p>\n<p>The most disciplined form of TDD is test-first development. You write the automated tests first, confirm that they fail, then iterate on the implementation until the tests pass.</p>\n<p>This turns out to be a <em>fantastic</em> fit for coding agents. A significant risk with coding agents is that they might write code that doesn't work, or build code that is unnecessary and never gets used, or both.</p>\n<p>Test-first development helps protect against both of these common mistakes, and also ensures a robust automated test suite that protects against future regressions. As projects grow the chance that a new change might break an existing feature grows with them. A comprehensive test suite is by far the most effective way to keep those features working.</p>\n<p>It's important to confirm that the tests fail before implementing the code to make them pass. If you skip that step you risk building a test that passes already, hence failing to exercise and confirm your new implementation.</p>\n<p>That's what \"red/green\" means: the red phase watches the tests fail, then the green phase confirms that they now pass.</p>\n<p>Every good model understands \"red/green TDD\" as a shorthand for the much longer \"use test driven development, write the tests first, confirm that the tests fail before you implement the change that gets them to pass\".</p>\n<p>Example prompt:</p>\n<blockquote>\n<p>Build a Python function to extract headers from a markdown string. Use red/green TDD.</p>\n</blockquote>\n<p>Here's what I got <a href=\"https://claude.ai/share/2b9b952a-149b-4864-afb0-46f59b90b458\">from Claude</a> and <a href=\"https://chatgpt.com/share/699beb6f-adc8-8006-a706-6bbfdcdca538\">from ChatGPT</a>. Normally I would use a coding agent like Claude Code or OpenAI Codex, but this example is simple enough that both Claude and ChatGPT can implement it using their default code environments.</p>\n<p>I did have to append \"Use your code environment\" to the ChatGPT prompt. When I tried without that it wrote the code and tests without actually executing them.</p>\n    \n        <p>Tags: <a href=\"https://simonwillison.net/tags/testing\">testing</a>, <a href=\"https://simonwillison.net/tags/tdd\">tdd</a>, <a href=\"https://simonwillison.net/tags/coding-agents\">coding-agents</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a></p>\n    \n\n",
    "description": "Agentic Engineering Patterns &gt; \"Use red/green TDD\" is a pleasingly succinct way to get better results out of a coding agent. TDD stands for Test Driven Development. It's a programming style where you ensure every piece of code you write is accompanied by automated tests that demonstrate the code works. The most disciplined form of TDD is test-first development. You write the automated tests first, confirm that they fail, then iterate on the implementation until the tests pass. This turns out ",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-23T07:12:28+00:00",
    "fetched_at": "2026-02-23T12:22:47.316307",
    "url_hash": "123d07a181e294fffa4272caa676cdca"
  },
  {
    "title": "Insider amnesia",
    "link": "https://seangoedecke.com/insider-amnesia/",
    "content": "<p>Speculation about what’s really going on inside a tech company is almost always wrong. </p>\n<p>When some problem with your company is posted on the internet, and you read people’s thoughts on it, their thoughts are almost always ridiculous. For instance, they might blame product managers for a particular decision, when in fact the decision in question was engineering-driven and the product org was pushing back on it. Or they might attribute an incident to overuse of AI, when the system in question was largely written pre-AI-coding and unedited since. You just don’t know what the problem is unless you’re on the inside.</p>\n<p>But when some <em>other</em> company has a problem on the internet, it’s very tempting to jump in with your own explanations. After all, you’ve seen similar things in your own career. How different can it really be? Very different, as it turns out.</p>\n<p>This is especially true for companies that are unusually big or small. The recent <a href=\"https://news.ycombinator.com/item?id=46064571\">kerfuffle</a> over some bad GitHub Actions code is a good example of this - many people just seemed to have no mental model about how a large tech company can produce bad code, because their mental model of writing code is something like “individual engineer maintaining an open-source project for ten years”, or “tiny team of experts who all swarm on the same problem”, or something else that has very little to do with how large tech companies produce software<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup>. I’m sure the same thing happens when big-tech or medium-tech people give opinions about how tiny startups work.</p>\n<p>The obvious reference here is to <a href=\"https://en.wikipedia.org/wiki/Michael_Crichton#Gell-Mann_amnesia_effect\">“Gell-Mann amnesia”</a>, which is about the general pattern of experts correctly disregarding bad sources in their fields of expertise, but trusting those same sources on other topics. But I’ve taken to calling this “insider amnesia” to myself, because it applies even to experts who are writing in their own areas of expertise - it’s simply the fact that they’re <em>outsiders</em> that’s causing them to stumble.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>I wrote about this at length in <a href=\"/bad-code-at-big-companies\"><em>How good engineers write bad code at big companies</em></a></p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>",
    "description": "",
    "is_fulltext": true,
    "source": "seangoedecke.com RSS feed",
    "pub_date": "Mon, 23 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-23T12:22:48.367187",
    "url_hash": "173bb3175fae8e650ccd6d9dee66fbb0"
  },
  {
    "title": "The Little Red Dot",
    "link": "https://idiallo.com/blog/little-red-dot?src=feed",
    "content": "\n\t\t\t\t\t\n\t\t\t<p>Sometimes, I have 50 tabs open. Looking for a single piece of information ends up being a rapid click on each tab until I find what I'm looking for. Somehow, every time I get to that LinkedIn tab, I pause for a second. I just have to click on the little red dot in the top right corner, see that there is nothing new, then resume my clicking. Why is that? Why can't I ignore the red notification badge?</p>\n\t\t\t<p>When you sign up for LinkedIn for the first time, it's right there. A little red dot in the top right corner with a number in it. It stands out against the muted grays and blues of the interface. Click on it, and you'll discover you have a notification. It's not from someone you know; this is a fresh new account, after all. But the dot was there anyway.</p>\n\n<p>Add a few connections, give it some time, and come back. Refresh the page, and you'll have new notifications waiting.</p>\n\n<p>If your LinkedIn account is like mine, a ghost town, you still get the little red dot. My connections and I usually keep a few recruiters in our networks, an insurance policy in case we need to find work quickly. But we rarely, if ever, post anything. Yet whenever I log in, there's a new notification. Sometimes it's even a message, but not from anyone in my connections list. It's from LinkedIn itself.</p>\n\n<p>The little red dot isn't exclusive to LinkedIn. My Facebook account has been dormant for years, yet those few times annually when I log in, the notifications are right there waiting for me. I've even visited news websites where the little red dot appeared for reasons I couldn't understand. I didn't have an account, so what exactly were they notifying me about?</p>\n\n<div class=\"image\">\n    <img src=\"https://cdn.idiallo.com/images/assets/622/dot.svg\" alt=\"Notification\" />\n</div>\n\n<p>That little red dot is a sophisticated psychological trigger designed to exploit the brain. It activates the brain's <a href=\"https://en.wikipedia.org/wiki/Salience_network\">Salience Network</a>. Think of it as a circuit breaker that alerts us to immediate threats. When triggered, it signals that the brain should redirect its resources to something new.</p>\n\n<p>The color red is not chosen by accident either. On my Twitter app, the notification is a blue dot, which I hardly ever notice (don't tell them that). But red triggers our brain to perceive urgency. We feel compelled to address it immediately.</p>\n\n<p>The little red dot fools us into believing that something trivial is actually urgent. Check your phone and you'll notice all the app icons with a little red dot in their top right corner. Most, if not all, social media alerts function as false alarms, and they gradually compromise our ability to focus on what matters.</p>\n\n<p>Whenever you spot the little red dot, you feel compelled to click it. It promises a new connection, a message, a validation of some sort. It doesn't matter that you are almost always disappointed afterward, because you will be presented with content that keeps you scrolling, never remembering how you got there.</p>\n\n<p>Facebook used to show the little red dot in their email notifications. When there is activity on your account, say you were tagged in a photo, Facebook sends you an email and in the top right corner, they draw a little red dot on the bell icon. Obviously, you have to click it so you don't miss out.</p>\n\n<p>There was a Netflix documentary released a few years ago called <a href=\"https://en.wikipedia.org/wiki/The_Social_Dilemma\"><em>The Social Dilemma</em></a>, an inside look at how social media manipulates its users. Whether intentional or not, their website featured a bell icon with a little red dot on it. You visit the site for the first time, and it shows that you have one notification. There's no way around it, you are psychologically enticed to click.</p>\n\n<div class=\"image\">\n    <img src=\"https://cdn.idiallo.com/images/assets/622/dilemma.jpg\" alt=\"Social Dilemma Bell\" />\n</div>\n\n<p>A notification is supposed to be a tool, and a tool patiently waits for someone to use it. But the little red dot seduces you because it wants something from you. It's all part of habit-forming technology: the engagement loop.</p>\n\n<p>The engagement loop follows three steps: a cue (the notification), a routine (an action such as scrolling), and a reward (likes, a dopamine hit). From the social media platform's perspective, this is a tool for boosting retention. From the user's perspective, it's Pavlovian conditioning.</p>\n\n<p>For every possible event, LinkedIn will send you a notification. Someone wants to join your network. Someone has endorsed your skills. A group is discussing a topic. Each notification generates a red dot on your mobile device, pulling you back into actions that benefit LinkedIn's system.</p>\n\n<p>In the documentary, they show that this pattern is just the tip of the iceberg. Beneath the surface lies a data-driven, manipulative machine that feeds on our behavior and engineers the next trick to bring us back to the platform.</p>\n\n<p>For my part, I've disabled notifications from all non-essential apps. No Instagram updates, no Robinhood alerts, no WhatsApp group messages. I receive messages from people I know. That's pretty much it. For everything else, I have to deliberately seek out information.</p>\n\n<p>That said, I did see another approach in the wild. Some people simply don't care about notifications. Every app on their phone has a little red dot with the number \"99\" on it. They haven't read their messages and aren't planning to. You're lucky if they ever answer your call. I'm not sure whether this is a good or bad thing... but it's a thing.</p>\n\n<hr />\n\n<p>That little red dot represents something larger than a notification system. It's the visible tip of an infrastructure built to capture and commodify human attention. The addictiveness of social media isn't an unfortunate byproduct of connecting the world. Right now it's the most profitable business model.</p>\n\n<p>The more addictive the platform, the more you engage; the more you engage, the more advertisements you see. This addiction shapes behavior, consumes time, and affects mental wellbeing, all while companies profit from it.</p>\n\t\t\t\n\t\t\t\t",
    "description": "Sometimes, I have 50 tabs open. Looking for a single piece of information ends up being a rapid click on each tab until I find what I'm looking for. Somehow, every time I get to that LinkedIn tab, I pause for a second. I just have to click on the little red dot in the top right corner, see that there is nothing new, then resume my clicking. Why is that? Why can't I ignore the red notification badge? When you sign up for LinkedIn for the first time, it's right there. A little red dot in the top r",
    "is_fulltext": true,
    "source": "iDiallo.com",
    "pub_date": "Mon, 23 Feb 2026 12:00:00 GMT",
    "fetched_at": "2026-02-23T12:22:52.355138",
    "url_hash": "48f48ac34bcf6e51ecd2beaf65717da4"
  },
  {
    "title": "Pluralistic: Deplatform yourself (23 Feb 2026)",
    "link": "https://pluralistic.net/2026/02/23/goodharts-lawbreaker/",
    "content": "<p><!--\nTags:\nryan broderick, garbage day, copyright infringement, web theory, disenshittification, blogging, bohemianism,people's joker, nirvanna, iron lung, unmonetizable content, become unoptimizable,\n\nSummary:\nDeplatform yourself; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/23/goodharts-lawbreaker/\n\nTitle:\nPluralistic: Deplatform yourself (23 Feb 2026) goodharts-lawbreaker\n\nBullet:\n&#x1fa9a;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/\"><img data-recalc-dims=\"1\" decoding=\"async\" class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/23Feb2026.jpg?w=840&#038;ssl=1\"/></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#no-metrics-no-targets\">Deplatform yourself</a>: Copyright infringement is your least entertainment dollar.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#retro\">Object permanence</a>: \"Lawer\" threatens suit; Landmark metaphotos; 3DP v (c); Forced arbitration; Imperial Scott Walker; Keysigning ritual; Polyfingered robot dictaphone; DNS bug; Register of copyright damns term extension; How Anonymous decides; Christchurch quake people-finder; Minor HP disenshittification; US v developing world at WIPO; TfL v anagram tube-map; Disneyland waiting; Internet of Garbage.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#latest\">Latest books</a>: You keep readin' em, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#upcoming-books\">Upcoming books</a>: Like I said, I'll keep writin' 'em.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#bragsheet\">Colophon</a>: All the rest.\n</li>\n</ul>\n<p><span id=\"more-12458\"></span></p>\n<hr/>\n<p><a name=\"no-metrics-no-targets\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"The Muse Thalia, pictured brandishing a comedy mask and putting a laurel wreath on a bust of a bearded figure. It has been altered. The bust has an extra set of eyes and ears. Thalia has two extra sets of arms, one ending in lion's paws, the other in lobster's claws. She has one cyclopean eye. Her comedy mask is now a tragedy mask. The image has been tinted blue.\" src=\"https://i0.wp.com/craphound.com/images/woo-muse-odd.jpg?w=840&#038;ssl=1\"/></p>\n<h1>Deplatform yourself (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#no-metrics-no-targets\">permalink</a>)</h1>\n<p>The first time I met William Gibson &#8211; to interview him for the <em>Globe and Mail</em> on the release of 1999's <em>All Tomorrow's Parties</em> &#8211; there was one question I knew I wanted to ask him: \"What happens to the counterculture in the era of instantaneous commodification?\"</p>\n<p><a href=\"https://craphound.com/nonfic/transcript.html\">https://craphound.com/nonfic/transcript.html</a></p>\n<p>Gibson's answer stuck with me for decades:</p>\n<blockquote><p>\n  What we're doing pop culturally is like burning the rain forest. The biodiversity of pop culture is really, really in danger. I didn't see it coming until a few years ago, but looking back it's very apparent.</p>\n<p>  I watched a sort of primitive form of the recommodification machine around my friends and myself in the sixties, and it took about two years for this clumsy mechanism to get and try to sell us The Monkees.</p>\n<p>  In 1977, it took about eight months for a slightly faster more refined mechanism to put punk in the window of Holt Renfrew. It's gotten faster ever since. The scene in Seattle that Nirvana came from: as soon as it had a label, it was on the runways of Paris.</p>\n<p>  There's no grace period, so that's a way in which I see us losing the interstitial.\n</p></blockquote>\n<p>This may seem like an odd thing to think about, but nearly all the art and culture that means something to me started as something that was transgressive and weird, and even if it was eventually metabolized by the mainstream, that was only after it had a chance to ferment and mutate in a tide-pool of Bohemian weirdness.</p>\n<p>All this century, I've asked friends and weirdos about what can resist this commodification and co-option. Scott Westerfeld &#8211; author of <em>Uglies</em> &#8211; had a very on-brand answer: he told me that he thought that teenagers might deliberately start cultivating acne as a badge of rebellion. That hasn't happened yet, but if it does, it will be born co-opted, because there's already a luxury brand called \"Acne\":</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Acne_Studios\">https://en.wikipedia.org/wiki/Acne_Studios</a></p>\n<p>One anti-commodification measure that's worked reasonably well over the years is to be <em>ugly</em>. Punk zines and early Myspace pages embraced an aesthetic that the existing cohort of trained designers available to work for would-be co-opters would rather break their fingers than imitate. Eventually, some punk zinesters and Myspacers <em>became</em> freelance designers and offered the aesthetic for sale, but after the \"grace period\" that Gibson was worried about in 1999. By contrast, after a brief period in which early AI image-gen snuck psychedelic fish-dogs into every output, AI became so mid and inoffensive that even when it was used to make transgressive images (Trump spraying protesters with liquid shit from an airplane), it looked incredibly, terminally <em>normal</em>:</p>\n<p><a href=\"https://pluralistic.net/2024/07/20/ransom-note-force-field/#antilibraries\">https://pluralistic.net/2024/07/20/ransom-note-force-field/#antilibraries</a></p>\n<p>There's more than one way to be ugly, of course. The \"edgelords\" that defined forums like SomethingAwful and /b/ made heavy use of slurs, rape \"jokes\" and other beyond-the-pale rhetoric. Whether this reflected sincerely felt beliefs or a mere desire to shock (or both), it had the effect of making these subcultures very difficult to commodify. If you and your friends barely utter a single sentence that can be quoted in a mainstream news forum or office email, it's going to be very hard to co-opt you. For a long time, edgelords festered in the \"dark corners\" of the internet. But that's changed. The Holocaust denier Nick Fuentes &#8211; who thinks that \"every woman and girl\" should be \"sent to a gulag\" &#8211; has had dinner at the White House:</p>\n<p><a href=\"https://www.snopes.com/fact-check/nick-fuentes-women-gulag/\">https://www.snopes.com/fact-check/nick-fuentes-women-gulag/</a></p>\n<p>Last week, Ryan Broderick wrote a short, striking article for his must-read Garbage Day newsletter about the way that the far right have become \"cool\" within Gen Z by being so outre that they were evicted from the major platforms (before Trump II, that is):</p>\n<p><a href=\"https://www.garbageday.email/p/the-only-taboo-left-is-copyright-infringement\">https://www.garbageday.email/p/the-only-taboo-left-is-copyright-infringement</a></p>\n<p>As Broderick writes, \"cool\" isn't just \"trends\" (\"hyperpop, brainrot, crowdwork comedy, Instagram collages, their weird post-COVID pop punk exploration\"). For Broderick, cool things used to become trends <em>after</em> they were \"begrudgingly canonized\" by the likes of <em>Time Magazine</em>. But with Hollywood replaced by Youtube, magazines replaced by Tiktok, and radio replaced by Spotify, that looks very different today. Today's version of artist management teams is \"hype houses.\" All forms of cultural activity have collapsed into a single, overriding imperative: \"getting attention.\"</p>\n<p>Which brings Broderick to his main question:</p>\n<blockquote><p>\n  If everything is just attention now, and attention is completely commodified by algorithmic tech platforms, how can you push back against that?\n</p></blockquote>\n<p>His answer: \"You have to essentially pre-deplatform yourself.\"</p>\n<p>For young people, \"the only things that have the level of scarcity and danger required to be seen as cool\" are \"whatever is unacceptable on those platforms.\" In other words, anything (and maybe only things) that're blocked or banned are a candidate to be cool. Cool people walk away from the places where you'd expect to find them and hang out in places that are culturally viewed as less important.</p>\n<p>Broderick argues that this is the source of far-right influencers' influence: the fact that manosphere weirdos and trolls are hanging out in \"shadowy corners\" like Kick makes them feel authentic and outside of the norm and thus intrinsically interesting. And (Broderick continues) the fact that these manosphere types are now totally reliant on Discord clip-farmers has made them feel <em>more</em> mainstream and thus potentially less interesting.</p>\n<p>This is where it gets cool. Broderick argues that there's nothing intrinsically reactionary about this kind of self-deplatforming is a parallel evolution taking place in progressive media. When Stephen Colbert's Trump-colonized network bans him from airing an interview with a Democratic politician, he puts it on Youtube instead, where it gets far more attention than it would have if the network had just left him alone.</p>\n<p>But by and large it's not Democratic politicians who are too dangerous for the platforms &#8211; it's copyright infringement. The law makes it <em>very</em> easy to get things removed via unproven accusations of copyright infringement, and the platforms make it even easier:</p>\n<p><a href=\"https://pluralistic.net/2024/06/27/nuke-first/#ask-questions-never\">https://pluralistic.net/2024/06/27/nuke-first/#ask-questions-never</a></p>\n<p>Copyright is a doctrine that, by design, has very fuzzy edges where things may or may not be prohibited. But in the digital world, those edges are often erased, even as the zone of lawful activity they enclose contracts. This means that media that can be <em>accused</em> of infringing copyright is the most unwelcome content on platforms.</p>\n<p>Broderick's theory predicts that the \"coolest\" media &#8211; the stuff that makes taste &#8211; is the stuff that fits in this zone of copyright infringement. He cites some compelling case studies, like Vera Drew's \"The People's Joker,\" an amazing, unauthorized Batman mashup/trans allegory. Warner shut down multiple screenings of <em>The People's Joker</em> (including at TIFF), and this increased the coolness and prominence of the movie, driving people to underground screenings:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/The_People%27s_Joker\">https://en.wikipedia.org/wiki/The_People%27s_Joker</a></p>\n<p>A more contemporary version is <em>Nirvanna The Band The Show The Movie</em>, which Broderick describes as \"a copyright rats nest\" based on a web series that is \"completely illegal to watch on streaming platforms\":</p>\n<p><a href=\"https://pagesix.com/2026/02/14/hollywood/how-nirvanna-the-band-the-show-the-movie-skirted-copyright-law/\">https://pagesix.com/2026/02/14/hollywood/how-nirvanna-the-band-the-show-the-movie-skirted-copyright-law/</a></p>\n<p>Despite this/because of this, <em>NTBTSTM</em> just had \"the biggest opening ever for a live-action Canadian film\":</p>\n<p><a href=\"https://x.com/hertzbarry/status/2023521583923663342\">https://x.com/hertzbarry/status/2023521583923663342</a></p>\n<p>Broderick's conclusion is that \"as platforms police speech less and less, edgelords lose their sheen,\" but that this material, at or beyond the edge of copyright, unwelcome on platforms, is the future face of cool.</p>\n<p>And here's where Broderick really got me: \"the most dangerous thing for platforms is not racist garbage. It’s unmonetizeable content.\"</p>\n<p>I make a lot of \"unmonetizable content,\" starting with this blog, which has no metrics, no analytics, and (of course) no ads. I refuse to add social media cards, and hide obscure jokes in incredibly long URLs that get truncated on social media. I labor for hours over the weird illustrations that go at the top of the posts, which I release (along with the text they accompany) under Creative Commons licenses that let pretty much anyone do pretty much anything with them, without asking me, telling me, or paying me (it's always very funny when someone accuses me of publishing this work as clickbait &#8211; clickbait for <em>what</em>? To increase bandwidth consumption at my server?).</p>\n<p>I do this to \"woo the muse of the odd,\" a phrase I lifted from Bruce Sterling's 1991 keynote for the Game Developers' Conference, a talk that struck me so hard that I dropped out of university to make weird multimedia shortly after reading it:</p>\n<p><a href=\"https://lib.ru/STERLINGB/story.txt\">https://lib.ru/STERLINGB/story.txt</a></p>\n<p>It's a great talk, but the best parts are where Sterling grapples with this question of coolness, counterculture, and commodification:</p>\n<blockquote><p>\n  In the immortal words of Lafcadio Hearn, a geek of incredible obscurity whose work is still in print after a hundred years, \"woo the muse of the odd.\" A good science fiction story is not a \"good story\" with a polite whiff of rocket fuel in it. A good science fiction story is something that knows it is science fiction and plunges through that and comes roaring out of the other side. Computer entertainment should not be more like movies, it shouldn't be more like books, it should be more like computer entertainment, SO MUCH MORE LIKE COMPUTER ENTERTAINMENT THAT IT RIPS THROUGH THE LIMITS AND IS SIMPLY IMPOSSIBLE TO IGNORE!</p>\n<p>  I don't think you can last by meeting the contemporary public taste, the taste from the last quarterly report. I don't think you can last by following demographics and carefully meeting expectations. I don't know many works of art that last that are condescending. I don't know many works of art that last that are deliberately stupid&#8230; Get weird. Get way weird. Get dangerously weird. Get sophisticatedly, thoroughly weird and don't do it halfway, put every ounce of horsepower you have behind it.\n</p></blockquote>\n<p>It's been more than 30 years since I read that essay, more than a quarter century since I asked William Gibson whether Madison Avenue \"finds its own use for things.\" Over the ensuing decades, media has become ever-better at \"following demographics and carefully meeting expectations,\" thanks to vast troves of behavioral data correlated with media analytics. That process has only accelerated the \"recommodification machine\" that Gibson worried about in 1999, but as Broderick points out, there's one thing that is even harder to co-op than acne &#8211; \"unmonetizable content,\" the Kryptonite of the platforms.</p>\n<hr/>\n<p><a name=\"linkdump\"></a></p>\n<h1 heds=\"0\">Hey look at this (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#linkdump\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/heylookatthis3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>finally we have created the silver bullet <a href=\"https://backofmind.substack.com/p/finally-we-have-created-the-silver\">https://backofmind.substack.com/p/finally-we-have-created-the-silver</a></p>\n</li>\n<li>\n<p>Tac B <a href=\"https://chrisbathgate.blogspot.com/2026/02/tac-b.html\">https://chrisbathgate.blogspot.com/2026/02/tac-b.html</a></p>\n</li>\n<li>\n<p>Chainmail Finder <a href=\"https://www.chainmailfinder.com/\">https://www.chainmailfinder.com/</a></p>\n</li>\n<li>\n<p>More Women Drone Pilots <a href=\"https://www.youtube.com/watch?v=dDJa1_fLVeA\">https://www.youtube.com/watch?v=dDJa1_fLVeA</a></p>\n</li>\n<li>\n<p>It’s Time for Teachers to Break Up with Amazon <a href=\"https://ilsr.org/article/independent-business/its-time-for-teachers-to-break-up-with-amazon/\">https://ilsr.org/article/independent-business/its-time-for-teachers-to-break-up-with-amazon/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"retro\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A shelf of leatherbound history books with a gilt-stamped series title, 'The World's Famous Events.'\" src=\"https://i0.wp.com/craphound.com/images/worlds-famous-events.png?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Object permanence (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#retro\">permalink</a>)</h1>\n<p>#20yrsago Mysterious “lawer” threatens to sue me over Bad Samaritan story <a href=\"https://memex.craphound.com/2006/02/20/mysterious-lawer-threatens-to-sue-over-bad-samaritan-story/\">https://memex.craphound.com/2006/02/20/mysterious-lawer-threatens-to-sue-over-bad-samaritan-story/</a></p>\n<p>#20yrsago Flickr set documents locations in Neal Stephenson trilogy <a href=\"https://www.flickr.com/photos/notlikecalvin/sets/72057594068198516/\">https://www.flickr.com/photos/notlikecalvin/sets/72057594068198516/</a></p>\n<p>#20yrsago How the US is boning the developing world at WIPO <a href=\"https://web.archive.org/web/20060501000000*/https://www.eff.org/deeplinks/archives/004434.php\">https://web.archive.org/web/20060501000000*/https://www.eff.org/deeplinks/archives/004434.php</a></p>\n<p>#20yrsago Why kids are on MySpace <a href=\"https://www.danah.org/papers/AAAS2006.html\">https://www.danah.org/papers/AAAS2006.html</a></p>\n<p>#20yrsago Transport for London censors anagram Tube map <a href=\"https://web.archive.org/web/20060222021226/https://www.unfortu.net/anagrammap/\">https://web.archive.org/web/20060222021226/https://www.unfortu.net/anagrammap/</a></p>\n<p>#20yrsago More clues to identity of author of EFF-sliming article in The Reg <a href=\"https://memex.craphound.com/2006/02/22/more-clues-to-identity-of-author-of-eff-sliming-article-in-the-reg/\">https://memex.craphound.com/2006/02/22/more-clues-to-identity-of-author-of-eff-sliming-article-in-the-reg/</a></p>\n<p>#20yrsago US copyright head: world “totally rejects” webcasting restrictions <a href=\"https://memex.craphound.com/2006/02/21/us-copyright-head-world-totally-rejects-webcasting-restrictions/\">https://memex.craphound.com/2006/02/21/us-copyright-head-world-totally-rejects-webcasting-restrictions/</a></p>\n<p>#20yrsago Copyright office head denounces “big mistake” of extending copyright <a href=\"https://web.archive.org/web/20060329162217/https://www.ibiblio.org/yugen/video/too_long.mp4\">https://web.archive.org/web/20060329162217/https://www.ibiblio.org/yugen/video/too_long.mp4</a></p>\n<p>#20yrsago Artists paint Detroit’s derelict buildings Tiggeriffic Orange <a href=\"https://web.archive.org/web/20060411143941/http://www.thedetroiter.com/nov05/disneydemolition.php\">https://web.archive.org/web/20060411143941/http://www.thedetroiter.com/nov05/disneydemolition.php</a></p>\n<p>#20yrsago Canadian Uni bans WiFi because its safety can’t be proved <a href=\"https://web.archive.org/web/20060307004018/http://www.itbusiness.ca/it/client/en/home/News.asp?id=38093&amp;amp;PageMem=1\">https://web.archive.org/web/20060307004018/http://www.itbusiness.ca/it/client/en/home/News.asp?id=38093&amp;amp;PageMem=1</a></p>\n<p>#15yrsago Overcome information overload by trusting redundancy <a href=\"https://www.theguardian.com/technology/2011/feb/22/information-overload-probabilistic\">https://www.theguardian.com/technology/2011/feb/22/information-overload-probabilistic</a></p>\n<p>#15yrsago Embattled PS3 hacker raises big bank to fight Sony <a href=\"https://arstechnica.com/gaming/2011/02/george-hotz-secures-enough-donations-to-fight-sony-rap-battle-begins/\">https://arstechnica.com/gaming/2011/02/george-hotz-secures-enough-donations-to-fight-sony-rap-battle-begins/</a></p>\n<p>#15yrsago How Anonymous decides: inside the lulz-sausage factory <a href=\"https://arstechnica.com/tech-policy/2011/02/empty-suit-the-chaotic-way-that-anonymous-makes-decisions/\">https://arstechnica.com/tech-policy/2011/02/empty-suit-the-chaotic-way-that-anonymous-makes-decisions/</a></p>\n<p>#15yrsago America’s Chief Apocalypse Officer, a Fed job ad from 1956 <a href=\"https://web.archive.org/web/20110210020542/http://longstreet.typepad.com/thesciencebookstore/2011/02/nuclear-weapons-post-attack-job-description-1956.html\">https://web.archive.org/web/20110210020542/http://longstreet.typepad.com/thesciencebookstore/2011/02/nuclear-weapons-post-attack-job-description-1956.html</a></p>\n<p>#15yrsago What happens when you stick your head in a particle accelerator <a href=\"https://www.todayifoundout.com/index.php/2010/03/what-happens-when-you-stick-your-head-into-a-particle-accelerator/\">https://www.todayifoundout.com/index.php/2010/03/what-happens-when-you-stick-your-head-into-a-particle-accelerator/</a></p>\n<p>#15yrsago Saif Gadaffhi, plagiarist <a href=\"https://web.archive.org/web/20110225114903/https://saifalislamgaddafithesis.wikia.com/wiki/Main_Page\">https://web.archive.org/web/20110225114903/https://saifalislamgaddafithesis.wikia.com/wiki/Main_Page</a></p>\n<p>#15yrsago Google App to help locate people in Christchurch quake <a href=\"https://web.archive.org/web/20110222091007/http://christchurch-2011.person-finder.appspot.com/\">https://web.archive.org/web/20110222091007/http://christchurch-2011.person-finder.appspot.com/</a></p>\n<p>#15yrsago Photos of kids waiting at Disneyland <a href=\"https://web.archive.org/web/20110301045827/https://arinfishkin.com/fishkin_delayed_gratification.html\">https://web.archive.org/web/20110301045827/https://arinfishkin.com/fishkin_delayed_gratification.html</a></p>\n<p>#15yrsago Westboro Baptist Church attempts to lure Anonymous into attacking it? <a href=\"https://www.siliconrepublic.com/life/were-not-attacking-westboro-baptist-church-anonymous\">https://www.siliconrepublic.com/life/were-not-attacking-westboro-baptist-church-anonymous</a></p>\n<p>#15yrsago Egyptian orders a pizza for the Wisconsin demonstrators <a href=\"https://www.politico.com/story/2011/02/from-cairo-to-madison-some-pizza-049888#ixzz1EXkqdxcu\">https://www.politico.com/story/2011/02/from-cairo-to-madison-some-pizza-049888#ixzz1EXkqdxcu</a></p>\n<p>#15yrsago Metaphotos of landmarks made from hundreds of superimposed tourist snaps <a href=\"https://web.archive.org/web/20110219193205/http://www.mymodernmet.com/profiles/blogs/hundreds-of-tourist-photos\">https://web.archive.org/web/20110219193205/http://www.mymodernmet.com/profiles/blogs/hundreds-of-tourist-photos</a></p>\n<p>#15yrsago Armed Services Edition books: abridgements and pocket-editions for doughboys <a href=\"https://www.artofmanliness.com/character/military/literature-on-the-frontlines-the-history-of-armed-services-edition-books/?doing_wp_cron=1771432700.1463210582733154296875\">https://www.artofmanliness.com/character/military/literature-on-the-frontlines-the-history-of-armed-services-edition-books/?doing_wp_cron=1771432700.1463210582733154296875</a></p>\n<p>#15yrsago 3D printing’s first copyright complaint goes away, but things are just getting started <a href=\"https://memex.craphound.com/2011/02/20/3d-printings-first-copyright-complaint-goes-away-but-things-are-just-getting-started/\">https://memex.craphound.com/2011/02/20/3d-printings-first-copyright-complaint-goes-away-but-things-are-just-getting-started/</a></p>\n<p>#15yrsago Imperial Scott Walker, the worker-hating AT-AT Destroyer <a href=\"https://web.archive.org/web/20110224024111/https://simulacrumb.tumblr.com/#3388763986\">https://web.archive.org/web/20110224024111/https://simulacrumb.tumblr.com/#3388763986</a></p>\n<p>#10yrsago Forced arbitration clauses are a form of wealth transfer to the rich <a href=\"https://web.archive.org/web/20160322142114/https://www.acslaw.org/sites/default/files/Arbitration_as_Wealth_Transfer_1.pdf\">https://web.archive.org/web/20160322142114/https://www.acslaw.org/sites/default/files/Arbitration_as_Wealth_Transfer_1.pdf</a></p>\n<p>#10yrsago Eleven years and counting: EFF scores a major victory in its NSA mass surveillance suit <a href=\"https://www.eff.org/deeplinks/2016/02/big-victory-judge-pushes-jewel-v-nsa-forward\">https://www.eff.org/deeplinks/2016/02/big-victory-judge-pushes-jewel-v-nsa-forward</a></p>\n<p>#10yrsago What a serious keysigning ceremony looks like <a href=\"https://www.youtube.com/watch?v=b9j-sfP9GUU\">https://www.youtube.com/watch?v=b9j-sfP9GUU</a></p>\n<p>#10yrsago Pseudoscientific terror ended fluoridation in Calgary, now kids’ teeth are rotting <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/cdoe.12215\">https://onlinelibrary.wiley.com/doi/full/10.1111/cdoe.12215</a></p>\n<p>#10yrsago Manual typewriter + servos = polyfingered robot dictaphone <a href=\"https://www.youtube.com/watch?v=rNSCL4YOd5E\">https://www.youtube.com/watch?v=rNSCL4YOd5E</a></p>\n<p>#10yrsago Sarah Jeong’s Harvard lecture: “The Internet of Garbage” <a href=\"https://www.youtube.com/watch?v=pUSctMLLNUE\">https://www.youtube.com/watch?v=pUSctMLLNUE</a></p>\n<p>#10yrsago Citing copyright, Army blocks Chelsea Manning from receiving printouts from EFF’s website <a href=\"https://www.eff.org/deeplinks/2016/02/military-prison-blocks-chelsea-manning-reading-eff-blog-posts\">https://www.eff.org/deeplinks/2016/02/military-prison-blocks-chelsea-manning-reading-eff-blog-posts</a></p>\n<p>#10yrsago Improve your laptop stickering technique <a href=\"https://www.youtube.com/watch?v=juRDql6wBIQ\">https://www.youtube.com/watch?v=juRDql6wBIQ</a></p>\n<p>#10yrsago Photo of Bernie Sanders being arrested in 1963 Chicago protest <a href=\"https://web.archive.org/web/20160220024814/https://www.chicagotribune.com/news/local/breaking/ct-bernie-sanders-1963-chicago-arrest-20160219-story.html\">https://web.archive.org/web/20160220024814/https://www.chicagotribune.com/news/local/breaking/ct-bernie-sanders-1963-chicago-arrest-20160219-story.html</a></p>\n<p>#10yrsago Uber uses customer service reps to push anti-union message to drivers <a href=\"https://qz.com/619601/uber-is-using-its-us-customer-service-reps-to-deliver-its-anti-union-message\">https://qz.com/619601/uber-is-using-its-us-customer-service-reps-to-deliver-its-anti-union-message</a></p>\n<p>#10yrsago The latest DNS bug is terrifying, widespread, and reveals deep flaws in Internet security <a href=\"https://web.archive.org/web/20160222231840/http://dankaminsky.com/2016/02/20/skeleton/\">https://web.archive.org/web/20160222231840/http://dankaminsky.com/2016/02/20/skeleton/</a></p>\n<p>#10yrsago 19th century spam came by post, prefigured modern spam in so many ways <a href=\"https://web.archive.org/web/20160915000000*/http://www.ephemerasociety.org/blog/\">https://web.archive.org/web/20160915000000*/http://www.ephemerasociety.org/blog/</a></p>\n<p>#10yrsago Republican Congressmen backed by airline money kill research on legroom and passenger safety <a href=\"https://web.archive.org/web/20160221163010/https://theintercept.com/2016/02/21/backed-by-airline-dollars-congress-rejects-effort-to-address-shrinking-legroom/\">https://web.archive.org/web/20160221163010/https://theintercept.com/2016/02/21/backed-by-airline-dollars-congress-rejects-effort-to-address-shrinking-legroom/</a></p>\n<p>#5yrsago The Paltrow-Industrial Complex <a href=\"https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#goopy\">https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#goopy</a></p>\n<p>#5yrsago Facebook vs Australia <a href=\"https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#facecrook\">https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#facecrook</a></p>\n<p>#5yrsago K-shaped recovery vs wealth taxes <a href=\"https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#wealth-tax\">https://pluralistic.net/2021/02/21/paltrow-industrial-complex/#wealth-tax</a></p>\n<p>#5yrsago What Democrats need to do <a href=\"https://pluralistic.net/2021/02/22/sorcerers-apprentice/#do-something\">https://pluralistic.net/2021/02/22/sorcerers-apprentice/#do-something</a></p>\n<p>#5yrsago Tech trustbusting's moment has arrived <a href=\"https://pluralistic.net/2021/02/20/escape-velocity/#trustbusting-time\">https://pluralistic.net/2021/02/20/escape-velocity/#trustbusting-time</a></p>\n<p>#1yrago Ad-tech targeting is an existential threat <a href=\"https://pluralistic.net/2025/02/20/privacy-first-second-third/#malvertising\">https://pluralistic.net/2025/02/20/privacy-first-second-third/#malvertising</a></p>\n<p>#1yrago We bullied HP into a minor act of disenshittification <a href=\"https://pluralistic.net/2025/02/22/ink-spattered-pitchforks/#racehorse-semen\">https://pluralistic.net/2025/02/22/ink-spattered-pitchforks/#racehorse-semen</a></p>\n<hr/>\n<p><a name=\"upcoming\"></a></p>\n<h1 heds=\"0\">Upcoming appearances (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#upcoming\">permalink</a>)</h1>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A photo of me onstage, giving a speech, pounding the podium.\" src=\"https://i0.wp.com/craphound.com/images/appearances3.jpg?w=840&#038;ssl=1\"/></p>\n<ul>\n<li>Montreal (remote): Fedimtl, Feb 24<br />\n<a href=\"https://fedimtl.ca/\">https://fedimtl.ca/</a></p>\n</li>\n<li>\n<p>Oslo (remote): Seminar og lansering av rapport om «enshittification»<br />\n<a href=\"https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/\">https://www.forbrukerradet.no/siste-nytt/digital/seminar-og-lansering-av-rapport-om-enshittification/</a></p>\n</li>\n<li>\n<p>Victoria: 28th Annual Victoria International Privacy &amp; Security Summit, Mar 3-5<br />\n<a href=\"https://www.rebootcommunications.com/event/vipss2026/\">https://www.rebootcommunications.com/event/vipss2026/</a></p>\n</li>\n<li>\n<p>Victoria: Enshittification at Russell Books, Mar 4<br />\n<a href=\"https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914\">https://www.eventbrite.ca/e/cory-doctorow-is-coming-to-victoria-tickets-1982091125914</a></p>\n</li>\n<li>\n<p>Barcelona: Enshittification with Simona Levi/Xnet (Llibreria Finestres), Mar 20<br />\n<a href=\"https://www.llibreriafinestres.com/evento/cory-doctorow/\">https://www.llibreriafinestres.com/evento/cory-doctorow/</a></p>\n</li>\n<li>\n<p>Berkeley: Bioneers keynote, Mar 27<br />\n<a href=\"https://conference.bioneers.org/\">https://conference.bioneers.org/</a></p>\n</li>\n<li>\n<p>Berlin: Re:publica, May 18-20<br />\n<a href=\"https://re-publica.com/de/news/rp26-sprecher-cory-doctorow\">https://re-publica.com/de/news/rp26-sprecher-cory-doctorow</a></p>\n</li>\n<li>\n<p>Berlin: Enshittification at Otherland Books, May 19<br />\n<a href=\"https://www.otherland-berlin.de/de/event-details/cory-doctorow.html\">https://www.otherland-berlin.de/de/event-details/cory-doctorow.html</a></p>\n</li>\n<li>\n<p>Hay-on-Wye: HowTheLightGetsIn, May 22-25<br />\n<a href=\"https://howthelightgetsin.org/festivals/hay/big-ideas-2\">https://howthelightgetsin.org/festivals/hay/big-ideas-2</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"recent\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A screenshot of me at my desk, doing a livecast.\" src=\"https://i0.wp.com/craphound.com/images/recentappearances3.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Recent appearances (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#recent\">permalink</a>)</h1>\n<ul>\n<li>Panopticon :3 (Trashfuture)<br />\n<a href=\"https://www.patreon.com/posts/panopticon-3-150395435\">https://www.patreon.com/posts/panopticon-3-150395435</a></p>\n</li>\n<li>\n<p>America's Enshittification is Canada's Opportunity (Do Not Pass Go)<br />\n<a href=\"https://www.donotpassgo.ca/p/americas-enshittification-is-canadas\">https://www.donotpassgo.ca/p/americas-enshittification-is-canadas</a></p>\n</li>\n<li>\n<p>Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein)<br />\n<a href=\"https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html\">https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html</a></p>\n</li>\n<li>\n<p>How the Internet Got Worse (Masters in Business)<br />\n<a href=\"https://www.youtube.com/watch?v=auXlkuVhxMo\">https://www.youtube.com/watch?v=auXlkuVhxMo</a></p>\n</li>\n<li>\n<p>Enshittification (Jon Favreau/Offline):<br />\n<a href=\"https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/\">https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"latest\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A grid of my books with Will Stahle covers..\" src=\"https://i0.wp.com/craphound.com/images/recent.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Latest books (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#latest\">permalink</a>)</h1>\n<ul>\n<li>\"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 <a href=\"https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce\">https://pluralistic.net/2025/09/04/illustrious/#chairman-bruce</a></p>\n</li>\n<li>\n<p>\"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025<br />\n<a href=\"https://us.macmillan.com/books/9780374619329/enshittification/\">https://us.macmillan.com/books/9780374619329/enshittification/</a></p>\n</li>\n<li>\n<p>\"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (<a href=\"https://us.macmillan.com/books/9781250865908/picksandshovels\">https://us.macmillan.com/books/9781250865908/picksandshovels</a>).</p>\n</li>\n<li>\n<p>\"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (<a href=\"http://thebezzle.org\">thebezzle.org</a>).</p>\n</li>\n<li>\n<p>\"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (<a href=\"http://lost-cause.org\">http://lost-cause.org</a>).</p>\n</li>\n<li>\n<p>\"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (<a href=\"http://seizethemeansofcomputation.org\">http://seizethemeansofcomputation.org</a>). Signed copies at Book Soup (<a href=\"https://www.booksoup.com/book/9781804291245\">https://www.booksoup.com/book/9781804291245</a>).</p>\n</li>\n<li>\n<p>\"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books <a href=\"http://redteamblues.com\">http://redteamblues.com</a>.</p>\n</li>\n<li>\n<p>\"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 <a href=\"https://chokepointcapitalism.com\">https://chokepointcapitalism.com</a></p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"upcoming-books\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" alt=\"A cardboard book box with the Macmillan logo.\" src=\"https://i0.wp.com/craphound.com/images/upcoming-books.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Upcoming books (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#upcoming-books\">permalink</a>)</h1>\n<ul>\n<li>\"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026</p>\n</li>\n<li>\n<p>\"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a geopolitical sequel of sorts to <em>Enshittification</em>, Farrar, Straus and Giroux, 2027</p>\n</li>\n<li>\n<p>\"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027</p>\n</li>\n<li>\n<p>\"The Memex Method,\" Farrar, Straus, Giroux, 2027</p>\n</li>\n</ul>\n<hr/>\n<p><a name=\"bragsheet\"></a><br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/colophon2.jpg?w=840&#038;ssl=1\"/></p>\n<h1 heds=\"0\">Colophon (<a href=\"https://pluralistic.net/2026/02/23/goodharts-lawbreaker/#bragsheet\">permalink</a>)</h1>\n<p>Today's top sources:</p>\n<p><b>Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1035 words today, 351334 total)</b></p>\n<ul>\n<li>\"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE.</p>\n</li>\n<li>\n<p>\"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING.</p>\n</li>\n<li>\n<p>A Little Brother short story about DIY insulin PLANNING</p>\n</li>\n</ul>\n<hr/>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/craphound.com/images/by.svg.png?w=840&#038;ssl=1\"/></p>\n<p>This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net.</p>\n<p><a href=\"https://creativecommons.org/licenses/by/4.0/\">https://creativecommons.org/licenses/by/4.0/</a></p>\n<p>Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution.</p>\n<hr/>\n<h1>How to get Pluralistic:</h1>\n<p>Blog (no ads, tracking, or data-collection):</p>\n<p><a href=\"http://pluralistic.net\">Pluralistic.net</a></p>\n<p>Newsletter (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://pluralistic.net/plura-list\">https://pluralistic.net/plura-list</a></p>\n<p>Mastodon (no ads, tracking, or data-collection):</p>\n<p><a href=\"https://mamot.fr/@pluralistic\">https://mamot.fr/@pluralistic</a></p>\n<p>Medium (no ads, paywalled):</p>\n<p><a href=\"https://doctorow.medium.com/\">https://doctorow.medium.com/</a></p>\n<p>Twitter (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://twitter.com/doctorow\">https://twitter.com/doctorow</a></p>\n<p>Tumblr (mass-scale, unrestricted, third-party surveillance and advertising):</p>\n<p><a href=\"https://mostlysignssomeportents.tumblr.com/tagged/pluralistic\">https://mostlysignssomeportents.tumblr.com/tagged/pluralistic</a></p>\n<p>\"<em>When life gives you SARS, you make sarsaparilla</em>\" -Joey \"Accordion Guy\" DeVilla</p>\n<p>READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.</p>\n<p>ISSN: 3066-764X</p>\n",
    "description": "Today's links Deplatform yourself: Copyright infringement is your least entertainment dollar. Hey look at this: Delights to delectate. Object permanence: \"Lawer\" threatens suit; Landmark metaphotos; 3DP v (c); Forced arbitration; Imperial Scott Walker; Keysigning ritual; Polyfingered robot dictaphone; DNS bug; Register of copyright damns term extension; How Anonymous decides; Christchurch quake people-finder; Minor HP disenshittification; US v developing world at WIPO; TfL v anagram tube-map; Di",
    "is_fulltext": true,
    "source": "Pluralistic: Daily links from Cory Doctorow",
    "pub_date": "Mon, 23 Feb 2026 10:52:48 +0000",
    "fetched_at": "2026-02-23T12:22:55.054558",
    "url_hash": "b2bb94ac4784f4d280c78bc946e2db8f"
  },
  {
    "title": "Everyone in AI is building the wrong thing for the same reason",
    "link": "https://www.joanwestenberg.com/everyone-in-ai-is-building-the-wrong-thing-for-the-same-reason/",
    "content": "<img src=\"https://www.joanwestenberg.com/content/images/2026/02/ChatGPT-Image-Feb-23--2026--10_09_25-PM.png\" alt=\"Everyone in AI is building the wrong thing for the same reason\"><p>Every AI founder I talk to is on an accelerating treadmill, burdened by a nagging suspicion that the entire industry is moving too fast in a direction that doesn&apos;t quite make sense, with no idea about how to get off. </p><p>There is an overwhelming feeling that if everyone stopped and thought about it for five minutes, they&apos;d build something completely different; but it&apos;s paired with a total inability to articulate why they specifically haven&apos;t stopped.</p><p>Well, the answer is simple. </p><p>Of course it is.</p><p>Nobody stops, because nobody can afford to, and that feeling has a name. It&apos;s called Moloch, and it&apos;s the most important thing happening in AI that isn&apos;t on your roadmap.</p><h2 id=\"a-race-nobody-chose\">A race nobody chose</h2><p>A new model drops. It&apos;s better at benchmarks. Every AI product company now has to integrate it (if they&apos;re a wrapper) or match it (if they&apos;re building a model) <em>or explain to their investors why they didn&apos;t</em>. Integration // parity takes engineering time, time that doesn&apos;t go toward the actual product differentiation that would create long-term value. But the company that doesn&apos;t integrate looks like it&apos;s falling behind, and looking like you&apos;re falling behind is fatal when your entire valuation rests on the assumption that you&apos;re on the frontier.</p><p>Everyone catches up, everyone shifts resources, everyone ships the update. The net competitive position of every company is exactly where it was before, except they all engineering time on esoteria and none of them made their end-product meaningfully better for end-users.</p><p>That&apos;s one cycle. </p><p>It happens every few weeks now.</p><p>This is Moloch; and it&apos;scoordination failure as competition. Every company makes an individually rational decision (keep up with the frontier or die) and the aggregate outcome is an industry that&apos;s moving incredibly fast in the direction of model capability, and barely at all in the direction of product value.</p><p>The race is real // the destination is fake.</p><h2 id=\"convergence\">Convergence</h2><p>Every AI product is converging on the same interface: a chat box. Maybe a chat box with some tool use. Maybe a chat box with some RAG. But at bottom, a text input and a text output, differentiated by branding and minor UX choices and which model is running underneath.</p><p>The chat box won because it ships fast, and Moloch rewards speed over design.</p><p>Building a novel interaction paradigm takes months or years of research, iteration, user testing. During those months, fifteen competitors will ship chat-box wrappers with the latest model and capture the market&apos;s attention. Your investors will get nervous. Your board will suggest you &quot;ship something&quot; while you figure out the long-term vision. You&apos;ll ship the chat box. The long-term vision will die in a Notion doc nobody opens.</p><p>Every company faces this exact choice and picks the same outcome. The competitive structure <em>selects against creativity</em>. The companies that take time to build something new get outrun by the companies that ship the obvious thing fast. And the obvious thing is always the same thing, because the obvious thing is, by definition, the thing that doesn&apos;t need original thinking.</p><p>Moloch doesn&apos;t want you to build something good.</p><p>Moloch wants you to build something <em>now</em>.</p><h2 id=\"fundraising-as-trap\">Fundraising as trap</h2><p>The competitive dynamic is bad enough at the product level. At the fundraising level, it&apos;s catastrophic.</p><p>AI companies are raising at valuations that require them to grow at rates that are only achievable by chasing the broadest possible market with the most generic possible product. A company that raises at a $500M valuation needs to show a path to billions in revenue, which means it can&apos;t afford to be a niche tool that does one thing brilliantly for a specific audience. It has to be a platform, horizontal, aimed at enterprise, built for no one in particular.</p><p>Every AI company is building the same enterprise platform with the same features targeting the same buyers, because the fundraising math requires it, because the valuation requires it, because the competitive environment requires raising at that valuation to attract talent, because the talent market requires it.</p><p>Nobody in this chain chose this outcome. Every individual decision was rational. The aggregate result is an industry producing fifty identical products, none of which solve any specific problem particularly well, all of which are locked in a feature war that generates zero cumulative value.</p><p>The companies that would build something different (smaller, more focused, more opinionated) can&apos;t raise the capital to compete. The companies that raise the capital are structurally forced into sameness. Moloch eats the variance, and variance is where all the actual value lives.</p><h2 id=\"talent-death-spiral\">Talent death spiral</h2><p>It&apos;s in the talent market too.</p><p>Top AI researchers and engineers go to the companies that are on the frontier. The frontier is defined by model capability benchmarks. So companies invest disproportionately in model capabilty, because that&apos;s how you attract talent, even when the marginal return on model capability for their specific product is near zero.</p><p>Your users don&apos;t need GPT-5 when they can barely use GPT-4 effectively. They need better UX and better integration into how they actually work. But the engineer who could build that wants to work on the model, because model work is what gets you your next job, because the next company is also optimizing for model capability, because <em>they</em> need to attract talent too.</p><p>Every company overspends on model capability and underspends on product quality. The structure forces it. The talent market punishes you for having the right priorities.</p><h2 id=\"why-build-something-good-isnt-a-strategy\">Why &quot;build something good&quot; isn&apos;t a strategy</h2><p>The startup advice I&apos;ve heard for a decade+ is <em>&quot;Ignore the noise. Focus on users. Build something good.&quot;</em></p><p>Correct in theory, nearly impossible in practice, because Moloch specifically punishes this strategy in the medium term.</p><p>Building something good takes time, and time means you&apos;re not shipping. Not shipping means you look like you&apos;re losing, which means talent leaves and investors get nervous, and your competitors (who are shipping fast and bad) capture market position that&apos;s expensive to reclaim.</p><p>The window in which &quot;build something good&quot; pays off is long, two years, three years, maybe more. The window in which Moloch punishes you for it is immediate and continuous. Most companies don&apos;t survive the medium term to reach teh long term.</p><p>The founders who know this stay up at night. </p><p>They can probably see the right thing to build. </p><p>They can&apos;t survive building it.</p><h2 id=\"escape-is-impossible\">Escape is im//possible</h2><p>You can&apos;t outrun Moloch. You can only build a structure it can&apos;t reach.</p><p>In practice, this means: don&apos;t raise more than you need. Don&apos;t hire faster than your product vision can absorb. Don&apos;t compete on the frontier unless the frontier is where your users live. Find a niche that&apos;s too small for the Moloch-captured companies to notice and go so deep into it that by the time they arrive, your product is years ahead in the dimension that matters to those users.</p><p>Be small enough that the competitve pressure doesn&apos;t distort your priorities. Be opinionated enough that you can&apos;t be dragged into building the same thing as everyone else. Be capitally efficient enough that you don&apos;t need the growth rate that forces you onto the treadmill. Be weird enough that nobody can copy you without becoming you.</p>",
    "description": "Every AI founder I talk to is on an accelerating treadmill, burdened by a nagging suspicion that the entire industry is moving too fast in a direction that doesn&apos;t quite make sense, with no idea about how to get off. There is an overwhelming feeling that if everyone",
    "is_fulltext": true,
    "source": "Westenberg.",
    "pub_date": "Mon, 23 Feb 2026 11:09:55 GMT",
    "fetched_at": "2026-02-23T12:23:18.447688",
    "url_hash": "0061a4137f32e42b41ba7022f479d8af"
  },
  {
    "title": "Where Do Specifications Fit in the Dependency Tree?",
    "link": "https://nesbitt.io/2026/02/23/where-do-specifications-fit-in-the-dependency-tree.html",
    "content": "<p>Your Ruby gem declares <code class=\"language-plaintext highlighter-rouge\">required_ruby_version &gt;= 3.0</code>. That constraint references the Ruby 3.0 language specification, expressed through the implementation version, checked against whichever runtime happens to be running, with no distinction between MRI and JRuby, and no connection to the specification document that defines what Ruby 3.0 even is.</p>\n\n<p>Runtimes at least show up somewhere in the tooling. Your HTTP library also depends on RFC 9110, your JSON parser on ECMA-404, your TLS implementation on RFC 8446, and none of those appear in any manifest, lockfile, or SBOM.</p>\n\n<p>Library dependencies get the full treatment: manifests declare them, lockfiles pin them, SBOMs track them, scanners check them for vulnerabilities. Runtime versions sit one layer down, handled differently by every ecosystem. Python has <code class=\"language-plaintext highlighter-rouge\">Requires-Python</code> in package metadata, enforced by pip but ignored by trove classifiers that may disagree with it. Ruby has <code class=\"language-plaintext highlighter-rouge\">required_ruby_version</code> in the gemspec, enforced by both RubyGems and Bundler. Node.js has the <code class=\"language-plaintext highlighter-rouge\">engines</code> field in package.json, advisory by default in npm unless you flip a config flag. Go’s <code class=\"language-plaintext highlighter-rouge\">go</code> directive in go.mod was advisory until Go 1.21, when it flipped to a hard minimum in a single release and started auto-downloading the required toolchain if yours is too old.</p>\n\n<p>Developers keep inventing new layers because none of these are reliable enough on their own. A Ruby project might have <code class=\"language-plaintext highlighter-rouge\">required_ruby_version &gt;= 3.0</code> in the gemspec, <code class=\"language-plaintext highlighter-rouge\">ruby \"3.2.2\"</code> in the Gemfile, and <code class=\"language-plaintext highlighter-rouge\">ruby 3.2.2</code> in <code class=\"language-plaintext highlighter-rouge\">.tool-versions</code> for asdf or mise. That’s the same dependency declared in three places with three enforcement mechanisms, and they can disagree. The <code class=\"language-plaintext highlighter-rouge\">.tool-versions</code> file exists because the gemspec constraint is too loose and the Gemfile directive doesn’t control which binary is on your PATH.</p>\n\n<p>Runtime implementation is barely tracked at all. JRuby 9.4 reports <code class=\"language-plaintext highlighter-rouge\">RUBY_VERSION</code> as <code class=\"language-plaintext highlighter-rouge\">\"3.1.0\"</code>, so a gem requiring <code class=\"language-plaintext highlighter-rouge\">&gt;= 3.0</code> passes. If the gem has a C extension, it fails at build time because JRuby can’t run C extensions, and the gemspec has no way to express that it needs MRI specifically. .NET is the only ecosystem that formally addressed this with .NET Standard, a versioned API surface that works across .NET Framework, .NET Core, Mono, and Xamarin, essentially a spec for the spec implementations.</p>\n\n<p>And below all of this sit the specifications themselves, language definitions and protocol standards and encoding rules, none of which appear in any dependency graph.</p>\n\n<h3 id=\"spack\">Spack</h3>\n\n<p>Spack, the HPC package manager, spent seven years learning what happens when you leave a dependency implicit.</p>\n\n<p>Before Spack v1.0, compilers were a special “node attribute” rather than actual nodes in the dependency graph. You configured them in <code class=\"language-plaintext highlighter-rouge\">compilers.yaml</code> as external tools. Every package carried a compiler annotation, but compilers weren’t dependencies in any meaningful sense.</p>\n\n<p>Compiler runtime libraries like <code class=\"language-plaintext highlighter-rouge\">gcc-runtime</code> (libgcc, libstdc++) were invisible. If you needed clang for C but gfortran for Fortran, the monolithic compiler attribute couldn’t express that. Build tools like cmake inherited the same exotic compiler as your main software even when they could have used a standard one. And if a Fortran compiler was missing, you’d find out deep in the dependency tree at build time rather than upfront during resolution.</p>\n\n<p>The idea to fix this was <a href=\"https://github.com/spack/spack/issues/896\">filed in 2016</a>. The motivation came from a debugging story: a sysadmin installed a large dependency graph, gfortran was missing, openmpi built without Fortran support, and then hypre failed much later. If packages declared language dependencies, resolution itself would have caught the missing compiler before anything started building.</p>\n\n<p>It took until March 2025 for <a href=\"https://github.com/spack/spack/pull/45189\">PR #45189</a> (“Turn compilers into nodes”) to merge. In Spack v1.0, languages like <code class=\"language-plaintext highlighter-rouge\">c</code>, <code class=\"language-plaintext highlighter-rouge\">cxx</code>, and <code class=\"language-plaintext highlighter-rouge\">fortran</code> are virtual packages. Compilers are providers of those virtuals. A package declares <code class=\"language-plaintext highlighter-rouge\">depends_on(\"c\")</code> and <code class=\"language-plaintext highlighter-rouge\">depends_on(\"cxx\")</code>, and the resolver finds a compiler that satisfies both. The DAG now shows gcc injecting <code class=\"language-plaintext highlighter-rouge\">gcc-runtime</code> as a visible runtime dependency, and the compiler wrapper is an explicit node included in the hash. The whole journey spanned dozens of intermediate issues, a <a href=\"https://archive.fosdem.org/2018/schedule/event/spack/\">FOSDEM 2018 talk</a>, and a complete rethinking of how Spack’s concretizer works.</p>\n\n<p>Nix has always treated the compiler as a hashed dependency. Every derivation gets its build tools through <code class=\"language-plaintext highlighter-rouge\">stdenv</code>, and the compiler toolchain is a content-addressed derivation like anything else. Bazel does something similar with hermetic toolchains. conda-forge uses `` in recipe metadata, which expands to platform-specific compiler packages. But even Nix stops at the same boundary, with the runtime, compiler, and glibc as content-addressed nodes while the specifications those tools implement remain outside the graph entirely.</p>\n\n<h3 id=\"spec-transitions\">Spec transitions</h3>\n\n<p>What happens at that boundary, when a spec changes and the implementations have to follow? The results are rarely clean.</p>\n\n<p>When Chrome and Firefox enabled TLS 1.3 for testing in February 2017, failure rates were unexpectedly high. Chrome-to-Gmail connections succeeded 98.3% of the time with TLS 1.2 but only 92.3% with TLS 1.3. The culprit was middleboxes: corporate proxies and firewalls that had hardcoded expectations about TLS handshake fields. The TLS spec always allowed those fields to change, but because they had been stable for so long, middlebox developers treated them as constants.</p>\n\n<p>TLS 1.3 now lies about its own version. The ClientHello claims to be TLS 1.2, includes dummy session_id and ChangeCipherSpec fields that TLS 1.3 doesn’t need, and uses a <code class=\"language-plaintext highlighter-rouge\">supported_versions</code> extension to negotiate the real protocol. Separately, GREASE (Generate Random Extensions And Sustain Extensibility, RFC 8701) has implementations advertise reserved IANA values for cipher suites, extensions, and other fields, training middleboxes to tolerate unknown values rather than ossifying around a fixed set. A spec had to disguise itself as an older version of itself because the ecosystem had ossified around implicit assumptions about the previous version.</p>\n\n<p>Unicode releases new versions roughly annually, and each version can change character properties for existing characters, not just add new ones. When Chrome updated its ICU data, the wrestler and handshake emoji lost their <code class=\"language-plaintext highlighter-rouge\">Emoji_Base</code> classification, causing emoji with skin tone modifiers to visually split into a base character and an orphaned modifier. Most software has no way to declare “I depend on Unicode 14.0 character properties.” The Unicode version is baked into whatever runtime you happen to be using, and it changes when you update your JDK or system ICU library. Breakage happens not because developers chose to upgrade the spec, but because they upgraded something else and the spec came along for the ride.</p>\n\n<p>PyPI classifiers let packages declare <code class=\"language-plaintext highlighter-rouge\">Programming Language :: Python :: 3</code>, and Brett Cannon built <code class=\"language-plaintext highlighter-rouge\">caniusepython3</code> to analyze dependency trees and report which packages blocked the Python 2 to 3 migration. But classifiers were optional and often wrong. If <code class=\"language-plaintext highlighter-rouge\">python_requires</code> had been mandatory and machine-enforced from the start, pip could have refused to install incompatible packages automatically. The <a href=\"https://python3wos.appspot.com/\">Python 3 Wall of Shame</a>, launched in February 2011, showed only 9% of the top 200 packages supporting Python 3 more than two years after its release. Guido van Rossum later called the transition a mistake, not because Python 3 was wrong, but because the core team underestimated how much Python 2 code existed.</p>\n\n<p>CommonJS and ES Modules in Node.js are two incompatible module specs: ESM can import CJS, but CJS cannot <code class=\"language-plaintext highlighter-rouge\">require()</code> ESM because ESM loads asynchronously and supports top-level <code class=\"language-plaintext highlighter-rouge\">await</code>. If package.json had required declaring module system compatibility from the start, npm could have flagged incompatibilities at install time instead of leaving developers to discover them at runtime.</p>\n\n<p>SMTP’s transition to ESMTP negotiates at the protocol level: clients send <code class=\"language-plaintext highlighter-rouge\">EHLO</code> instead of <code class=\"language-plaintext highlighter-rouge\">HELO</code>, and if the server doesn’t understand it, they fall back. The server’s response lists supported extensions, essentially runtime dependency resolution for protocol capabilities. HTTP/1.1 to HTTP/2 used similar ALPN negotiation.</p>\n\n<h3 id=\"executable-specs\">Executable specs</h3>\n\n<p>Web Platform Tests has over 56,000 tests and 1.8 million subtests, each mapped to a specific section of a W3C or WHATWG specification. The <a href=\"https://wpt.fyi/about\">WPT Dashboard</a> shows which browser engines pass which tests. TC39’s Test262 does the same for ECMAScript. When a browser team says “we implement CSS Grid Level 1,” what they mean in practice is that they pass a specific set of WPT tests.</p>\n\n<p>These test suites are closer to something you could declare as a dependency than any prose RFC. They’re versioned, concrete artifacts with commit hashes. If you wanted a PURL-like identifier for spec dependencies, the test suite version might be more useful than the spec document version: <code class=\"language-plaintext highlighter-rouge\">pkg:spec/w3c/wpt-css-grid@sha256:abc123</code> pins actual behavior, while <code class=\"language-plaintext highlighter-rouge\">pkg:spec/w3c/css-grid@level-1</code> pins intent. They don’t always agree, and they don’t always change at the same time. A browser can pass all current WPT tests for a spec while the spec itself is still being revised, or a spec can be finalized while the test suite lags behind. When they diverge, you get a new class of version mismatch beyond the usual “pinned vs. unpinned” problem: did your package depend on what the spec said, or on what the test suite checked? A library might conform to the prose spec but fail the test suite because the tests encode a stricter interpretation, or pass every test while relying on behaviour the spec committee is about to remove. Tracking spec dependencies would need to account for both, and for the fact that they drift independently.</p>\n\n<p>Most specs have no conformance suite at all, though. IETF RFCs rarely ship with official tests. Where tests exist, they tend to emerge from interoperability testing during standardization and then go unmaintained. The dependency chain for most software is still <code class=\"language-plaintext highlighter-rouge\">package -&gt; implementation -&gt; implicit understanding of a prose document</code>, with no machine-readable contract in between.</p>\n\n<p>TypeScript’s DefinitelyTyped ecosystem already does something like this for runtime APIs. <code class=\"language-plaintext highlighter-rouge\">@types/node</code> describes what the Node.js runtime provides as a versioned npm package with its own semver, tracked in lockfiles and resolved by the same dependency machinery as any other package, but it declares the shape of an API without providing it. They version independently from the runtime they describe, so <code class=\"language-plaintext highlighter-rouge\">@types/node@20</code> might not match the actual Node 20 API surface perfectly, and the mismatch only surfaces when someone notices. Developers voluntarily create and maintain these artifacts because the tooling rewards it, which suggests the main barrier to spec-as-a-package isn’t willingness but infrastructure.</p>\n\n<h3 id=\"de-facto-specifications\">De facto specifications</h3>\n\n<p>Not all specifications live in standards bodies. Node.js module resolution has no formal spec; it’s defined by Node’s behavior, and anything that resolves modules the same way is depending on that behavior whether or not anyone writes it down.</p>\n\n<p>Oracle donated Java EE to the Eclipse Foundation but retained the Java trademark, which prevented the Eclipse Foundation from modifying the <code class=\"language-plaintext highlighter-rouge\">javax</code> namespace. The compromise was renaming every package from <code class=\"language-plaintext highlighter-rouge\">javax.*</code> to <code class=\"language-plaintext highlighter-rouge\">jakarta.*</code> in Jakarta EE 9, keeping the APIs identical under different names. Every application, library, and framework that imported <code class=\"language-plaintext highlighter-rouge\">javax.servlet</code> or <code class=\"language-plaintext highlighter-rouge\">javax.persistence</code> broke. Tools like OpenRewrite automated the rename, but it remains one of the most disruptive compatibility events in Java’s history, caused entirely by a trademark dispute rather than any technical change. If Java EE’s spec dependency had been an explicit, versioned node in the graph, the scope of the breakage would at least have been visible before the rename happened.</p>\n\n<h3 id=\"spec-to-spec-dependencies\">Spec-to-spec dependencies</h3>\n\n<p>Specifications have their own dependency graphs. JSON relies on UTF-8 and through it on Unicode. HTTP sits on TLS, which sits on X.509 and ASN.1, so a breaking change to ASN.1 encoding would ripple through TLS implementations into HTTP libraries and from there into everything that makes network requests. CSS Grid builds on the Box Model and Visual Formatting contexts.</p>\n\n<p>The <a href=\"https://github.com/raybellis/rfcdeps\">rfcdeps</a> tool graphs these relationships by parsing the “obsoletes” and “updates” headers from the RFC Editor’s XML index, but it has no way to connect the spec graph to the software dependency graph, and nobody seems to have tried.</p>\n\n<h3 id=\"naming\">Naming</h3>\n\n<p><a href=\"/2026/02/14/package-management-namespaces.html\">Package management is naming</a>, and the naming problem for specifications is worse than for packages.</p>\n\n<p>The IETF uses sequential numbers where a new version of a spec gets a new number entirely. RFC 9110 obsoletes RFC 7231, which obsoleted RFC 2616. If you want to reference “HTTP semantics,” you need to pick which RFC number, and that choice encodes a point in time rather than a version range. W3C uses levels for CSS (CSS Grid Level 1, Level 2), numbered versions for older specs (HTML 4.01), and maturity stages (Working Draft, Candidate Recommendation, Recommendation). WHATWG abandoned versioning entirely; HTML is a “Living Standard” with no version number and no snapshots. ECMA uses both edition numbers and year names (ECMA-262 6th Edition is also ES2015). ISO uses structured identifiers with amendment and corrigenda layers (<code class=\"language-plaintext highlighter-rouge\">ISO/IEC 5962:2021</code>). IEEE uses base number plus year (IEEE 754-2019).</p>\n\n<p>An Internet-Draft (<a href=\"https://datatracker.ietf.org/doc/html/draft-claise-semver-02\">draft-claise-semver-02</a>) proposed applying semver to IETF specifications, giving RFCs the same kind of machine-comparable version identifiers that packages use, but it expired without adoption. The barriers weren’t really technical; standards bodies have versioned things their own way for decades, and the conventions are embedded in their tooling, citation practices, and organizational processes. Getting the IETF, W3C, WHATWG, ECMA, ISO, and IEEE to agree on a common versioning scheme is a harder coordination problem than getting package managers to agree on lockfile formats.</p>\n\n<p>If you wanted a PURL-like scheme for specifications, something like <code class=\"language-plaintext highlighter-rouge\">pkg:spec/ietf/rfc9110@2022</code>, you’d need to normalize across all of these conventions. PURL already handles per-ecosystem naming differences for packages, so the approach isn’t unprecedented, but someone would need to define the type mappings and get buy-in from communities that see no reason to change. PURL itself is now a spec (ECMA-427), so the identifier scheme for tracking spec dependencies would itself be a spec dependency that needs tracking.</p>\n\n<p>Making specs explicit doesn’t require solving the whole problem at once. Some of the data model already exists: <a href=\"https://spdx.github.io/spdx-spec/v3.0.1/\">SPDX 3.0</a> includes a <code class=\"language-plaintext highlighter-rouge\">hasSpecification</code> relationship type linking software elements to specifications, and <a href=\"https://cyclonedx.org/\">CycloneDX 1.6</a> introduced “definitions” for standards and “declarations” for conformance attestation. But no package manager reads any of this, and no SBOM generator populates it automatically. A <code class=\"language-plaintext highlighter-rouge\">spec</code> field in package metadata, even if it were just a list of RFC numbers or W3C shortnames, would let tooling answer questions that are currently impossible: which packages implement RFC 9110, how many depend on Unicode 15 character properties, which of your dependencies still implement TLS 1.2 and need to migrate. Spec authors, currently invisible in the software supply chain, would get the same transitive-dependent counts that help make the case for funding open source libraries. The Sovereign Tech Agency funds protocol implementations like curl and OpenSSL and is <a href=\"https://bsky.app/profile/sovereign.tech/post/3menmziyjy225\">starting to explore</a> supporting standards work directly, but nobody can yet point to a number and say this RFC has 400,000 transitive dependents.</p>",
    "description": "RFC 9110 is a phantom dependency with thousands of transitive dependents.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-23T10:00:00+00:00",
    "fetched_at": "2026-02-23T12:23:19.902132",
    "url_hash": "3e75c795f3c19e8c05a03eceed6e09b8"
  },
  {
    "title": "How AI Labs Proliferate",
    "link": "https://blog.jim-nielsen.com/2026/how-ai-labs-proliferate/",
    "content": "<p>SITUATION: there are 14 competing AI labs.</p>\n<p>“We can’t trust any of these people with super-intelligence. We need to build it ourselves to ensure it’s done right!&quot;</p>\n<p>“YEAH!”</p>\n<p>SOON: there are 15 competing AI labs.</p>\n<p>(See: <a href=\"https://xkcd.com/927/\" >xkcd on standards</a>.)</p>\n<hr>\n<p>The irony: “we’re the responsible ones” is each lab’s founding mythology as they spin out of each other.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a\n        href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/how-ai-labs-proliferate/\"\n        >Email</a\n      >\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>\n\n    \n  ",
    "description": "SITUATION: there are 14 competing AI labs. “We can’t trust any of these people with super-intelligence. We need to build it ourselves to ensure it’s done right!&quot; “YEAH!” SOON: there are 15 competing AI labs. (See: xkcd on standards.) The irony: “we’re the responsible ones” is each lab’s founding mythology as they spin out of each other. Reply via: Email · Mastodon · Bluesky",
    "is_fulltext": false,
    "source": "Jim Nielsen’s Blog",
    "pub_date": "Sun, 22 Feb 2026 19:00:00 GMT",
    "fetched_at": "2026-02-23T12:23:34.830708",
    "url_hash": "20827677d0ed43d00741aed8f0fcb633"
  }
]