[
  {
    "title": "go-size-analyzer",
    "link": "https://simonwillison.net/2026/Feb/24/go-size-analyzer/#atom-everything",
    "content": "\n    \n<p><strong><a href=\"https://github.com/Zxilly/go-size-analyzer\">go-size-analyzer</a></strong></p>\nThe Go ecosystem is <em>really</em> good at tooling. I just learned about this tool for analyzing the size of Go binaries using a pleasing treemap view of their bundled dependencies.</p>\n<p>You can install and run the tool locally, but it's also compiled to WebAssembly and hosted at <a href=\"https://gsa.zxilly.dev/\">gsa.zxilly.dev</a> - which means you can open compiled Go binaries and analyze them directly in your browser.</p>\n<p>I tried it with a 8.1MB macOS compiled copy of my Go <a href=\"https://github.com/simonw/showboat\">Showboat</a> tool and got this:</p>\n<p><img alt=\"Treemap visualization of a Go binary named &quot;showboat&quot; showing size breakdown across four major categories: &quot;Unknown Sections Size&quot; (containing __rodata __TEXT, __rodata __DATA_CONST, __data __DATA, and Debug Sections Size with __zdebug_line __DWARF, __zdebug_loc __DWARF, __zdebug_info __DWARF), &quot;Std Packages Size&quot; (showing standard library packages like runtime, net, crypto, reflect, math, os, fmt, strings, syscall, context, and many subpackages such as crypto/tls, crypto/x509, net/http, with individual .go files visible at deeper levels), &quot;Main Packages Size&quot; (showing main, showboat, cmd), and &quot;Generated Packages Size&quot; (showing &lt;autogenerated&gt;). A tooltip is visible over __zdebug_line __DWARF showing: Section: __zdebug_line __DWARF, Size: 404.44 KB, File Size: 404.44 KB, Known size: 0 B, Unknown size: 404.44 KB, Offset: 0x52814a – 0x58d310, Address: 0x1005c014a – 0x1005c5310, Memory: false, Debug: true. The treemap uses green for main/generated packages, blue-gray for unknown sections, and shades of purple/pink for standard library packages.\" src=\"https://static.simonwillison.net/static/2026/showboat-treemap.jpg\" />\n\n    <p><small></small>Via <a href=\"https://www.datadoghq.com/blog/engineering/agent-go-binaries/\">Datadog: How we reduced the size of our Agent Go binaries by up to 77%</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/go\">go</a>, <a href=\"https://simonwillison.net/tags/webassembly\">webassembly</a>, <a href=\"https://simonwillison.net/tags/showboat\">showboat</a></p>\n\n\n\n",
    "description": "go-size-analyzer The Go ecosystem is really good at tooling. I just learned about this tool for analyzing the size of Go binaries using a pleasing treemap view of their bundled dependencies. You can install and run the tool locally, but it's also compiled to WebAssembly and hosted at gsa.zxilly.dev - which means you can open compiled Go binaries and analyze them directly in your browser. I tried it with a 8.1MB macOS compiled copy of my Go Showboat tool and got this: Via Datadog: How we reduced ",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-24T16:10:06+00:00",
    "fetched_at": "2026-02-25T00:40:49.642219",
    "url_hash": "ec6f529060e8aef36845f37254afba35"
  },
  {
    "title": "Upgrade: ‘The Shifting Sands of Liquid Glass’",
    "link": "https://www.relay.fm/upgrade/604",
    "content": "\n<p>Jason Snell and Myke Hurley:</p>\n\n<blockquote>\n  <p>We discuss the results of the Six Colors Apple Report Card for\n2025 in depth, with our added opinions on every category. Jason\nchooses to be a rascal, and Myke tries to give ten out of five.</p>\n</blockquote>\n\n<p>Upgrade is always a good podcast, but their annual “Jason discusses this year’s Apple Report Card” episode is always one of my favorites. But when Jason got “rascally” regarding MacOS 26 Tahoe in this one, I wanted to reach out and strangle him.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Upgrade: ‘The Shifting Sands of Liquid Glass’’\"  href=\"https://daringfireball.net/linked/2026/02/24/upgrade-shifting-sands\">&nbsp;★&nbsp;</a>\n</div>\n\n\t",
    "description": "",
    "is_fulltext": true,
    "source": "Daring Fireball",
    "pub_date": "2026-02-24T23:29:31Z",
    "fetched_at": "2026-02-25T00:40:51.129387",
    "url_hash": "2dcb6536db84ef876d1efa5165b44c4b"
  },
  {
    "title": "Implementing a clear room Z80 / ZX Spectrum emulator with Claude Code",
    "link": "\nhttp://antirez.com/news/160\n",
    "content": "Anthropic recently released a blog post with the description of an experiment in which the last version of Opus, the 4.6, was instructed to write a C compiler in Rust, in a “clean room” setup.\n<br>\n<br>The experiment methodology left me dubious about the kind of point they wanted to make. Why not provide the agent with the ISA documentation? Why Rust? Writing a C compiler is exactly a giant graph manipulation exercise: the kind of program that is harder to write in Rust. Also, in a clean room experiment, the agent should have access to all the information about well established computer science progresses related to optimizing compilers: there are a number of papers that could be easily synthesized in a number of markdown files. SSA, register allocation, instructions selection and scheduling. Those things needed to be researched *first*, as a prerequisite, and the implementation would still be “clean room”.\n<br>\n<br>Not allowing the agent to access the Internet, nor any other compiler source code, was certainly the right call. Less understandable is the almost-zero steering principle, but this is coherent with a certain kind of experiment, if the goal was showcasing the completely autonomous writing of a large project. Yet, we all know how this is not how coding agents are used in practice, most of the time. Who uses coding agents extensively knows very well how, even never touching the code, a few hits here and there completely changes the quality of the result.\n<br>\n<br># The Z80 experiment\n<br>\n<br>I thought it was time to try a similar experiment myself, one that would take one or two hours at max, and that was compatible with my Claude Code Max plan: I decided to write a Z80 emulator, and then a ZX Spectrum emulator (and even more, a CP/M emulator, see later) in a condition that I believe makes a more sense as “clean room” setup. The result can be found here: https://github.com/antirez/ZOT.\n<br>\n<br># The process I used\n<br>\n<br>1. I wrote a markdown file with the specification of what I wanted to do. Just English, high level ideas about the scope of the Z80 emulator to implement. I said things like: it should execute a whole instruction at a time, not a single clock step, since this emulator must be runnable on things like an RP2350 or similarly limited hardware. The emulator should correctly track the clock cycles elapsed (and I specified we could use this feature later in order to implement the ZX Spectrum contention with ULA during memory accesses), provide memory access callbacks, and should emulate all the known official and unofficial instructions of the Z80.\n<br>\n<br>For the Spectrum implementation, performed as a successive step, I provided much more information in the markdown file, like, the kind of rendering I wanted in the RGB buffer, and how it needed to be optional so that embedded devices could render the scanlines directly as they transferred them to the ST77xx display (or similar), how it should be possible to interact with the I/O port to set the EAR bit to simulate cassette loading in a very authentic way, and many other desiderata I had about the emulator.\n<br>\n<br>This file also included the rules that the agent needed to follow, like:\n<br>\n<br>* Accessing the internet is prohibited, but you can use the specification and test vectors files I added inside ./z80-specs.\n<br>* Code should be simple and clean, never over-complicate things.\n<br>* Each solid progress should be committed in the git repository.\n<br>* Before committing, you should test that what you produced is high quality and that it works.\n<br>* Write a detailed test suite as you add more features. The test must be re-executed at every major change.\n<br>* Code should be very well commented: things must be explained in terms that even people not well versed with certain Z80 or Spectrum internals details should understand.\n<br>* Never stop for prompting, the user is away from the keyboard.\n<br>* At the end of this file, create a work in progress log, where you note what you already did, what is missing. Always update this log.\n<br>* Read this file again after each context compaction.\n<br>\n<br>2. Then, I started a Claude Code session, and asked it to fetch all the useful documentation on the internet about the Z80 (later I did this for the Spectrum as well), and to extract only the useful factual information into markdown files. I also provided the binary files for the most ambitious test vectors for the Z80, the ZX Spectrum ROM, and a few other binaries that could be used to test if the emulator actually executed the code correctly. Once all this information was collected (it is part of the repository, so you can inspect what was produced) I completely removed the Claude Code session in order to make sure that no contamination with source code seen during the search was possible.\n<br>\n<br>3. I started a new session, and asked it to check the specification markdown file, and to check all the documentation available, and start implementing the Z80 emulator. The rules were to never access the Internet for any reason (I supervised the agent while it was implementing the code, to make sure this didn’t happen), to never search the disk for similar source code, as this was a “clean room” implementation.\n<br>\n<br>4. For the Z80 implementation, I did zero steering. For the Spectrum implementation I used extensive steering for implementing the TAP loading. More about my feedback to the agent later  in this post.\n<br>\n<br>5. As a final step, I copied the repository in /tmp, removed the “.git” repository files completely, started a new Claude Code (and Codex) session and claimed that the implementation was likely stolen or too strongly inspired from somebody else's work. The task was to check with all the major Z80 implementations if there was evidence of theft. The agents (both Codex and Claude Code), after extensive search, were not able to find any evidence of copyright issues. The only similar parts were about well established emulation patterns and things that are Z80 specific and can’t be made differently, the implementation looked distinct from all the other implementations in a significant way.\n<br>\n<br># Results\n<br>\n<br>Claude Code worked for 20 or 30 minutes in total, and produced a Z80 emulator that was able to pass ZEXDOC and ZEXALL, in 1200 lines of very readable and well commented C code (1800 lines with comments and blank spaces). The agent was prompted zero times during the implementation, it acted absolutely alone. It never accessed the internet, and the process it used to implement the emulator was of continuous testing, interacting with the CP/M binaries implementing the ZEXDOC and ZEXALL, writing just the CP/M syscalls needed to produce the output on the screen. Multiple times it also used the Spectrum ROM and other binaries that were available, or binaries it created from scratch to see if the emulator was working correctly. In short: the implementation was performed in a very similar way to how a human programmer would do it, and not outputting a complete implementation from scratch “uncompressing” it from the weights. Instead, different classes of instructions were implemented incrementally, and there were bugs that were fixed via integration tests, debugging sessions, dumps, printf calls, and so forth.\n<br>\n<br># Next step: the ZX Spectrum\n<br>\n<br>I repeated the process again. I instructed the documentation gathering session very accurately about the kind of details I wanted it to search on the internet, especially the ULA interactions with RAM access, the keyboard mapping, the I/O port, how the cassette tape worked and the kind of PWM encoding used, and how it was encoded into TAP or TZX files.\n<br>\n<br>As I said, this time the design notes were extensive since I wanted this emulator to be specifically designed for embedded systems, so only 48k emulation, optional framebuffer rendering, very little additional memory used (no big lookup tables for ULA/Z80 access contention), ROM not copied in the RAM to avoid using additional 16k of memory, but just referenced during the initialization (so we have just a copy in the executable), and so forth.\n<br>\n<br>The agent was able to create a very detailed documentation about the ZX Spectrum internals. I provided a few .z80 images of games, so that it could test the emulator in a real setup with real software. Again, I removed the session and started fresh. The agent started working and ended 10 minutes later, following a process that really fascinates me, and that probably you know very well: the fact is, you see the agent working using a number of diverse skills. It is expert in everything programming related, so as it was implementing the emulator, it could immediately write a detailed instrumentation code to “look” at what the Z80 was doing step by step, and how this changed the Spectrum emulation state. In this respect, I believe automatic programming to be already super-human, not in the sense it is currently capable of producing code that humans can’t produce, but in the concurrent usage of different programming languages, system programming techniques, DSP stuff, operating system tricks, math, and everything needed to reach the result in the most immediate way.\n<br>\n<br>When it was done, I asked it to write a simple SDL based integration example. The emulator was immediately able to run the Jetpac game without issues, with working sound, and very little CPU usage even on my slow Dell Linux machine (8% usage of a single core, including SDL rendering).\n<br>\n<br>Once the basic stuff was working, I wanted to load TAP files directly, simulating cassette loading. This was the first time the agent missed a few things, specifically about the timing the Spectrum loading routines expected, and here we are in the territory where LLMs start to perform less efficiently: they can’t easily run the SDL emulator and see the border changing as data is received and so forth. I asked Claude Code to do a refactoring so that zx_tick() could be called directly and was not part of zx_frame(), and to make zx_frame() a trivial wrapper. This way it was much simpler to sync EAR with what it expected, without callbacks or the wrong abstractions that it had implemented. After such change, a few minutes later the emulator could load a TAP file emulating the cassette without problems.\n<br>\n<br>This is how it works now:\n<br>\n<br>            do {\n<br>                zx_set_ear(zx, tzx_update(&tape, zx->cpu.clocks));\n<br>            } while (!zx_tick(zx, 0));\n<br>\n<br>I continued prompting Claude Code in order to make the key bindings more useful and a few things more.\n<br>\n<br># CP/M\n<br>\n<br>\n<br>One thing that I found really interesting was the ability of the LLM to inspect the COM files for ZEXALL / ZEXCOM tests for the Z80, easily spot the CP/M syscalls that were used (a total of three), and implement them for the extended z80 test (executed by make fulltest). So, at this point, why not implement a full CP/M environment? Same process again, same good result in a matter of minutes. This time I interacted with it a bit more for the VT100 / ADM3 terminal escapes conversions, reported things not working in WordStar initially, and in a few minutes everything I tested was working well enough (but, there are fixes to do, like simulating a 2Mhz clock, right now it runs at full speed making CP/M games impossible to use).\n<br>\n<br>\n<br># What is the lesson here?\n<br>\n<br>The obvious lesson is: always provide your agents with design hints and extensive documentation about what they are going to do. Such documentation can be obtained by the agent itself. And, also, make sure the agent has a markdown file with the rules of how to perform the coding tasks, and a trace of what it is doing, that is updated and read again quite often.\n<br>\n<br>But those tricks, I believe, are quite clear to everybody that has worked extensively with automatic programming in the latest months. To think in terms of “what a human would need” is often the best bet, plus a few LLMs specific things, like the forgetting issue after context compaction, the continuous ability to verify it is on the right track, and so forth.\n<br>\n<br>Returning back to the Anthropic compiler attempt: one of the steps that the agent failed was the one that was more strongly related to the idea of memorization of what is in the pretraining set: the assembler. With extensive documentation, I can’t see any way Claude Code (and, even more, GPT5.3-codex, which is in my experience, for complex stuff, more capable) could fail at producing a working assembler, since it is quite a mechanical process. This is, I think, in contradiction with the idea that LLMs are memorizing the whole training set and uncompress what they have seen. LLMs can memorize certain over-represented documents and code, but while they can extract such verbatim parts of the code if prompted to do so, they don’t have a copy of everything they saw during the training set, nor they spontaneously emit copies of already seen code, in their normal operation. We mostly ask LLMs to create work that requires assembling different knowledge they possess, and the result is normally something that uses known techniques and patterns, but that is new code, not constituting a copy of some pre-existing code.\n<br>\n<br>It is worth noting, too, that humans often follow a less rigorous process compared to the clean room rules detailed in this blog post, that is: humans often download the code of different implementations related to what they are trying to accomplish, read them carefully, then try to avoid copying stuff verbatim but often times they take strong inspiration. This is a process that I find perfectly acceptable, but it is important to take in mind what happens in the reality of code written by humans. After all, information technology evolved so fast even thanks to this massive cross pollination effect.\n<br>\n<br>For all the above reasons, when I implement code using automatic programming, I don’t have problems releasing it MIT licensed, like I did with this Z80 project. In turn, this code base will constitute quality input for the next LLMs training, including open weights ones.\n<br>\n<br>\n<br># Next steps\n<br>\n<br>To make my experiment more compelling, one should try to implement a Z80 and ZX Spectrum emulator without providing any documentation to the agent, and then compare the result of the implementation. I didn’t find the time to do it, but it could be quite informative.\n<a href=\"http://antirez.com/news/160\">Comments</a>",
    "description": "Anthropic recently released a blog post with the description of an experiment in which the last version of Opus, the 4.6, was instructed to write a C compiler in Rust, in a “clean room” setup. The experiment methodology left me dubious about the kind of point they wanted to make. Why not provide the agent with the ISA documentation? Why Rust? Writing a C compiler is exactly a giant graph manipulation exercise: the kind of program that is harder to write in Rust. Also, in a clean room experiment,",
    "is_fulltext": true,
    "source": "\n<antirez>\n",
    "pub_date": "Tue, 24 Feb 2026 18:58:02 +0100",
    "fetched_at": "2026-02-25T00:40:53.908208",
    "url_hash": "7b867b3f45617a031f1f8472eb30e0d4"
  },
  {
    "title": "Adding OpenStreetMap login to Auth0",
    "link": "https://shkspr.mobi/blog/2026/02/adding-openstreetmap-login-to-auth0/",
    "content": "<p>So you want to add OSM as an OAuth provider to Auth0? Here's a tip - you do <em>not</em> want to create a custom social connection!</p>\n\n<p>Instead, you need to create an \"OpenID Connect\" provider. Here's how.</p>\n\n<h2 id=\"opensteetmap\"><a href=\"https://shkspr.mobi/blog/2026/02/adding-openstreetmap-login-to-auth0/#opensteetmap\">OpenSteetMap</a></h2>\n\n<p>As per <a href=\"https://wiki.openstreetmap.org/wiki/OAuth#Using_OpenStreetMap_as_identity_provider\">the OAuth documentation</a> you will need to:</p>\n\n<ul>\n<li>Register a new app at <a href=\"https://www.openstreetmap.org/oauth2/applications/\">https://www.openstreetmap.org/oauth2/applications/</a></li>\n<li>Give it a name that users will recognise</li>\n<li>Give it a redirect of <code>https://Your Auth0 Tenant.eu.auth0.com/login/callback</code></li>\n<li>Tick the box for \"Sign in using OpenStreetMap\"</li>\n</ul>\n\n<p>Once created, you will need to securely save your Client ID and Client Secret.</p>\n\n<h2 id=\"auth0\"><a href=\"https://shkspr.mobi/blog/2026/02/adding-openstreetmap-login-to-auth0/#auth0\">Auth0</a></h2>\n\n<p>These options change frequently, so use this guide with care.</p>\n\n<ul>\n<li>Once you have logged in to your Auth0 Tennant, go to Authentication → Enterprise → OpenID Connect → Create Connection</li>\n<li>Provide the new connection with the Client ID and Client Secret</li>\n<li>Set the \"scope\" to be <code>openid</code></li>\n<li>Set the OpenID Connect Discovery URL to be <code>https://www.openstreetmap.org/.well-known/openid-configuration</code></li>\n<li>In the \"Login Experience\" tick the box for \"Display connection as a button\"</li>\n<li>Set the favicon to be <code>https://blog.openstreetmap.org/wp-content/uploads/2022/07/osm-favicon.png</code> or other suitable graphic</li>\n</ul>\n\n<h2 id=\"next-steps\"><a href=\"https://shkspr.mobi/blog/2026/02/adding-openstreetmap-login-to-auth0/#next-steps\">Next Steps</a></h2>\n\n<p>We're not quite done, sadly.</p>\n\n<p>The details which OSM sends back to Auth0 are limited, so Auth0 is missing a few bits:</p>\n\n<pre><code class=\"language-json\">{\n    \"created_at\": \"2026-02-29T12:34:56.772Z\",\n    \"identities\": [\n        {\n            \"user_id\": \"openstreetmap-openid|123456\",\n            \"provider\": \"oidc\",\n            \"connection\": \"openstreetmap-openid\",\n            \"isSocial\": false\n        }\n    ],\n    \"name\": \"\",\n    \"nickname\": \"\",\n    \"picture\": \"https://cdn.auth0.com/avatars/default.png\",\n    \"preferred_username\": \"Terence Eden\",\n    \"updated_at\": \"2026-02-04T12:01:33.772Z\",\n    \"user_id\": \"oidc|openstreetmap-openid|123456\",\n    \"last_ip\": \"12.34.56.78\",\n    \"last_login\": \"2026-02-29T12:34:56.772Z\",\n    \"logins_count\": 1,\n    \"blocked_for\": [],\n    \"guardian_authenticators\": [],\n    \"passkeys\": []\n}\n</code></pre>\n\n<p>Annoyingly, Auth0 doesn't set a name or nickname - so you'll need to manually get the <code>preferred_username</code>, or create a \"User Map\":</p>\n\n<pre><code class=\"language-json\">{\n  \"mapping_mode\": \"use_map\",\n  \"attributes\": {\n    \"nickname\": \"${context.tokenset.preferred_username}\",\n    \"name\":     \"${context.tokenset.preferred_username}\"\n  }\n}\n</code></pre>\n\n<p>There's also no avatar image - only the default one.</p>\n\n<h3 id=\"getting-the-avatar-image\"><a href=\"https://shkspr.mobi/blog/2026/02/adding-openstreetmap-login-to-auth0/#getting-the-avatar-image\">Getting the Avatar Image</a></h3>\n\n<p>The <a href=\"https://wiki.openstreetmap.org/wiki/API_v0.6\">OSM API</a> has a method for <a href=\"https://wiki.openstreetmap.org/wiki/API_v0.6#Methods_for_user_data\">getting user data</a>.</p>\n\n<p>For example, here's all my public data: <a href=\"https://api.openstreetmap.org/api/0.6/user/98672.json\">https://api.openstreetmap.org/api/0.6/user/98672.json</a> - thankfully no authorisation required!</p>\n\n<pre><code class=\"language-json\">{\n  \"user\": {\n    \"id\": 98672,\n    \"display_name\": \"Terence Eden\",\n    \"img\": {\n      \"href\": \"https://www.gravatar.com/avatar/52cb49a66755f31abf4df9a6549f0f9c.jpg?s=100&amp;d=https%3A%2F%2Fapi.openstreetmap.org%2Fassets%2Favatar_large-54d681ddaf47c4181b05dbfae378dc0201b393bbad3ff0e68143c3d5f3880ace.png\"\n    }\n  }\n}\n</code></pre>\n\n<p>Alternatively, you can <a href=\"https://github.com/microlinkhq/unavatar/issues/488\">use the Unavatar service</a> to get the image indirectly.</p>\n\n<p>I hope that's helpful to someone!</p>\n",
    "description": "So you want to add OSM as an OAuth provider to Auth0? Here&#039;s a tip - you do not want to create a custom social connection! Instead, you need to create an &#34;OpenID Connect&#34; provider. Here&#039;s how. OpenSteetMap As per the OAuth documentation you will need to: Register a new app at https://www.openstreetmap.org/oauth2/applications/ Give it a name that users will recognise Give it a redirect of…",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Tue, 24 Feb 2026 12:34:21 +0000",
    "fetched_at": "2026-02-25T00:40:59.743585",
    "url_hash": "33c0a0bac5d3072bfa7d47e52ee9a71c"
  },
  {
    "title": "Customizing the ways the dialog manager dismisses itself: Isolating the Close pathway",
    "link": "https://devblogs.microsoft.com/oldnewthing/20260224-00/?p=112082",
    "content": "<p>We started by <a title=\"Exploring the signals the dialog manager uses for dismissing a dialog\" href=\"https://devblogs.microsoft.com/oldnewthing/20260219-00/?p=112072\"> exploring the signals the dialog manager uses for dismissing a dialog</a>. Now we can use that information to customize the dismiss behavior.</p>\n<p>Let&#8217;s start with a diagram, because people like diagrams.</p>\n<table class=\"cp3\" style=\"border-collapse: separate; text-align: center;\" border=\"0\" cellspacing=\"0\" cellpadding=\"3\">\n<tbody>\n<tr>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"border: solid 1px currentcolor;\"><tt>WM_<wbr />SYS­COMMAND</tt>/<br />\n<tt>SC_<wbr />CLOSE</tt></td>\n<td>←</td>\n<td style=\"border: dashed 1px currentcolor; border-radius: 1ex;\">Close button/<br />\n<kbd>Alt</kbd>+<kbd>F4</kbd>/<br />\nSystem menu Close</td>\n</tr>\n<tr>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>↓</td>\n</tr>\n<tr>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td style=\"border: solid 1px currentcolor;\"><tt>WM_<wbr />CLOSE</tt></td>\n<td>&nbsp;</td>\n<td style=\"border: dashed 1px currentcolor; border-radius: 1ex;\">User hits <kbd>ESC</kbd></td>\n</tr>\n<tr>\n<td>&nbsp;</td>\n<td>&nbsp;</td>\n<td>↓</td>\n<td>&nbsp;</td>\n<td>↓</td>\n</tr>\n<tr>\n<td style=\"border: dashed 1px currentcolor; border-radius: 1ex;\">User clicks<br />\nCancel button</td>\n<td>→</td>\n<td style=\"border: solid 1px currentcolor;\"><tt>WM_<wbr />COMMAND</tt>/<br />\n<tt>BN_CLICK</tt>/<br />\n<tt>IDCANCEL</tt></td>\n<td>←</td>\n<td style=\"border: solid 1px currentcolor;\"><tt>Is­Dialog­Message</tt></td>\n</tr>\n</tbody>\n</table>\n<p>We noted at the end of that article that if you have a button whose ID is <code>IDCANCEL</code>, the dialog manager will defer to that button to decide whether to allow <kbd>ESC</kbd> key, the Close button, or other nonclient affordances to convert the corresponding action to a simulated click on that button. So the obvious way to take advantage of this is to put a Cancel button on your dialog box, and disable it when you don&#8217;t want the user to dismiss the dialog box with the <code>ESC</code> key, the Close button, or other standard affordances.¹</p>\n<p>Notice that everything in the diagram funnels into <code>WM_<wbr />COMMAND</code>/<wbr /><code>IDCANCEL</code>, even if you don&#8217;t actually have a control whose ID is <code>IDCANCEL</code>. If you add a handler to your dialog procedure for <code>WM_<wbr />COMMAND</code>, then all of the actions will come through that handler, and you can customize the behavior at that point. You could call <code>EndDialog</code> to close the dialog or just return without doing anything to keep the dialog open.</p>\n<p>Now, if you have no intention of closing the dialog in response to the Close button or the system menu Close command, then you probably shouldn&#8217;t leave them enabled. You can gray those out by doing</p>\n<pre>    EnableMenuItem(GetSystemMenu(hDlg, FALSE), SC_CLOSE,\n                   MF_BYCOMMAND | MF_DISABLED | MF_GRAYED);\n</pre>\n<p>Okay, but what if you want to treat the Close button differently?</p>\n<p>From the diagram, we see that the Close button goes through a <code>WM_<wbr />CLOSE</code> phase, so you can handle the <code>WM_<wbr />CLOSE</code> message in your dialog procedure to do whatever custom Close button behavior you want. If you return <code>TRUE</code> from the dialog procedure, then that will mark the message as handled, and further processing will stop. if you return <code>FALSE</code>, then the <code>Def­Dlg­Proc</code> will turn the <code>WM_<wbr />CLOSE</code> into the <code>WM_<wbr />COMMAND</code> message as before.</p>\n<p>If you want to treat the <kbd>ESC</kbd> key differently from a click on the Cancel button, you&#8217;ll have to intercept it on the <code>Is­Dialog­Message</code> path. We&#8217;ll look at that next time.</p>\n<p>¹ Now, you might notice that there is no requirement that the <code>IDCANCEL</code> button be in the tab order, or that it even be visible. The dialog manager merely checks whether it is enabled. Therefore, you might be tempted to control these actions by disabling your (invisible, non-tabbable) <code>IDCANCEL</code> button. This is sneaky, but it will probably confuse assistive technology tools, and anybody else who inspects the window hierarchy, and besides, it&#8217;s more complicated than the other alternatives presented here.</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/oldnewthing/20260224-00/?p=112082\">Customizing the ways the dialog manager dismisses itself: Isolating the Close pathway</a> appeared first on <a href=\"https://devblogs.microsoft.com/oldnewthing\">The Old New Thing</a>.</p>\n",
    "description": "Intercepting the flow in your message loop. The post Customizing the ways the dialog manager dismisses itself: Isolating the Close pathway appeared first on The Old New Thing.",
    "is_fulltext": true,
    "source": "The Old New Thing",
    "pub_date": "Tue, 24 Feb 2026 15:00:00 +0000",
    "fetched_at": "2026-02-25T00:41:03.382188",
    "url_hash": "7764ab8baf581097e46d1291ee39dfed"
  },
  {
    "title": "A curious trig identity",
    "link": "https://www.johndcook.com/blog/2026/02/24/a-curious-trig-identity/",
    "content": "<p>Here is an identity that doesn&#8217;t look correct but it is. For real <em>x</em> and <em>y</em>,</p>\n<p><img decoding=\"async\" class=\"aligncenter\" style=\"background-color: white;\" src=\"https://www.johndcook.com/robinson1.svg\" alt=\"|\\sin(x + iy)| = |\\sin x + \\sin iy|\" width=\"237\" height=\"18\" /></p>\n<p>I found the identity in [1]. The author&#8217;s proof is short. First of all,</p>\n<p><img decoding=\"async\" class=\"aligncenter\" style=\"background-color: white;\" src=\"https://www.johndcook.com/robinson2.svg\" alt=\"\\begin{align*} \\sin(x + iy) &amp;= \\sin x \\cos iy + \\cos x \\sin iy \\\\ &amp;= \\sin x \\cosh y + i \\cos x \\sinh y \\end{align*}\" width=\"319\" height=\"47\" /></p>\n<p>Then</p>\n<p><img fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter\" style=\"background-color: white;\" src=\"https://www.johndcook.com/robinson3.svg\" alt=\"\\begin{align*} |\\sin(x + iy)|^2 &amp;= \\sin^2 x \\cosh^2 y + \\cos^2 x \\sinh^2 y \\\\ &amp;= \\sin^2 x (1 + \\sinh^2 y) + (1 -\\sin^2x) \\sinh^2 y \\\\ &amp;= \\sin^2 x + \\sinh^2 y \\\\ &amp;= |\\sin x + i \\sinh y|^2 \\\\ &amp;= |\\sin x + \\sin iy|^2 \\end{align*} \" width=\"448\" height=\"151\" /></p>\n<p>Taking square roots completes the proof.</p>\n<p>Now note that the statement at the top assumed <em>x</em> and <em>y</em> are real. You can see that this assumption is necessary by, for example, setting <em>x</em> = 2 and <em>y</em> = <em>i</em>.</p>\n<p>Where does the proof use the assumption that <em>x</em> and <em>y</em> are real? Are there weaker assumptions on <em>x</em> and <em>y</em> that are sufficient?</p>\n<p>&nbsp;</p>\n<p>[1] R. M. Robinson. A curious trigonometric identity. American Mathematical Monthly. Vol 64, No 2. (Feb. 1957). pp 83–85</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/24/a-curious-trig-identity/\">A curious trig identity</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "Here is an identity that doesn&#8217;t look correct but it is. For real x and y, I found the identity in [1]. The author&#8217;s proof is short. First of all, Then Taking square roots completes the proof. Now note that the statement at the top assumed x and y are real. You can see that this assumption is necessary [&#8230;] The post A curious trig identity first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Tue, 24 Feb 2026 23:33:41 +0000",
    "fetched_at": "2026-02-25T00:41:17.501134",
    "url_hash": "dce8cc72d6286454a17dfa7577e171c1"
  },
  {
    "title": "Flake Checks in Shell",
    "link": "https://entropicthoughts.com/flake-checks-in-shell",
    "content": "",
    "description": "",
    "is_fulltext": false,
    "source": "Entropic Thoughts",
    "pub_date": "Tue, 24 Feb 2026 00:00:00 +0100",
    "fetched_at": "2026-02-25T00:41:28.845914",
    "url_hash": "a48ece2ceaa343b5b7c7f9ce45c2f4a3"
  },
  {
    "title": "Time to Move On – The Reason Relationships End",
    "link": "https://steveblank.com/2026/02/24/time-to-move-on-the-reason-relationships-end/",
    "content": "<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=WSr0_MIHYeg\"><i><span style=\"font-weight: 400;\">What Lies Ahead I have no Way of Knowing, But It’s Now Time to Get Going</span></i></a><i><span style=\"font-weight: 400;\"><br />\n</span></i><span style=\"font-weight: 400;\">Tom Petty</span></p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"33621\" data-permalink=\"https://steveblank.com/2026/02/24/time-to-move-on-the-reason-relationships-end/screenshot-23/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?fit=590%2C134&amp;ssl=1\" data-orig-size=\"590,134\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;Screenshot&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;Screenshot&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"Screenshot\" data-image-description=\"\" data-image-caption=\"&lt;p&gt;Screenshot&lt;/p&gt;\n\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?fit=300%2C68&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?fit=468%2C106&amp;ssl=1\" class=\" wp-image-33621\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?resize=93%2C21&#038;ssl=1\" alt=\"\" width=\"93\" height=\"21\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?resize=150%2C34&amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?resize=300%2C68&amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/philanthropy.org_.jpg?w=590&amp;ssl=1 590w\" sizes=\"(max-width: 93px) 100vw, 93px\" /> <span style=\"font-weight: 400;\">This post previously appeared in <a href=\"https://philanthropy.org\" target=\"_blank\" rel=\"noopener\">Philanthropy.org</a></span></p>\n<p><span style=\"font-weight: 400;\">A while ago I wrote about what happens in a startup when a new event creates a wake-up call that makes founding engineers reevaluate their jobs. (It’s worth a </span><a href=\"https://steveblank.com/2009/12/21/the-elves-leave-middle-earth-%E2%80%93-soda%E2%80%99s-are-no-longer-free/\"><span style=\"font-weight: 400;\">read here</span></a><span style=\"font-weight: 400;\">.)  Recently my wife and I had something happen that made us reevaluate a 25-year-old relationship.</span></p>\n<p><span style=\"font-weight: 400;\">These two bookends made me realize something larger: reevaluating all types of relationships – romantic, friendship, founders, business partnerships/ventures, and even countries &#8211; is a healthy and normal part of growing, getting older and, at times, wiser.</span></p>\n<hr />\n<p><b>First World Problem<br />\n</b><span style=\"font-weight: 400;\">We had a close relationship with a local nonprofit for over a quarter of a century. By close I mean their first executive director lived rent free in a property we owned, we provided resources when they most needed it, I had sat on their board, and when I was a public official I listened carefully to their input and suggestions, and helped them where I could. When I couldn&#8217;t do something they requested I called them and let them know why. They did the same for me. When their next executive director took over (he had been the number 2 to the previous director), the relationship continued, but in hindsight was a bit more distant. About a year ago they hired their third executive director. He had none of the history with us. And here comes the wake-up call.</span></p>\n<p><span style=\"font-weight: 400;\">I called to ask for his support on an issue </span><i><span style=\"font-weight: 400;\">very </span></i><span style=\"font-weight: 400;\">important to us. The conversation ended with what I thought was “I’ll consider it.” I never heard back. So I was surprised (but shouldn&#8217;t have been) to discover a public letter from the nonprofit taking the opposite point of view. In the past when we disagreed I got a phone call or email that said, “We heard you, but here’s why we’re going to do X and Y.” This time, and the first time in 25 years, crickets &#8211; I heard nothing.</span></p>\n<p><span style=\"font-weight: 400;\">This wasn’t the end of the world and truly is a first world problem &#8211; but it was a </span><i><span style=\"font-weight: 400;\">wake-up call</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">It took my wife and I about a week to take stock. We realized that the executive director didn&#8217;t do anything “wrong.” We weren’t “owed” a call. <em>The new director was looking forward unencumbered by the past, while we were looking backwards at the 25-year relationship</em>. Anything we did prior to his arrival obviously wasn&#8217;t on his radar. But it was a jarring change from how we interacted in the past.</span></p>\n<p><span style=\"font-weight: 400;\">We realized that our relationship had been on automatic pilot. Until then there was no reason to rethink it. Our original support was for work this nonprofit had been doing at the turn of this century. Now that was no longer their core mission. And as we thought deeper we applied the same lens to reevaluate other organizations we were supporting. And no surprise, many of their missions had also changed, or in many cases our own interests were now elsewhere. </span></p>\n<p><span style=\"font-weight: 400;\">Wake-up calls happen when you realize the contract you believed in isn’t shared anymore.</span></p>\n<p><span style=\"font-weight: 400;\">In the end, we are now supporting a new generation of non-profits.</span></p>\n<p><span style=\"font-weight: 400;\">But it reminded me about the bigger picture and the nature of relationships.</span></p>\n<p><b>Most Relationships Aren’t Forever<br />\n</b><span style=\"font-weight: 400;\">Almost every one of us will go through breakups, either initiating them or being on the receiving end. Rather than thinking that equals failure, consider it a type of a </span><i><span style=\"font-weight: 400;\">life pivot</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Most of us grow up with a belief that “real” relationships are permanent. That if something mattered once, it should always matter in the same way. That longevity of a relationship alone equals success. It doesn’t. Permanence is comforting, but it isn’t how humans, markets, or institutions actually work. People travel with us for a while then the </span><a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC3894851/\"><span style=\"font-weight: 400;\">convoy</span></a><span style=\"font-weight: 400;\"> reconfigures as life roles and needs change.</span></p>\n<p><span style=\"font-weight: 400;\">People change. Leadership changes (in business and countries). Priorities change. Incentives change. Organizations change. Sometimes you change and the other side doesn’t. Sometimes it’s the opposite. Sometimes both change, just not in the same direction. None of that automatically means anyone failed. It usually means growth happened.</span></p>\n<p><img data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" data-attachment-id=\"33581\" data-permalink=\"https://steveblank.com/2026/02/24/time-to-move-on-the-reason-relationships-end/end-of-a-relationship/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?fit=720%2C393&amp;ssl=1\" data-orig-size=\"720,393\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"End of a Relationship\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?fit=300%2C164&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?fit=468%2C255&amp;ssl=1\" class=\"aligncenter size-full wp-image-33581\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?resize=468%2C255&#038;ssl=1\" alt=\"\" width=\"468\" height=\"255\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?w=720&amp;ssl=1 720w, https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?resize=300%2C164&amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2026/02/End-of-a-Relationship.jpg?resize=150%2C82&amp;ssl=1 150w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></p>\n<p><b>Why people move on<br />\n</b><span style=\"font-weight: 400;\">Moving on is often framed as disloyal or selfish. In practice, it’s usually neither. It’s reality finally catching up with a story you’ve been telling yourself. Common reasons:</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">The relationship was built for an earlier version of </span></i><span style=\"text-decoration: underline;\"><i><span style=\"font-weight: 400;\">you</span></i></span><span style=\"font-weight: 400;\">. At different stages of life we value different things: exploration, stability, achievement, meaning, time. A relationship can be good and still no longer fit.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">The relationship was built for an earlier version of </span></i><span style=\"text-decoration: underline;\"><i><span style=\"font-weight: 400;\">them</span></i></span><span style=\"font-weight: 400;\">. This happens often to co-founders in startups. Skills needed in the early stages are no longer the ones needed to scale. One of you learns new skills while the other is heads down doing what they’ve always done.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">The shared mission expires</span></i><span style=\"font-weight: 400;\">. Some relationships may be temporal or transactional. They exist to accomplish something specific: raise kids, start a company, survive a hard period, launch a project. When the mission ends, you discover what remains. (For founders it’s often done-and-gone and off to the next one.)</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">The implicit contract changes</span></i><span style=\"font-weight: 400;\">. Every relationship has unwritten rules: honesty, reciprocity, respect, no surprises, or, often fatal, a breach of trust. When those rules shift without discussion, friction appears. (Trust takes years to earn, but can be lost in a minute.)</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">Misalignment becomes chronic</span></i><span style=\"font-weight: 400;\">. Often there isn&#8217;t a single disagreement. It’s a pattern. You keep explaining away discomfort and keep lowering expectations. Eventually you realize you’re managing a declining relationship. You start calculating the lost opportunity cost of not moving on.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">The cost of staying rises</span></i><span style=\"font-weight: 400;\">. As you get older, you become more aware that time is finite. You grow less willing to spend it on relationships that consistently drain more than they return.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><i><span style=\"font-weight: 400;\">People and institutions drift from your goals</span></i><span style=\"font-weight: 400;\">. Individuals move toward comfort, status, and security. Organizations move toward new goals, new donors, different metrics, and survival at all costs. Sometimes that drift still matches you. Sometimes it doesn’t.</span></li>\n</ol>\n<blockquote><p><b>Lessons Learned</b></p>\n<ul>\n<li><span style=\"font-weight: 400;\">A wake-up call is an event that shatters your current view of a relationship and forces you to reevaluate </span></li>\n<li><span style=\"font-weight: 400;\">You never know what will trigger a wake-up call</span></li>\n<li><span style=\"font-weight: 400;\">As we get older, we perceive time as more limited. We invest more in meaningful relationships and prune the rest.  </span>\n<ul>\n<li><span style=\"font-weight: 400;\">That doesn’t make us cynical, just more calibrated</span></li>\n</ul>\n</li>\n<li><span style=\"font-weight: 400;\">Time to reevaluate relationships when:</span>\n<ul>\n<li><span style=\"font-weight: 400;\">Values no longer align</span></li>\n<li><span style=\"font-weight: 400;\">You’re doing all the work</span></li>\n<li><span style=\"font-weight: 400;\">There’s a breakdown of trust</span></li>\n<li><span style=\"font-weight: 400;\">You would </span><span style=\"font-weight: 400;\">not </span><span style=\"font-weight: 400;\">be partnering with them if you met them today</span></li>\n</ul>\n</li>\n</ul>\n</blockquote>\n",
    "description": "What Lies Ahead I have no Way of Knowing, But It’s Now Time to Get Going Tom Petty This post previously appeared in Philanthropy.org A while ago I wrote about what happens in a startup when a new event creates a wake-up call that makes founding engineers reevaluate their jobs. (It’s worth a read here.) [&#8230;]",
    "is_fulltext": true,
    "source": "Steve Blank",
    "pub_date": "Tue, 24 Feb 2026 14:00:57 +0000",
    "fetched_at": "2026-02-25T00:41:49.395759",
    "url_hash": "c6ac454f7b8c9baaa9d9cd6e4c5740e0"
  }
]