[
  {
    "title": "10,000,000th Fibonacci number",
    "link": "https://www.johndcook.com/blog/2026/02/21/f10000000/",
    "content": "<p>I&#8217;ve written a couple times about Fibonacci numbers and certificates. Here the certificate is auxiliary data that makes it faster to confirm that the original calculation was correct.</p>\n<p>This post puts some timing numbers to this.</p>\n<p>I calculated the 10 millionth Fibonacci number using code from <a href=\"https://www.johndcook.com/blog/2026/02/08/computing-large-fibonacci-numbers/\">this post</a>.</p>\n<pre>n = 10_000_000    \nF = fib_mpmath(n)\n</pre>\n<p>This took 150.3 seconds.</p>\n<p>As I&#8217;ve discussed before, a number <em>f</em> is a Fibonacci number if and only if 5<em>f</em>² ± 4 is a square <em>r</em>². And for the <em>n</em>th Fibonacci number, we can take ± to be positive if <em>n</em> is even and negative if <em>n</em> is odd.</p>\n<p>I computed the certificate <em>r</em> with</p>\n<pre>r = isqrt(5*F**2 + 4 - 8*(n%2))</pre>\n<p>and this took 65.2 seconds.</p>\n<p>Verifying that <em>F</em> is correct with</p>\n<pre>n = abs(5*F**2 - r**2)\nassert(n == 4)\n</pre>\n<p>took 3.3 seconds.</p>\n<h2>About certificates</h2>\n<p>So in total it took 68.5 seconds to verify that <em>F</em> was correct. But if someone had pre-computed <em>r</em> and handed me <em>F</em> and <em>r</em> I could use <em>r</em> to verify the correctness of <em>F</em> in 3.3 seconds, about 2% of the time it took to compute <em>F</em>.</p>\n<p>Sometimes you can get a certificate of correctness for free because it is a byproduct of the problem you&#8217;re solving. Other times computing the certificate takes a substantial amount of work. Here computing <em>F</em> and <em>r</em> took about 40% more work than just computing <em>F</em>.</p>\n<p>What&#8217;s not typical about this example is that the solution provider carries out exactly the same process to create the certificate that someone receiving the solution without a certificate would do. Typically, even if the certificate isn&#8217;t free, it does come at a &#8220;discount,&#8221; i.e. the problem solver could compute the certificate more efficiently than someone given only the solution.</p>\n<h2>Proving you have the right Fibonacci number</h2>\n<p>Now suppose I have you the number <em>F</em> above and claim that it is the 10,000,000th Fibonacci number. You carry out the calculations above and say &#8220;OK, you&#8217;ve convinced me that <em>F</em> is <em>a</em> Fibonacci number, but how do I know it&#8217;s the 10,000,000th Fibonacci number?</p>\n<p>The 10,000,000th Fibonacci number has 2,089,877 digits. That&#8217;s almost enough information to verify that a Fibonacci number is indeed the 10,000,000th Fibonacci number. The log base 10 of the <em>n</em>th Fibonacci number is very nearly</p>\n<p style=\"padding-left: 40px;\"><em>n</em> log<sub>10</sub> φ − 0.5 log<sub>10</sub> 5</p>\n<p>based on Binet&#8217;s formula. From this we can determine that the <em>n</em>th Fibonacci number has 2,089,877 digits if <em>n</em> = 10,000,000 + <em>k</em> where <em>k</em> equals 0, 1, 2, or 3.</p>\n<p>Because</p>\n<p style=\"padding-left: 40px;\">log<sub>10</sub> <em>F</em><sub>10,000,000</sub> = 2089876.053014785</p>\n<p>and</p>\n<p style=\"padding-left: 40px;\">10<sup>0.053014785</sup> = 1.129834377783962</p>\n<p>we know that the first few digits of <em>F</em><sub>10,000,000</sub> are 11298…. If I give you a 2,089,877 digits that you can prove to be a Fibonacci number, and its first digit is 1, then you know it&#8217;s the 10,000,000th Fibonacci number.</p>\n<p>You could also verify the number by looking at the last digit. As I wrote about <a href=\"https://www.johndcook.com/blog/2015/08/04/last-digits-fibonacci-numbers/&quot;\">here</a>, the last digits of Fibonacci number have a period of 60. That means the last digit of the 10,000,000th Fibonacci number is the same as the last digit of the 40th Fibonacci number, which is 5. That is enough to rule out the other three possible Fibonacci numbers with 2,089,877 digits.</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/21/f10000000/\">10,000,000th Fibonacci number</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "I&#8217;ve written a couple times about Fibonacci numbers and certificates. Here the certificate is auxiliary data that makes it faster to confirm that the original calculation was correct. This post puts some timing numbers to this. I calculated the 10 millionth Fibonacci number using code from this post. n = 10_000_000 F = fib_mpmath(n) This [&#8230;] The post 10,000,000th Fibonacci number first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Sun, 22 Feb 2026 01:00:31 +0000",
    "fetched_at": "2026-02-22T12:15:13.155682",
    "url_hash": "dcd72f882f47ed11d39025c54062e48c"
  },
  {
    "title": "The Orality Theory of Everything",
    "link": "https://www.theatlantic.com/ideas/2026/02/social-media-literacy-crisis/686076/?utm_source=feed",
    "content": "<p>The world is full of theories of everything. The smartphone theory of everything argues that our personal devices are responsible for the rise of political polarization, anxiety, depression, and conspiracy theories—not to mention the decline of attention spans, intelligence, happiness, and general comity. The housing theory of everything pins inequality, climate change, obesity, and declining fertility on the West’s inability to build enough homes. If you treat theories of everything as literal theories of <i>everything</i>, you will be disappointed to find that they all have holes. I prefer to think of them as exercises in thinking through the ways that single phenomena can have large and unpredictable second-order effects.</p><p>My new favorite theory of everything is the orality theory of everything. This theory emerges from the work of mid-20th-century media theorists, especially Walter Ong and Marshall McLuhan. They argued that the invention of the alphabet and the rise of literacy were among the most important events in human history. These developments shifted communications from an age of orality—in which all information was spoken and all learning was social—to an age of literacy, in which writing could fix words in place, allowing people to write alone, read alone, and develop ever more complicated ideas that would have been impossible to memorize. The age of orality was an age of social storytelling and flexible cultural memory. The age of literacy made possible a set of abstract systems of thought—calculus, physics, advanced biology, quantum mechanics—that form the basis of all modern technology. But that’s not all, Ong and his ilk said. Literacy literally restructured our consciousness, and the demise of literate culture—the decline of reading and the rise of social media—is again transforming what it feels like to be a thinking person.</p><p>The most enthusiastic modern proponent of the orality theory of everything that I know of is <i>Bloomberg</i>’s Joe Weisenthal, the co-host of the <i>Odd Lots</i> podcast. We discussed orality, literacy, and the implications for politics, storytelling, expertise, social relations, and much more. The following transcript has been edited for clarity, brevity, and the goal of making both speakers sound a bit smarter.</p><hr class=\"c-section-divider\"><p><b>Derek Thompson:</b> The return of orality: Why do you think it explains everything?</p><p><b>Joe Weisenthal:</b> I don’t think it explains everything. I think it only explains 99 percent of everything.</p><p>I believe that human communication is becoming more oral. And by that I don’t just mean that people are talking more with their mouths, although I do think that is the case. It’s more that communication in general, whether in the spoken form or in the digital form, has the characteristics of conversation. And it truly harkens back to a time before, really, the written word, or certainly before mass literacy.</p><p>In 2016, during the presidential election, I started reading the work of Walter Ong. He was a Jesuit priest. He studied with Marshall McLuhan. He was at Saint Louis University and wrote this really incredible book called <i>Orality and Literacy</i>. The gist is that humans [in oral cultures] fundamentally think differently when they’re in this world that you <i>can’t</i> write anything down, that you <i>can’t</i> look anything up. For most of human history, there was no way to look up anything at all. There was no reference material and so forth. And as such, people had to optimize their communication for the conditions of that time.</p><p>Through a lot of study of Homer and other ancient epics, people realized that there were certain patterns of communication. People spoke with rhythm and rhyme and musicality, because it helps people memorize things. Certain phrases just get repeated over and over again. Repetition, communication, and information were optimized for memorability, in packets, and what we would call “going viral.” When I started reading this book, I was like, <i>Look, this has a lot of explanatory power</i>. These things that characterize the Homeric times—the way society prioritized and packaged information—greatly resemble what we see today. My big thesis is that as communication becomes more of this back-and-forthness, it’s changing the way that we communicate and the way we think.</p><p><b>Thompson: </b>To drill down on why the shift to literacy was so important for the way we think, for the way we transmit knowledge, for the way we build institutions, I want to quote two great scholars here. The first is Joshua Meyrowitz, an emeritus professor of communication at the University of New Hampshire. He writes in <i>No Sense of Place: The Impact of Electronic Media on Social Behavior</i>:</p><blockquote>\n<p>The break from total reliance on oral communication allows people to become more introspective, rational, and individualistic. Abstract thought develops. From the circular world of sound with its round huts and round villages, people move, over time, toward linear, cause and effect thinking, grid-like cities, and a one thing at a time and one thing after another world that mimics the linear lines of writing and type.</p>\n</blockquote><p>The second is from another great scholar named Joe Weisenthal:</p><blockquote>\n<p>Many of the things that modern institutions are built on—enlightenment thinking, formal logic, reason, meritocracy, examining the evidence—are downstream from the ability to contemplate the written word at a distance.</p>\n</blockquote><p>Why don’t you expand on either quote?</p><p><b>Weisenthal: </b>People can probably feel this. When you’re in a conversation, online or offline, what are you doing? You’re often trying to impress someone. You might be trying to one-up someone. Maybe if there’s a few people there, you’re trying to put someone down to look cool for the other person. These are all things that occur that don’t occur when you’re in solitude. A solo interaction with language can only be done really with the written word. Even setting aside the logical arguments for the connection between the alphabet and left-to-right thinking and linear thinking, most people, I think, could intuitively understand that interactive environments foster different priorities.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/2026/01/reading-crisis-solution-literature-personal-passion/685461/?utm_source=feed\">Adam Kirsch: Reading is a vice</a>]</i></p><p>When you’re writing a letter, or certainly, let’s say, you’re writing a book as you have, you don’t necessarily have the reader in mind at that exact moment. In fact, you have the luxury of writing and not having to think about what the reader is going to be doing at this moment. These are all luxuries that occur in the context of literacy—the written word—that are separate from a conversation. And so the written word creates all kinds of new opportunities to think through these things, to take time, to not respond right away.</p><p><b>Thompson: </b>Thinking used to be something that had to be done socially. It was impossible to learn <i>The Odyssey</i> on your own. It was transmitted to you from a person. You would rehearse it with someone else. The mode of information transfer was necessarily social. Books are written alone, and books are typically read alone. And so this age of literacy gave rise to this privilege of solitude and interiority that I think is really, really important.</p><p>Walter Ong, our mutual hero, has a great quote that I want to throw to you and then get your reaction to, because it goes right to this point. He said:</p><blockquote>\n<p>Human beings in primary oral cultures … do not “study.” They learn by apprenticeship—hunting with experienced hunters, for example—by discipleship, which is a kind of apprenticeship, by listening, by repeating what they hear, by mastering proverbs and ways of combining and recombining them … not by study in the strict sense.</p>\n</blockquote><p>I’m very interested in a phenomenon that I call the antisocial century, the idea that for a variety of reasons, we are spending much more time alone. And that is having a bunch of second- and third-order effects. And it really is interesting to me, as I was going deeper into this project, to think that it’s the age of literacy that in many ways allowed us to be alone as we learned, and to prize a certain kind of interiority.</p><p><b>Weisenthal: </b>Marshall McLuhan had this observation: The alphabet is the most detribalizing technology that’s ever existed. It speaks to this idea that prior to the written word, all knowledge was, per se, communal. It had to be in a group. If you have multiple texts in front of you, then you trust the one that feels most logical. But you don’t have that luxury when all knowledge is communal. Being part of the crowd has to be part of learning.</p><p>The ear and the eye are very different organs. You can close your eyes, which you can’t do with your ears. You can get perspective from your eye and establish perspective in a way you can’t do with your ears. So it’s like you go into a room and you can stand back at the corner so you can make sure that you can see everything going on in the room. The ear is very different. We’re at the center of everything constantly. You can’t close it. The ear continues to work while we’re sleeping. There’s an evolutionary purpose for the fact that we can still hear when we’re sleeping, because if there’s an intruder or a wild animal or something, it wakes us up and we can run.</p><p>So the ear, McLuhan said, is inherently a source of terror. It feels very digital. Even though we do look at the internet, there is this sense in which we can never remove ourselves from it. Even if we’re reading the internet, it almost feels more like we’re hearing it. There’s an immersiveness in contemporary digital discourse that I think is much more like hearing than it is about seeing. So I think there’s all kinds of different ways that we are sort of returning to this realm.</p><p><b>Thompson: </b>We had the age of orality, which was the age of the ear. Then we had the high-water mark of literacy, which is the high-water mark of the age of the eye. And now we’re in this messy third stage where it’s like there’s some human facial organ that’s an eye and an ear mashed together, because we have TV and radio and social media and TikTok. And what’s interesting about these technologies is that they are all oral. What is radio, if not oral? What is television, if not oral? What is TikTok, if not spoken and live?</p><p>But there’s a lasting record of your tweets. There’s a lasting record of that TikTok, which can be shared. And the fact that these pieces of media can be recorded means that in many ways they are also of a piece with the age of literacy, of literate recorded artifacts. What do we make of this weird synthetic new stage that we’re in? What do we call it? How do we describe it?</p><p><b>Weisenthal:</b> Andrey Mir, who has written some of the best stuff updating Ong’s ideas, calls it digital orality. I like that. One thing that’s interesting, though, is that we might not really have those records in the future. For one thing, things disappear. Two, we don’t really trust pictures anymore. The archive is sort of tenuous. We maybe had this brief period where we had a lot of digital archives and we could trust them, but digital archives are disappearing and you’re going to have facsimiles, things that looked like they happened that didn’t actually happen, which, incidentally, Ong talks about.</p><p>So he talks about how in a lot of oral cultures, history was malleable. He talks about biblical genealogies: So-and-so begat so-and-so begat so-and-so begat so-and-so begat,  on forever. There are a lot of examples in oral cultures where, when something is no longer convenient—maybe there are some lineage of kings and that king falls into disrepute and they switch it—they’ll just come up with a new poem. And so there isn’t the idea of a fixed history. I think that’s probably what’s going to happen today. We’re going to have books for a very long time, but history will be manufactured in accordance with the sort of contemporary values of the moment.</p><p><b>Thompson:</b> This is a period that some people call post-literate. Reading is in decline. Standardized-test scores are in decline. As I’ve written, it sometimes feels like everything is trying to become television. Social media is becoming TV; podcasts are becoming TV. People are going to the movies less. Everything is evolving toward short-form video. I wonder how you feel about this general thesis that in a post-literate age, everything is evolving toward short-form video.</p><p><b>Weisenthal:</b> This idea of post-literacy, I think there’s a sort of figurative meaning and a literal meaning. On the one hand, again, when I hear the word <i>post-literacy</i> or when I’ve used the term, it doesn’t necessarily mean that people don’t know how to read. I still think it’s mostly useful as a term to describe conditions of information and conditions of communication that are very distinct from solitary, literate communications. So I think the fact that so much is talk, so much is back-and-forthness, so much is information designed to be viral, memorable, repeatable—this is mostly what I am thinking of when I think about post-literacy.</p><p>Incidentally, I don’t think people know how to read either. I look at myself and I think I read way more books than 99 percent of the population. But I’ll read two pages and then I’ll check my Twitter mentions, and then I’ll read two pages and check my Twitter mentions. Isn’t that everyone? Can anyone actually read three pages anymore? Maybe it’s just me, and my attention span is just totally bombed out, which is possible, because, again, I spend all day looking at a screen. I’ll fully cop to that.</p><p><b>Thompson:</b> I do also have the sense when I’m reading that there’s often, especially if my phone is anywhere within reach or sight, something calling me away from that book at all times.</p><p><b>Weisenthal:</b> In some of the writing from the ’60s and ’70s, one of the things that I’ve noticed is people talking about phones interrupting people having sex. This is a common observation. They talk about unplugging the phone before couples had sex or whatever it was. And I think, again, one of the things people talk about right now, which I find fascinating, is the big fertility drops and people are trying to figure it out. And this is something that is occurring in almost every country around the world, including China, which does not resemble the rest of the world and has avoided many contemporary pathologies. Even there, it’s happening.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/family/archive/2024/12/4b-sex-strike-american-dating/680770/?utm_source=feed\">Read: The slow, quiet demise of American romance</a>]</i></p><p>And I do think it’s very interesting that—if you go back and look at how many people noticed this phenomenon when everyone started getting phones—the degree to which it was as if the phone was the third person there, interrupting the privacy of the couple. That’s a very powerful observation that I think then has a lot of explanatory effects for what came afterwards, when everyone started holding a phone on them, every waking minute.</p><p><b>Thompson:</b> I want to apply your theories to some domains of modern life, starting with politics. I went to look up Donald Trump’s nicknames, because I know that you’re very interested in his propensity for epithets, for nicknames. It’s nearly Homeric. Fortunately for our purposes, Wikipedia keeps track of all of Trump’s nicknames, so I didn’t have to remember them—speaking of outsourced memory. Here are some of them. Steve Bannon was “Sloppy Steve,” Joe Biden was “Sleepy Joe,” Mike Bloomberg was “Mini Mike,” Jeb Bush was, of course, “Low-Energy Jeb.”</p><p>This plays into this classic tradition of orality. The wine-dark seas, swift-footed Achilles. And Walter Ong has a great passage where he writes about this, which I would love to get your reaction to:</p><blockquote>\n<p>The cliches in political denunciations in many low-technology developing cultures—enemy of the people, capitalist war-mongers—that strike high literates as mindless are residual formulary essentials of oral thought processes.</p>\n</blockquote><p>It’s so interesting to think that Ong is saying that it is low-technology developing countries where these nicknames are prevalent. But you wake up today and the richest country in the world is presided over by a now two-time president whose facility for nicknames is very famous. What significance do you put on this? Why is it important that a figure like Trump plays into these old-fashioned oral traditions?</p><p><b>Weisenthal:</b> It’s interesting—when you say things like, <i>Oh, Trump has a sort of Homeric quality in the way he speaks</i>, that repels a lot of people. Like, <i>What are you talking about? This is nothing like Homer</i>. But my theory, which I can’t prove, is that the original bards who composed Homer were probably Trump-like characters. So rather than saying Trump is a Homeric character, we could say that the people who gathered around and told these ancient stories were probably the Trump-like characters of their time. Colorful, very big characters, people who were loud, who could really get attention, who would captivate people when they talked. One of Ong’s observations in <i>Orality and Literacy</i> is about heavy and light characters in oral societies. Heavy characters are like Cerberus, the three-headed dog; Medusa; Zeus—these larger-than-life, frequently grotesque, visually grotesque characters.</p><p>The modern world has elevated a lot of what I think Ong would call heavy characters. I certainly think Trump is a heavy character, with his makeup, his hair, and his whole visual presentation. I think Elon Musk is a heavy character. We are in the time of the heavy character.</p><p>If you look at icons of the previous age, John F. Kennedy was not a heavy character. That’s a light character, a certain coolness. Barack Obama was a light character; there was a certain coolness to him. One of the things that people debate a lot is, like, <i>If Obama could run again, wouldn’t he just clean up?</i> <i>If Democrats could just bring Obama back for a third time, wouldn’t that just solve all of Democrats’ electoral problems?</i> And I think in 2016, I probably would’ve believed that. And maybe in 2020, I would’ve believed that. But I’m certainly less confident now. I feel like Obama is a character of a cooler, different time. A character from a pre-TikTok time, in many respects.</p><p><b>Thompson:</b> Let me push back here. I think Obama in 2004, with the first Democratic National Committee speech, was a heavy character. I think the presidency lightened him. I think Trump in 2015 was a heavy character, and he is a lighter character now having suffered overexposure. Maybe the fissures that you see in the Republican Party are that Trump, the once heavy character, is losing the weight that used to be necessary to keep this coalition together. And people are seeing he’s kind of lost it. I wonder if there’s some idea that in politics, many people debut as the heavy character. But experience and time and failure lightens them. And that’s part of the reason no president seems to survive more than one year of positive approval ratings. We have learned to hate everybody.</p><p><b>Weisenthal:</b> Since you mentioned this phenomenon, that no president can sustain high approval ratings (which does seem like a phenomenon basically everywhere), could we pivot? Could I bring in Meyrowitz here?</p><p>Meyrowitz, in 1985, was talking about electronic media before anyone really conceived of that idea. One of his observations is that everybody has an onstage and a backstage. We talk on this podcast in a certain way. But that is different from how we would talk at home with our family. Or you and I might talk differently when we hang up this podcast and we’re saying goodbye or something. This is a very normal thing, which is that you just talk differently in different environments.</p><p>What Meyrowitz anticipated in <i>No Sense of Place</i> is this idea that electronic media would cause us to be suspicious of people who talk differently in one environment versus another. If someone code-switched, if someone talked differently on the campaign trail than they did in their private life, then we would come to think, <i>This person’s a phony</i>. Something about Trump is that there are very few examples of him ever talking differently in one environment than in any other. People could be totally repelled by things that he said in public or private. But he’s not a hypocrite in the way that a lot of people use that word. He is the same in almost every environment. This is precisely what Meyrowitz would’ve anticipated, that we would gravitate toward people who act the same onstage and backstage, that we would come to view that consistency of character as a value.</p><p><b>Thompson:</b> The name of Meyrowitz’s book is<i> No Sense of Place</i>. And I want to just slow down on that title, because it’s a pun. By <i>no sense of place</i>, Meyrowitz is saying that electronic media extends our consciousness outward, so we don’t really know where we are. I could be reading Twitter in Arlington, Virginia, but feel myself becoming emotional about Gaza or Ukraine or Minneapolis, in a way that was impossible in the age before television or radio. This new age of communications media takes us out of where we are and puts us right in front of the faces of people who are thousands of miles away.</p><p>But he also means <i>no sense of place</i> in a hierarchical sense. He means that people will be able, with electronic media, to operate outside of their slot in the hierarchy: The poor will be able to scream at the billionaires. And this, he said, is going to create more social unrest. It’s going to create more, I think he would agree, of something like populism. And this really interesting idea that electronic media not only unmoors us from where we are geographically but that it also demolishes hierarchies—I think it was incredibly insightful, considering it was written 41 years ago.</p><p>But he goes one step further in a way that’s really surprising, and this is the part I’d really love you to comment on. He says this about our future relationship to expertise—and God only knows how many people have talked about what’s happened to expertise in the last few decades: “Our increasingly complex technological and social world has made us rely more and more heavily on ‘expert information,’ but the general exposure of ‘experts’ as fallible human beings has lessened our faith in them as people. The change in our image of leaders and experts leaves us with”—and this is exactly your point—“a distrust of power, but also with a seemingly powerless dependence on those in whom we have little trust.”</p><p><b>Weisenthal:</b> It’s crazy. It does feel like this could be in <i>The</i> <i>Atlantic</i> in 2025. It’s just so far ahead of its time. You mentioned the poor can scream at the billionaires. I think most people would say, <i>Look, technology is an enabled environment in which the poor can have their voice heard and billionaires are brought low and can be hectored, and we see that happen every day online</i>. Most people intuitively think that’s a very positive development. That’s, like, an egalitarian development. But by the same token, there are other things that most people are not as comfortable with. I think this whole field of study offers a certain way of viewing history that is not entirely satisfying to anyone or anyone’s political project currently.</p><p><b>Thompson: </b>Speaking of topics that aren’t particularly comfortable with any political project, I have a question for you about AI and how AI slots into orality versus literacy. I want to come at it from what I hope is an interesting angle. This is a quote from Ong’s <i>Orality and Literacy</i>:</p><blockquote>\n<p>A written text is basically unresponsive. If you ask a person to explain his or her statement, you can get an explanation; if you ask a text, you get back nothing except the same, often stupid, words which called for your question in the first place.</p>\n</blockquote><p>I reread that section on a plane recently, and I jolted up in my seat. <i>That’s</i> what AI has changed. You can enter into conversations with text. That is true either at a literal level—like, I can download a PDF of a book and give it to Claude and be like, <i>Claude, can we talk about this book?</i>—but also, at a higher abstract level, we’re talking about a technology that is pretrained on text. It’s pretrained on literacy. But we have an oral, which is to say conversational, relationship with that training corpus. It’s weird.</p><p><b>Weisenthal:</b> The jury is out still on how AI slots into this. Because on the one hand, you can upload some texts to Claude and ask questions, and it becomes an interactive thing. That’s oral; that’s conversation.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/family/2026/02/ai-etiquette-friends/685858/?utm_source=feed\">Read: The problem with using AI in your personal life</a>]</i></p><p>But those conversations with AI, they don’t feel like other conversations that exist online. The AI is not going to insult you. The AI is not going to speak to you in memes. The AI is not going to use epithets. I’m not trying to one-up the AI either. Ong used the word <i>agonistic</i>; oral cultures are competitive. We see that online, how we’re always competing with one another when we’re talking.</p><p>AI chatbot communications aren’t agonistically toned. Just the opposite. Most people’s complaint with AI is that it’s too obsequious, that it’s not confrontational enough. I’ll say something stupid to the chatbot, and it’ll say, <i>That’s a really good idea, Joe! Let’s explore that further.</i> This is actually one of the big problems of AI, which is that it’s insufficiently opinionated. The chatbots do not correct you. AI is conversational, but it doesn’t have a lot of these other aspects of conversation that other digital conversations have.</p><p><b>Thompson:</b> Maybe the age of social media really was the revenge of orality. But an age of AI would be much more like the revenge of literacy.</p><p>Ong and Meyrowitz both point to this idea that literacy pulled us into ourselves. Reading is interior. And then novels, in response to the interiority of reading, became more interior. Nineteenth-century novels are incredibly rich about what it is like to be thinking and alive in this moment. It’s not plot, plot, plot. It’s not genealogy. It’s fully inside the phenomenological experience of the characters.</p><p>And AI, to me, feels much more subvocal. It feels like I’m having a conversation with myself. It’s not myself. It’s this machine that I’m talking with, but it feels more like daydreaming with myself than the antagonistic experience of being on Twitter, where I’m inside the minds of other people, thrust into the faces of strangers whom I’ve never met.</p><p><b>Weisenthal:</b> It’s very plausible. It’s not going to look exactly like the previous age of literacy, but it never does. These things come and go. The current age of orality is different, obviously, from the original one. The return to solitude. If you’re going back and forth with the chatbot, you close the computer, you don’t feel that same <i>Oh, they’re still arguing there without me.</i> <i>They’re talking online about me and I’m not there to defend myself.</i> Whatever it is. You don’t quite have that same pull. I think all these things—they’ll live with each other, and there’ll be shades of the past that we hear echoes of, and they’ll be different, and they’ll be similar. And I think it’s good to recognize these patterns and observe them, just for one’s own sanity—to have a sense of what’s pulling you in various different directions.</p><p><b>Thompson:</b> To close with the Joeism “What’d I miss?”—what’s important in this space that we didn’t have time to talk about or that I didn’t sufficiently ask?</p><p><b>Weisenthal:</b> I just think, by and large, that there are a lot of contemporary pathologies. People point to digital media, the phones, et cetera, as drivers of them. What I would just say is, there’s a lot of writing that I think helps answer these questions, that was written before any of this existed. I would like it if more people became familiar with Josh Meyrowitz, Walter Ong, Eric Havelock, Marshall McLuhan, and so forth. I think I would like that. I just want to talk to people about them.</p><hr><p><small><i>This article was adapted from a </i><a href=\"https://www.derekthompson.org/p/why-the-decline-of-literacyand-the\"><i>post</i></a> <i>on Derek Thompson’s Substack.</i></small></p>",
    "description": "The decline of reading and the rise of social media are again transforming what it feels like to be a thinking person.",
    "is_fulltext": true,
    "source": "Derek Thompson | The Atlantic",
    "pub_date": "2026-02-22T07:01:56-05:00",
    "fetched_at": "2026-02-22T12:15:15.793944",
    "url_hash": "a587170d9e55590b30320956a1331482"
  },
  {
    "title": "Forge-Specific Repository Folders",
    "link": "https://nesbitt.io/2026/02/22/forge-specific-repository-folders.html",
    "content": "<p>Git doesn’t know about CI, code review, or issue templates, but every forge that hosts git repositories has added these features through the same trick: a dot-folder in your repo root that the forge reads on push. The folder names differ, the contents overlap in some places and diverge in others, and the portability story between them is worse than you’d expect. A companion to my earlier post on <a href=\"/2026/02/05/git-magic-files.html\">git’s magic files</a>.</p>\n\n<h3 id=\"github\">.github/</h3>\n\n<p>GitHub’s folder holds:</p>\n\n<ul>\n  <li><strong>workflows/</strong> — GitHub Actions CI/CD configuration (<code class=\"language-plaintext highlighter-rouge\">.github/workflows/*.yml</code>)</li>\n  <li><strong>ISSUE_TEMPLATE/</strong> and <strong>PULL_REQUEST_TEMPLATE/</strong> — issue and PR templates</li>\n  <li><strong>dependabot.yml</strong> — automated dependency updates</li>\n  <li><strong>CODEOWNERS</strong> — required reviewers for paths</li>\n  <li><strong>FUNDING.yml</strong> — sponsor button configuration</li>\n</ul>\n\n<p>GitHub also reads some files from the repo root or from <code class=\"language-plaintext highlighter-rouge\">.github/</code>: <strong>SECURITY.md</strong>, <strong>CONTRIBUTING.md</strong>, <strong>CODE_OF_CONDUCT.md</strong>, <strong>LICENSE</strong>.</p>\n\n<p>The <code class=\"language-plaintext highlighter-rouge\">.github/workflows/</code> directory contains YAML files defining Actions workflows. Each file is a separate workflow that runs on events like push, pull request, or schedule.</p>\n\n<p>CODEOWNERS uses <a href=\"/2026/02/12/the-many-flavors-of-ignore-files.html\">gitignore-style</a> glob patterns to map paths to GitHub users or teams who must review changes:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code># .github/CODEOWNERS\n*.js @frontend-team\n/docs/ @docs-team\n* @admins\n</code></pre></div></div>\n\n<h3 id=\"gitlab\">.gitlab/</h3>\n\n<p>GitLab uses <code class=\"language-plaintext highlighter-rouge\">.gitlab/</code> for:</p>\n\n<ul>\n  <li><strong>ci/</strong> — reusable CI/CD templates</li>\n  <li><strong>merge_request_templates/</strong> — MR templates</li>\n  <li><strong>issue_templates/</strong> — issue templates</li>\n  <li><strong>CODEOWNERS</strong> — approval rules</li>\n  <li><strong>changelog_config.yml</strong> — built-in changelog generation config</li>\n</ul>\n\n<p>GitLab’s main CI config is <code class=\"language-plaintext highlighter-rouge\">.gitlab-ci.yml</code> at the repo root, not in the folder. Projects often keep reusable CI templates in <code class=\"language-plaintext highlighter-rouge\">.gitlab/ci/</code> and pull them in with <code class=\"language-plaintext highlighter-rouge\">include:local</code>, though the directory name is convention rather than something GitLab treats specially.</p>\n\n<p>GitLab’s CODEOWNERS works similarly to GitHub’s but with different approval rule options and integration with GitLab’s approval workflows.</p>\n\n<h3 id=\"gitea-and-forgejo\">.gitea/ and .forgejo/</h3>\n\n<p>Gitea and Forgejo (a fork of Gitea) support:</p>\n\n<ul>\n  <li><strong>workflows/</strong> — Gitea/Forgejo Actions (<code class=\"language-plaintext highlighter-rouge\">.gitea/workflows/*.yml</code> or <code class=\"language-plaintext highlighter-rouge\">.forgejo/workflows/*.yml</code>)</li>\n  <li><strong>ISSUE_TEMPLATE/</strong> and <strong>PULL_REQUEST_TEMPLATE/</strong> — templates</li>\n</ul>\n\n<p>Forgejo checks <code class=\"language-plaintext highlighter-rouge\">.forgejo/</code> then <code class=\"language-plaintext highlighter-rouge\">.gitea/</code> then <code class=\"language-plaintext highlighter-rouge\">.github/</code> in that order, while Gitea checks <code class=\"language-plaintext highlighter-rouge\">.gitea/</code> then <code class=\"language-plaintext highlighter-rouge\">.github/</code>, so you can keep shared config in <code class=\"language-plaintext highlighter-rouge\">.github/</code> and add platform-specific overrides in the forge’s own folder.</p>\n\n<p>Gitea’s CODEOWNERS uses Go regexp instead of gitignore-style globs. Patterns look like <code class=\"language-plaintext highlighter-rouge\">.*\\.js$</code> instead of <code class=\"language-plaintext highlighter-rouge\">*.js</code>.</p>\n\n<h3 id=\"bitbucket\">.bitbucket/</h3>\n\n<p>Bitbucket keeps two files in <code class=\"language-plaintext highlighter-rouge\">.bitbucket/</code>:</p>\n\n<ul>\n  <li><strong>CODEOWNERS</strong> — required reviewers</li>\n  <li><strong>teams.yaml</strong> — ad-hoc reviewer groups</li>\n</ul>\n\n<p>CI config lives at <code class=\"language-plaintext highlighter-rouge\">bitbucket-pipelines.yml</code> in the repo root, similar to GitLab’s approach.</p>\n\n<p>Bitbucket’s CODEOWNERS has reviewer selection strategies baked into the syntax:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code># .bitbucket/CODEOWNERS\n*.js random(1) @frontend-team\n/api/ least_busy(2) @backend-team\n/critical/ all @security-team\n</code></pre></div></div>\n\n<p><code class=\"language-plaintext highlighter-rouge\">random(1)</code> picks one random reviewer from the team, <code class=\"language-plaintext highlighter-rouge\">least_busy(2)</code> picks the two reviewers with the fewest open PRs, and <code class=\"language-plaintext highlighter-rouge\">all</code> requires every team member to review. No other forge has reviewer selection strategies in the CODEOWNERS syntax.</p>\n\n<p>The <code class=\"language-plaintext highlighter-rouge\">.bitbucket/teams.yaml</code> file lets you define ad-hoc reviewer groups without creating formal Bitbucket teams:</p>\n\n<div class=\"language-yaml highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"c1\"># .bitbucket/teams.yaml</span>\n<span class=\"na\">security</span><span class=\"pi\">:</span>\n  <span class=\"pi\">-</span> <span class=\"s\">alice</span>\n  <span class=\"pi\">-</span> <span class=\"s\">bob</span>\n<span class=\"na\">frontend</span><span class=\"pi\">:</span>\n  <span class=\"pi\">-</span> <span class=\"s\">carol</span>\n  <span class=\"pi\">-</span> <span class=\"s\">dave</span>\n</code></pre></div></div>\n\n<p>These can then be referenced in CODEOWNERS with the <code class=\"language-plaintext highlighter-rouge\">@teams/</code> prefix, like <code class=\"language-plaintext highlighter-rouge\">@teams/security</code> or <code class=\"language-plaintext highlighter-rouge\">@teams/frontend</code>.</p>\n\n<h3 id=\"fallback-chains\">Fallback chains</h3>\n\n<p>If you host the same repository on multiple platforms, shared config in <code class=\"language-plaintext highlighter-rouge\">.github/</code> will be picked up by Gitea and Forgejo, with platform-specific overrides in <code class=\"language-plaintext highlighter-rouge\">.gitea/</code> or <code class=\"language-plaintext highlighter-rouge\">.forgejo/</code> taking priority. Bitbucket and GitLab only check their own folders, so multi-platform support across all forges still requires some duplication.</p>\n\n<h3 id=\"gotchas\">Gotchas</h3>\n\n<p>GitHub’s org-level <code class=\"language-plaintext highlighter-rouge\">.github</code> repository lets you set default issue templates, PR templates, and community health files for every repo in the org, but the fallback is all-or-nothing: if a repo has any file in its own <code class=\"language-plaintext highlighter-rouge\">.github/ISSUE_TEMPLATE/</code> folder, none of the org-level templates are inherited and there’s no way to merge them. The org <code class=\"language-plaintext highlighter-rouge\">.github</code> repo must also be public, so your default templates are visible to everyone.</p>\n\n<p>GitHub looks for CODEOWNERS in three places: <code class=\"language-plaintext highlighter-rouge\">.github/CODEOWNERS</code>, then <code class=\"language-plaintext highlighter-rouge\">CODEOWNERS</code> at the root, then <code class=\"language-plaintext highlighter-rouge\">docs/CODEOWNERS</code>. First one found wins and the others are silently ignored. The syntax looks like <code class=\"language-plaintext highlighter-rouge\">.gitignore</code> but <a href=\"https://docs.github.com/articles/about-code-owners\">doesn’t support</a> <code class=\"language-plaintext highlighter-rouge\">!</code> negation, <code class=\"language-plaintext highlighter-rouge\">[]</code> character ranges, or <code class=\"language-plaintext highlighter-rouge\">\\#</code> escaping. A syntax error used to cause the entire file to be silently ignored, meaning no owners were assigned to anything. GitHub has since added error highlighting in the web UI but there’s still no push-time validation.</p>\n\n<p>GitLab supports <a href=\"https://docs.gitlab.com/user/project/codeowners/advanced/\">optional CODEOWNERS sections</a> with a <code class=\"language-plaintext highlighter-rouge\">^</code> prefix, but “optional” only applies to merge requests. If someone pushes directly to a protected branch, the docs say approval from those sections is “still required,” though how that actually works for a command-line push is <a href=\"https://forum.gitlab.com/t/optional-codeowners-what-does-approval-required-if-pushing-directly-to-protected-branch-mean/107795\">unclear even to GitLab users</a>.</p>\n\n<p>The Gitea/Forgejo workflow fallback is all-or-nothing too: if <code class=\"language-plaintext highlighter-rouge\">.gitea/workflows/</code> contains any workflow files, <code class=\"language-plaintext highlighter-rouge\">.github/workflows/</code> is <a href=\"https://github.com/go-gitea/gitea/issues/31456\">completely ignored</a>, so you can’t run platform-specific workflows side by side.</p>\n\n<p>Gitea’s CODEOWNERS doesn’t check <code class=\"language-plaintext highlighter-rouge\">.github/CODEOWNERS</code> at all, only <code class=\"language-plaintext highlighter-rouge\">./CODEOWNERS</code>, <code class=\"language-plaintext highlighter-rouge\">./docs/CODEOWNERS</code>, and <code class=\"language-plaintext highlighter-rouge\">.gitea/CODEOWNERS</code>. If you migrate from GitHub with your CODEOWNERS in <code class=\"language-plaintext highlighter-rouge\">.github/</code>, it silently does nothing. And even when it works, CODEOWNERS on Gitea <a href=\"https://github.com/go-gitea/gitea/issues/32602\">isn’t enforceable</a>: it adds reviewers but there’s no branch protection option to require their approval. Anyone with write access can approve. CODEOWNERS also <a href=\"https://github.com/go-gitea/gitea/pull/30476\">didn’t apply to fork PRs</a> until Gitea 1.21.11.</p>\n\n<p>Forgejo and Gitea both inherited the <code class=\"language-plaintext highlighter-rouge\">pull_request_target</code> trigger from GitHub Actions compatibility, which means they also inherited the “<a href=\"https://securitylab.github.com/resources/github-actions-preventing-pwn-requests/\">pwn request</a>” attack surface where a fork’s code runs with the base repo’s secrets. Forgejo added a trust-based approval system for fork PRs, but <code class=\"language-plaintext highlighter-rouge\">pull_request_target</code> workflows still run with write tokens.</p>\n\n<p><a href=\"https://www.cvedetails.com/cve/CVE-2025-68937/\">CVE-2025-68937</a> is a symlink-following vulnerability in <code class=\"language-plaintext highlighter-rouge\">.gitea/template</code> and <code class=\"language-plaintext highlighter-rouge\">.forgejo/template</code> files. An attacker creates a template repository with symlinks pointing at sensitive paths like the git user’s <code class=\"language-plaintext highlighter-rouge\">authorized_keys</code>, and when someone creates a new repo from that template, the symlinks get dereferenced during template expansion, allowing the attacker to write arbitrary files on the server. It affected Gitea since v1.11 and Forgejo through v13.0.1.</p>\n\n<p>Forgejo also fixed a <a href=\"https://codeberg.org/forgejo/security-announcements/issues/38\">cache poisoning vulnerability</a> where PR workflows could write to the shared action cache, letting a malicious PR poison future privileged workflow runs. It’s unclear whether Gitea is affected or fixed this quietly, as they haven’t published a corresponding advisory.</p>\n\n<p>GitHub Actions <a href=\"https://yossarian.net/til/post/github-actions-is-surprisingly-case-insensitive/\">expressions are case-insensitive</a>. <code class=\"language-plaintext highlighter-rouge\">$</code> matches whether the branch is <code class=\"language-plaintext highlighter-rouge\">main</code>, <code class=\"language-plaintext highlighter-rouge\">MAIN</code>, or <code class=\"language-plaintext highlighter-rouge\">mAiN</code>. Context accesses like <code class=\"language-plaintext highlighter-rouge\">secrets.MY_SECRET</code> and <code class=\"language-plaintext highlighter-rouge\">SECRETS.my_secret</code> resolve to the same thing. Git itself is case-sensitive, so if your workflow security depends on branch naming conventions, there’s a mismatch that’s easy to miss.</p>\n\n<hr />\n\n<p>If you know of other forge-specific folders or have corrections, reach out on <a href=\"https://mastodon.social/@andrewnez\">Mastodon</a> or submit a pull request on <a href=\"https://github.com/andrew/nesbitt.io\">GitHub</a>.</p>",
    "description": "Magic folders in git forges: what .github/, .gitlab/, .gitea/, .forgejo/ and .bitbucket/ do.",
    "is_fulltext": true,
    "source": "Andrew Nesbitt",
    "pub_date": "2026-02-22T10:00:00+00:00",
    "fetched_at": "2026-02-22T12:15:20.574987",
    "url_hash": "04f4b5715694fa4a483cdcc2d2699728"
  }
]