[
  {
    "title": "Rodney and Claude Code for Desktop",
    "link": "https://simonwillison.net/2026/Feb/16/rodney-claude-code/#atom-everything",
    "content": "\n    <p>I'm a very heavy user of <a href=\"https://code.claude.com/docs/en/claude-code-on-the-web\">Claude Code on the web</a>, Anthropic's excellent but poorly named cloud version of Claude Code where everything runs in a container environment managed by them, greatly reducing the risk of anything bad happening to a computer I care about.</p>\n<p>I don't use the web interface at all (hence my dislike of the name) - I access it exclusively through their native iPhone and Mac desktop apps.</p>\n<p>Something I particularly appreciate about the desktop app is that it lets you see images that Claude is \"viewing\" via its <code>Read /path/to/image</code> tool. Here's what that looks like:</p>\n<p><img alt=\"Screenshot of a Claude Code session in Claude Desktop. Claude says: The debug page looks good - all items listed with titles and descriptions. Now let me check the nav\nmenu -  Analyzed menu image file - Bash uvx rodney open &quot;http://localhost:8765/&quot; 2&gt;&amp;1 &amp;&amp; uvx rodney click &quot;details.nav-menu summary&quot; 2&gt;&amp;1 &amp;% sleep 0.5 &amp;&amp; uvx rodney screenshot /tmp/menu.png 2&gt;&amp;1 Output reads: Datasette: test, Clicked, /tmp/menu.png - then it says Read /tmp/menu.png and reveals a screenshot of the Datasette interface with the nav menu open, showing only &quot;Debug&quot; and &quot;Log out&quot; options. Claude continues: The menu now has just &quot;Debug&quot; and “Log out&quot; — much cleaner. Both pages look good. Let me clean up the server and run the remaining tests.\" src=\"https://static.simonwillison.net/static/2026/rodney-claude-desktop.jpg\" /></p>\n<p>This means you can get a visual preview of what it's working on while it's working, without waiting for it to push code to GitHub for you to try out yourself later on.</p>\n<p>The prompt I used to trigger the above screenshot was:</p>\n<blockquote>\n<p><code>Run \"uvx rodney --help\" and then use Rodney to manually test the new pages and menu - look at screenshots from it and check you think they look OK</code></p>\n</blockquote>\n<p>I designed <a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#rodney-cli-browser-automation-designed-to-work-with-showboat\">Rodney</a> to have <a href=\"https://github.com/simonw/rodney/blob/main/help.txt\">--help output</a> that provides everything a coding agent needs to know in order to use the tool.</p>\n<p>The Claude iPhone app doesn't display opened images yet, so I <a href=\"https://twitter.com/simonw/status/2023432616066879606\">requested it as a feature</a> just now in a thread on Twitter.</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/anthropic\">anthropic</a>, <a href=\"https://simonwillison.net/tags/claude\">claude</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/claude-code\">claude-code</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/async-coding-agents\">async-coding-agents</a>, <a href=\"https://simonwillison.net/tags/coding-agents\">coding-agents</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/projects\">projects</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a></p>\n\n\n\n",
    "description": "I'm a very heavy user of Claude Code on the web, Anthropic's excellent but poorly named cloud version of Claude Code where everything runs in a container environment managed by them, greatly reducing the risk of anything bad happening to a computer I care about. I don't use the web interface at all (hence my dislike of the name) - I access it exclusively through their native iPhone and Mac desktop apps. Something I particularly appreciate about the desktop app is that it lets you see images that",
    "is_fulltext": true,
    "source": "Simon Willison's Weblog",
    "pub_date": "2026-02-16T16:38:57+00:00",
    "fetched_at": "2026-02-17T00:38:18.086800",
    "url_hash": "48aba168692c508e1ae92a8dcaab7c99"
  },
  {
    "title": "AI is destroying Open Source, and it's not even good yet",
    "link": "https://www.jeffgeerling.com/blog/2026/ai-is-destroying-open-source/",
    "content": "<p>Over the weekend Ars Technica <a href=\"https://arstechnica.com/ai/2026/02/after-a-routine-code-rejection-an-ai-agent-published-a-hit-piece-on-someone-by-name/\">retracted an article</a> because the AI a writer used <a href=\"https://bsky.app/profile/benjedwards.com/post/3mewgow6ch22p\">hallucinated quotes</a> from an open source library maintainer.</p>\n<p>The irony here is the maintainer in question, Scott Shambaugh, was <a href=\"https://theshamblog.com/an-ai-agent-published-a-hit-piece-on-me/\">harassed by someone's AI agent</a> over not merging it's AI slop code.</p>\n<p>It's likely the bot was running through someone's local 'agentic AI' instance (likely using OpenClaw). The guy who built OpenClaw was just hired by OpenAI to &quot;work on bringing agents to everyone.&quot; You'll have to forgive me if I'm not enthusastic about that.</p>",
    "description": "Over the weekend Ars Technica retracted an article because the AI a writer used hallucinated quotes from an open source library maintainer. The irony here is the maintainer in question, Scott Shambaugh, was harassed by someone's AI agent over not merging it's AI slop code. It's likely the bot was running through someone's local 'agentic AI' instance (likely using OpenClaw). The guy who built OpenClaw was just hired by OpenAI to &quot;work on bringing agents to everyone.&quot; You'll have to forg",
    "is_fulltext": false,
    "source": "Jeff Geerling",
    "pub_date": "Mon, 16 Feb 2026 15:30:00 -0600",
    "fetched_at": "2026-02-17T00:38:18.445399",
    "url_hash": "90aa7e5c90c04dfacd6eb4fd71db65fc"
  },
  {
    "title": "[Sponsor] Hands-On Workshop: Fix It Faster — Crash Reporting, Tracing, and Logs for iOS in Sentry",
    "link": "https://sentry.io/resources/ios-workshop-jan-2026/?utm_source=daringfireball&utm_medium=paid-display&utm_campaign=general-fy27q1-evergreen&utm_content=static-ad-mobilerss-trysentry",
    "content": "\n<p>Learn how to connect the dots between slowdowns, crashes, and the user experience in your iOS app. This on-demand session covers how to:</p>\n\n<ul>\n<li>Set up Sentry to surface high-priority mobile issues without alert fatigue.</li>\n<li>Use Logs and Breadcrumbs to reconstruct what happened with a crash.</li>\n<li>Find what’s behind a performance bottleneck using Tracing.</li>\n<li>Monitor and reduce the size of your iOS app using Size Analysis.</li>\n</ul>\n\n<p><a href=\"https://sentry.io/resources/ios-workshop-jan-2026/?utm_source=daringfireball&amp;utm_medium=paid-display&amp;utm_campaign=general-fy27q1-evergreen&amp;utm_content=static-ad-mobilerss-trysentry\">Watch it here</a>.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Hands-On Workshop: Fix It Faster — Crash Reporting, Tracing, and Logs for iOS in Sentry’\"  href=\"https://daringfireball.net/feeds/sponsors/2026/02/hands-on_workshop_fix_it_faste\">&nbsp;★&nbsp;</a>\n</div>\n\n\t",
    "description": "",
    "is_fulltext": true,
    "source": "Daring Fireball",
    "pub_date": "2026-02-17T00:02:28Z",
    "fetched_at": "2026-02-17T00:38:19.633389",
    "url_hash": "2cda331478b7165fdeb57fe332c6b233"
  },
  {
    "title": "Book Review: This Is How They Tell Me the World Ends - Nicole Perlroth ★⯪☆☆☆",
    "link": "https://shkspr.mobi/blog/2026/02/book-review-this-is-how-they-tell-me-the-world-ends-nicole-perlroth/",
    "content": "<img src=\"https://shkspr.mobi/blog/wp-content/uploads/2026/03/9781526629838.jpg\" alt=\"Book cover.\" width=\"270\" height=\"415\" class=\"alignleft size-full wp-image-66617\">\n\n<p>This cybersecurity book is badly written, contains multiple offensive stereotypes, is technically inaccurate, and spends more time focussing on the author's love affair with the New York Times than almost anything else. Seriously, if you take a drink every time the book mentions the NYT, you'll spend most of the chapters drunk. Which, to be fair, is probably the best way to experience it.</p>\n\n<p>The epilogue pre-emptively complains that \"the technical community will argue I have over-generalized and over-simplicifed\". I don't have a problem with that; it is essential to write about cybersecurity for the lay audience. But this book just gets things wrong.  As a quick sample:</p>\n\n<blockquote><p>Some pushed to have his cybersecurity license stripped.</p></blockquote>\n\n<p>Does anyone know where I can get one of these fabled licenses?</p>\n\n<blockquote><p>Jobert would send discs flying out of Michiel’s hard drive from two hundred yards away.</p></blockquote>\n\n<p>If you can make a disc fly out of an HDD, something has gone <em>very</em> wrong!</p>\n\n<p>It does become moderately interesting when the author stops gushing about the NYT and describes some of the implications behind the hacks which changed our world. The descriptions of Stuxnet, EternalBlue, and other cyberweapons are well done. But it quickly lapses back into lazy clichés.</p>\n\n<p>For example, hackers are variously described thusly:</p>\n\n<blockquote><p>Every bar, at every conference, was reminiscent of the Mos Eisley cantina in Star Wars. Ponytailed hackers mingled with lawyers,</p>\n\n<p>Their diet subsisted of sandwiches and Red Bull.</p>\n\n<p>These young men, with their sunken, glowing eyes, lived through their screens.</p>\n\n<p>hackers—pimply thirteen-year-olds in their parents’ basements, ponytailed coders from the web’s underbelly</p>\n\n<p>Germans don’t do small talk, and they don’t do bullshit.</p></blockquote>\n\n<p>Then there's this:</p>\n\n<blockquote><p>To any woman who has ever complained about the ratio of females to males in tech, I say: try going to a hacking conference. With few exceptions, most hackers I met were men who showed very little interest in anything beyond code. And jiujitsu. Hackers love jiujitsu.</p></blockquote>\n\n<p>I don't even know where to start! Sure, the gender ratios are skewed, but every hacker I know has multiple interests and I don't think any of them include jiujitsu!</p>\n\n<p>It's also sloppily edited. There are multiple odd typos and weird inconsistencies. For example:</p>\n\n<blockquote><p>Leonardo famously labeled himself with the Latin phrase senza lettere—without letters—because, unlike his Renaissance counterparts, he couldn’t read Latin.</p></blockquote>\n\n<p>He used the phrase \"s<strong>a</strong>nza lettere\" - not \"s<strong>en</strong>za\" - see <a href=\"http://www.mpiwg-berlin.mpg.de/sites/default/files/2021-03/Leo_Catalogo_English_final.pdf\">Codex\nAtlanticus</a>.</p>\n\n<blockquote><p>not the testosterone-fueled “boo-rah” soldier Hollywood had conditioned us to.</p></blockquote>\n\n<p>I can't find any reference to <strong>boo</strong>-rah outside of Hallowe'en articles.</p>\n\n<blockquote><p>Panetta told an audience on the USS Intrepid in New York. “They could derail passenger trains, or even more dangerous, derail passenger trains loaded with lethal chemicals..</p></blockquote>\n\n<p>That's <em>not</em> what he said. The author has cribbed a incorrect transcription from - of course! - the <a href=\"http://www.nytimes.com/2012/10/12/world/panetta-warns-of-dire-threat-of-cyberattack.html\">New York Times</a>.</p>\n\n<p>Do <em>passenger</em> trains tend to carry lethal chemicals? No, obviously not. It took me less than 5 minutes to find <a href=\"https://jifco.defense.gov/Media/Multimedia/IFC-Videos/videoid/158193/dvpmoduleid/128139/dvpTag/securit/\">the original video</a>. At 1h 8m 22s, Panetta clearly says \"derail trains loaded with\". No \"passenger\".</p>\n\n<blockquote><p>Littered throughout attackers’ code were references to the 1965 science fiction epic Dune, a Frank Herbert science fiction novel set in a not-too-distant future</p></blockquote>\n\n<p>I'm not a big enough nerd to have read Dune. But <a href=\"https://mastodon.social/@Edent/115790559193467510\">most scholars agree</a> it is set in the <em>far</em> future.</p>\n\n<blockquote><p>A century and a half earlier, in 1949, he reminded the crowd, a dozen countries had come together to agree on basic rules of warfare.</p></blockquote>\n\n<p>This book was written in 2020. While 1949 is a long time ago, it isn't a century ago. Perhaps this is a reference to the original 1864 convention?</p>\n\n<p>I'll begrudgingly admit that the book does a good job of explaining some of the problems facing the world as cyber-warfare takes hold of industries and nations. But it is hidden behind so much American hegemony and basic mistakes that I found it borderline unreadable. On the rare occasions that the author stops unnecessarily inserting themself (and the New York Bloody Times) into the story, it can be rather interesting.</p>\n\n<p>This is too important a story to be written up this badly.</p>\n",
    "description": "This cybersecurity book is badly written, contains multiple offensive stereotypes, is technically inaccurate, and spends more time focussing on the author&#039;s love affair with the New York Times than almost anything else. Seriously, if you take a drink every time the book mentions the NYT, you&#039;ll spend most of the chapters drunk. Which, to be fair, is probably the best way to experience it. The…",
    "is_fulltext": true,
    "source": "Terence Eden’s Blog",
    "pub_date": "Mon, 16 Feb 2026 12:34:55 +0000",
    "fetched_at": "2026-02-17T00:38:28.001550",
    "url_hash": "587b7f623a4d31405dc425d95688fc25"
  },
  {
    "title": "Visualizing orbital velocity",
    "link": "https://www.johndcook.com/blog/2026/02/16/hodograph/",
    "content": "<p>The shape of a planet&#8217;s orbit around a star is an ellipse. To put it another way, a plot of the <em>position</em> of a planet&#8217;s orbit over time forms an ellipse. What about the velocity? Is it&#8217;s plot also an ellipse? Surprisingly, a plot of the velocity forms a <em>circle</em> even if a plot of the position is an ellipse.</p>\n<p>If an object is in a circular orbit, it&#8217;s velocity vector traces out a circle too, with the same center. If the object is in an elliptical orbit, it&#8217;s velocity vector still traces out a circle, but one with a different center. When the orbit is eccentric, the <b>hodograph</b>, the figure traced out by the velocity vector, is also eccentric, though the two uses of the word &#8220;eccentric&#8221; are slightly different.</p>\n<p>The eccentricity <em>e</em> of an ellipse is the ratio <em>c</em>/<em>a</em> where <em>c</em> is the distance between the two foci and <em>a</em> is the semi-major axis. For a circle, <em>c</em> = 0 and so <em>e</em> = 0. The more elongated an ellipse is, the further apart the foci are relative to the axes and so the greater the eccentricity.</p>\n<p>The plot of the orbit is eccentric in the sense that the two foci are distinct because the shape is an ellipse. The hodograph is eccentric in the sense that the circle is not centered at the origin.</p>\n<p>The two kinds of eccentricity are related: the displacement of the center of the hodograph from the origin is proportional to the eccentricity of the ellipse.</p>\n<p>Imagine the the orbit of a planet with its major axis along the <em>x</em>-axis and the coordinate of its star positive.  The hodograph is a circle shifted up by an amount proportional to the eccentricity of the orbit <em>e</em>. The top of the circle corresponds to perihelion, the point closest to the star, and the bottom corresponds to aphelion, the point furthest from the star. For more details, see the post <a href=\"https://www.johndcook.com/blog/2025/02/28/max-min-orbital-speed/\">Max and min orbital speed</a>.</p>The post <a href=\"https://www.johndcook.com/blog/2026/02/16/hodograph/\">Visualizing orbital velocity</a> first appeared on <a href=\"https://www.johndcook.com/blog\">John D. Cook</a>.",
    "description": "The shape of a planet&#8217;s orbit around a star is an ellipse. To put it another way, a plot of the position of a planet&#8217;s orbit over time forms an ellipse. What about the velocity? Is it&#8217;s plot also an ellipse? Surprisingly, a plot of the velocity forms a circle even if a plot of [&#8230;] The post Visualizing orbital velocity first appeared on John D. Cook.",
    "is_fulltext": true,
    "source": "John D. Cook",
    "pub_date": "Mon, 16 Feb 2026 21:24:45 +0000",
    "fetched_at": "2026-02-17T00:38:46.236708",
    "url_hash": "26469f4314ed565705d4e7eb2ce67ee3"
  },
  {
    "title": "Project Code Name",
    "link": "https://feed.tedium.co/link/15204/17277502/corporate-turnaround-code-names-history",
    "content": "\n      <h2>Why do corporate restructuring plans get code names the way operating systems do? And why are the names often so bizarre?</h2><img src=\"https://static.tedium.co/uploads/tedium021626.gif\" alt=\"Project Code Name\"><div class=\"whitebox\"><div class=\"big\"><strong>Today in Tedium:</strong> Recently, Amazon did something kind of annoying in the midst of doing something painful. It laid off a ton of people, but in the midst of doing that, <a href=\"https://www.reuters.com/business/world-at-work/amazon-bungles-wednesday-layoff-plan-with-misfired-internal-email-2026-01-28/\">it accidentally dropped an email</a> revealing the layoffs early, before people got laid off. That email revealed that this layoff had an official code name, “Project Dawn,” which presumably speaks to the idea of wiping the grime away, like dish soap. It sounds insane, but companies have been taught to name initiatives after random things for decades, sometimes to celebrate successful initiatives, sometimes to lay off thousands of people. (I’m sure Will Lewis named the recent Washington Post layoff endeavor “Project Zoom Ghosting.”) Why are they such a corporate fixation—even for layoffs? Today’s Tedium ponders why corporate culture is so dominated by code names. <em>— Ernie @ Tedium</em></div></div><div class=\"redbox\"><p><blockquote class=\"quote\"></p><h3>“[W]hen several stations are connected by the same wire, the attention of the particular station for which the message is destined must be secured. This is done by signalling, not the full name of the station, which would occupy time, but an abbreviated name, consisting of two or three letters, assigned to that particular station and known as its code name. Thus, LV is Liverpool, EH Edinburgh, and so on.”</h3><p></blockquote></p><p><strong>— A <a href=\"https://www.google.com/books/edition/The_English_Illustrated_Magazine/BLshAQAAIAAJ?hl=en&amp;gbpv=1&amp;pg=PA749&amp;printsec=frontcover\">passage</a> from a 1888 issue of The English Illustrated Magazine,</strong> a turn-of-the-century periodical, discussing how the British Post Office used code names to help make sense of the complexities of the telegraph system. (This appears to be one of the first uses of the term “code name.”) Eventually code names would expand to businesses in general, with New York City <a href=\"https://www.google.com/books/edition/Greater_New_York/LcVNAAAAMAAJ?hl=en&amp;gbpv=1&amp;pg=RA1-PA17&amp;printsec=frontcover\">setting up</a> a central bureau for registered addresses in 1919, with the goal of avoiding mix-ups on the telegraph line. (Think of them as the domain names of the 1920s.)</p></div><div class=\"whitebox\"><figure><img src=\"https://proxy.tedium.co/zAuibWEuQ9xkDQXdhI9U68uQNHY=/1000x667/filters:quality(80)/uploads/dish-detergent.jpg\" width=\"1000\" height=\"667\" loading=\"lazy\" alt=\"dish-detergent.jpg\" /><figcaption>Was this the type of “Dawn” that Amazon was referring to? (<a href=\"https://depositphotos.com/?ref=26887078&amp;utm_source=linkCopy&amp;utm_medium=referral\">DepositPhotos.com</a>)</figcaption></figure><h3>The code name has become an essential part of how the tech industry operates</h3><p><strong>When you’re building a project,</strong> and you don’t quite know where it is and what it’s going to turn into yet, a code name can be quite an asset. It’s a tool that can help a project coalesce around a set of ideas, and it doesn’t necessarily need to be something that the public ever sees.</p><p>In fact, it may actually be better if the public never knows about them. Often, you don’t want to reveal something while it’s incubating. As the Tumblr site <a href=\"https://askagamedev.tumblr.com/post/684425660030124032/code-names-and-secrecy\"><em>Ask a Gamedev</em></a> put it in 2022:</p><blockquote><p>It’s important to note that the reason for secrecy is primarily for marketing purposes. We want to keep a big project quiet until we’re ready to show it and get players excited for it. If our product is tied in with another product or IP with a big planned push at some point in the future, tipping our hand too early can lead to a cascading set of reveals we or our business partners were unready to make. For example, revealing a new mainline Pokémon game too early would spill the beans on an entire new Pokémon generation, which would affect merchandise, animated series, and so on. As a result, we usually put in safeguards to prevent such leaks from happening, both punitive and practical.</p></blockquote><p>Code names, also known as code words, have a long history that often <a href=\"https://www.theworldwar.org/learn/about-wwi/spotlight-secret-list-coded-words\">criss-crosses</a> through the two <a href=\"https://codenames.info\">World Wars</a>, and perhaps through some of the <a href=\"https://www.spymuseum.org/education-programs/spy-resources/language-of-espionage/\">world’s largest intelligence agencies</a>. That they bled into business is not wholly surprising, as large companies deal in trade secrets all the time—even <a href=\"https://tedium.co/2019/08/29/pressure-fried-patents/\">fast-food chicken restaurants</a>.</p><p>But what’s unusual is that, particularly in the technology industry, these code names often have a long shelf life, one that can stick around for years after the fact. The word Mozilla, the name of the company that produces Firefox, started as the code name of Netscape Navigator, the web browser upon which Firefox is based.</p><figure><img src=\"https://proxy.tedium.co/60hVlvtIflwT6-7MNqF6o14Fb5s=/819x1007/filters:quality(80)/uploads/mozilla-employees.jpg\" width=\"819\" height=\"1007\" loading=\"lazy\" alt=\"mozilla-employees.jpg\" /><figcaption>Aspire to look this cool. (San Francisco Chronicle/Newspapers.com)</figcaption></figure><p>It wasn’t like the Netscape team hid it—back in the ’90s, employees of the company actually decked out Mozilla gear in photos for the <em>San Francisco Chronicle</em>.</p><p>“Every great project starts out with a T-shirt, and to make a good T-shirt you need a good code name, something like ‘Terminator’ or ‘T-Rex,’” Gene Wang, a software development manager at Symantec, <a href=\"https://www.newspapers.com/article/the-san-francisco-examiner-code-names-n/190972464/\">told the <em>Chronicle</em></a> in 1996. (Apparently he was not aware Mozilla already had the dinosaur metaphor covered.)</p><p>The technology industry has long been shaped by code names, to the point where those code names break out of their holding cage and end up defining the product. Apple in particular is infamous for this, with the animal and landmark names that define MacOS starting as code names but eventually becoming product names.</p><figure><img src=\"https://proxy.tedium.co/8IDRRqDdnqXswDi4v7UW5_Lt_aI=/1095x819/filters:quality(80)/uploads/microsoft-chicago.jpg\" width=\"1095\" height=\"819\" loading=\"lazy\" alt=\"microsoft-chicago.jpg\" /><figcaption>You used Chicago, but probably didn’t even realize it.</figcaption></figure><p>Operating systems are a natural reason to have a code name, by the way. In a Bluesky thread from 2024, Microsoft old hand Larry Osterman, who has been at the company for more than 40 years, <a href=\"https://bsky.app/profile/larryosterman.github.io/post/3ldhjvkqxns2x\">explained</a> how these code names, such as “Chicago,” the nickname for Windows 1995, would bleed into the public discourse. They existed because these were lengthy projects that existed before the marketing team had weighed in on a name. However, the dynamic that necessitated these monikers has faded somewhat.</p><p>“Code names leak. Both to the public and into other artifacts (files with code names in them, config settings, etc.),” he wrote, explaining why references to Chicago appear in the operating system. “And in a world where you release every 3-6 months, you really don’t need code names, because the release is so small.”</p><p>(Someone tell that to the Ubuntu team, which famously gives its twice-yearly iterations alliterative animal-themed code names, most recently “<a href=\"https://canonical.com/blog/canonical-releases-ubuntu-25-10-questing-quokka\">Questing Quokka</a>.” I imagine that must get hard to plan for on Q releases.)</p><p>And while software release schedules have gotten faster, internal projects still need code names, and sometimes there are so many code names that you need a system to manage them. <a href=\"https://blog.codinghorror.com/whats-in-a-project-name/\">In a 2007 blog post</a>, Stack Exchange co-founder Jeff Atwood said his team went through so many that they had to develop a system to generate new ones.</p><p>“The names are chosen alphabetically from a set of items; every new project gets a name from the set,” he wrote. “We start with A, and when we finally arrive at Z, we pick a new set of items for project name inspiration.”</p><p>Microsoft has so many code names that it has <a href=\"https://en.wikipedia.org/wiki/List_of_Microsoft_codenames\">a quite-long Wikipedia page</a> dedicated to them. <a href=\"https://en.wikipedia.org/wiki/List_of_Apple_codenames\">So does Apple</a>.</p><p>But as far as I can tell, they have yet to give their layoffs a code name.</p></div><div class=\"redbox\"><p><blockquote class=\"quote\"></p><h3>“I don’t want to spell out the idea on the insecure email channel. Even if you say the phrase ‘Video H or N’ in public, people will know what you mean, so let’s just call it Video. Don’t say it in combination with the H or N site :)”</h3><p></blockquote></p><p><strong>— Jawed Karim,</strong> one of the co-founders of YouTube, discussing (<a href=\"https://www.techemails.com/p/jawed-karim-to-chad-hurley-and-steve-chen\">according to Internal Tech Emails</a>) how the trio of co-founders, still at PayPal, should talk about their formative idea that would end up taking over the world. (What’s “H or N”? Easy: The platform was originally intended to be a HotOrNot for video. That was too specific—but it ended up inspiring the <em>actual</em> idea.)</p></div><div class=\"whitebox\"><figure><img src=\"https://proxy.tedium.co/6hDNisp04l_lcaiQDiu7SknD5FY=/1000x668/filters:quality(80)/uploads/layoffs-stock-photo.jpg\" width=\"1000\" height=\"668\" loading=\"lazy\" alt=\"layoffs-stock-photo.jpg\" /><figcaption>I’m not sure who I feel worse for—the people this stock photo represents, or the stock photo model themselves, knowing that they’re going to represent layoffs until the end of time. (<a href=\"https://depositphotos.com/?ref=26887078&amp;utm_source=linkCopy&amp;utm_medium=referral\">DepositPhotos.com</a>)</figcaption></figure><h3>But enough about startups and operating systems. Do companies really give their layoffs code names?</h3><p>When a company is attempting to do something sensitive, like poach a CEO, it’s likely they may not want to spell out exactly what is going on before they pull the trigger.</p><p>Case in point: In the months before Yahoo! brought on Marissa Mayer as their CEO, Mayer had to frequently talk about the shift in secret. She was still working at Google, and there was also the risk the news would leak to the media. So what did she and Yahoo! do? They gave the initiative a code name, “<a href=\"https://www.theverge.com/2013/8/1/4578510/project-cardinal-the-secret-code-that-brought-mayer-to-yahoo\">Project Cardinal</a>.” This allowed her to set up her exit plan in secret, while avoiding, say, tipping off her limo driver.</p><p>Mayer got hired rather than fired in that situation, but one presumes that a similar motivation might lead a company to bury an initiative behind a code name.</p><figure><img src=\"https://proxy.tedium.co/ZAWyszKKA947gW28QARONHDV2UU=/1000x750/filters:quality(80)/uploads/JackInTheBox.jpg\" width=\"1000\" height=\"750\" loading=\"lazy\" alt=\"JackInTheBox.jpg\" /><figcaption>Just be happy that they aren’t giving these restructuring code names matching logos. Or maybe they are, because that’s something a graphic designer wants to work on. A logo for layoffs. (<a href=\"https://flickr.com/photos/85567416@N03/19956270386/\">Willis Lam/Flickr</a>)</figcaption></figure><p>It can also provide organizational cover when doing something that negatively harms employees. To offer an example: Red Robin <a href=\"https://www.independent.co.uk/us/money/red-robin-burger-closures-chain-b2909430.html\">recently announced</a> the closure of a number of restaurants as part of a broader “North Star” initiative aimed at improving service while fighting against a wave of shutdowns. (They’re not alone: Last spring, the fast food chain Jack in the Box announced its “<a href=\"https://investors.jackinthebox.com/news/news-details/2025/Jack-in-the-Box-Inc--Unveils-JACK-on-Track-Plan-to-Improve-Long-Term-Financial-Performance/default.aspx\">Jack on Track</a>” plan, which includes a “restaurant closure program.”)</p><p>Eventually, things can get more serious than these situations, which require more intense strategizing. There’s a term for what these companies are doing: “Turnaround management,” which refers to the optimization of businesses to stay solvent. Turnarounds can happen at any time in a business’ history, though the concept is most associated with businesses nearing bankruptcy.</p><p>These plans can really hurt, as in the case of Ford’s “<a href=\"https://www.npr.org/2006/01/23/5168799/q-a-fords-way-forward\">Way Forward</a>,” first undertaken in 2006. That plan involved more than 25,000 job cuts, which was dramatic and painful—but it helped Ford avoid the brutal bailouts General Motors and Chrysler required. In 2009, while those companies were barely holding on, Ford actually posted a profit.</p><p>Which is to say that, while turnaround plans can seem callous and unfair to affected workers or even customers affected by decreased service, they can absolutely save companies. It’s a bloodletting tool.</p><p>But that’s not to say every turnaround code name is a good one, and the worst ones can signal a sense of panic, as noted in a 2015 on the topic in <a href=\"https://www.bloomberg.com/news/articles/2015-11-23/what-s-in-a-corporate-turnaround-plan-name-\"><em>Bloomberg</em></a> (<a href=\"https://archive.ph/mU2i8\">archive link</a>).</p><p>“There are different degrees of distress,” turnaround consultant Margaret Bogenrief told the outlet. “Generally, the more grandiose the name, the more severe the distress.”</p><figure><img src=\"https://proxy.tedium.co/QRDKteKV1flcM93banRC-YzuM7Y=/999x999/filters:quality(80)/uploads/general-mills-compass.jpg\" width=\"999\" height=\"999\" loading=\"lazy\" alt=\"general-mills-compass.jpg\" /><figcaption>This compass represents just one of the three restructuring initiatives General Mills had going on in the mid-2010s. (<a href=\"https://flickr.com/photos/orqwith/14290750405/\">quimby/Fickr</a>)</figcaption></figure><p>Of course, there can be a degree of silliness that comes with anything complex and corporate. Around 2015, General Mills announced not one, not two, but <a href=\"https://finance.yahoo.com/news/general-mills-restructuring-plans-international-170732442.html\">three separate corporate restructuring projects</a>: Project Compass, Project Century, and Project Catalyst. These three projects each touched on different parts of the company, with Project Compass focused on its international markets, Project Century its North American manufacturing, and Project Catalyst its organizational effectiveness. These projects cost hundreds of millions of dollars collectively and came with more than 1,500 layoffs. And to the layperson, it just sounds hopelessly complex.</p><p>Kellogg’s, meanwhile, had been down this road multiple times itself. In 2009, the company announced K-LEAN, an initiative to increase optimization (and which led to layoffs in its factories). Then, in 2013, <a href=\"https://www.foodbusinessnews.net/articles/1297-for-kellogg-rebuilding-starts-with-k\">they followed it up with Project K</a>, which aimed to reorganize the various company segments … and which also led to layoffs.</p><p>Ultimately, Kellogg’s decided to split off its legacy cereal business into its own company, <a href=\"https://www.wkkellogg.com\">WK Kellogg Co.</a>, and rename the larger snack food business as <a href=\"https://www.kellanova.com/\">Kellanova</a>. Both companies ended up getting sold to large candy companies recently—WJ Kellogg to Ferrero, Kellanova to Mars.</p><p>With this framing, turnaround projects can be seen as corporate salvaging missions first, layoff plans second. But honestly, that struggles to explain Amazon, a company that <a href=\"https://ir.aboutamazon.com/news-release/news-release-details/2026/Amazon-com-Announces-Fourth-Quarter-Results/\">made $21.2 billion</a> in net income in the prior quarter alone. Sometimes a job cut is just a job cut, no turnaround necessary.</p></div><div class=\"graybox\"><figure><img src=\"https://proxy.tedium.co/9tVVxJTZsBTthM7CBIdUCs4Mjp4=/768x576/filters:quality(80)/uploads/256181932_a216f50bbd_o.jpg\" width=\"768\" height=\"576\" loading=\"lazy\" alt=\"256181932_a216f50bbd_o.jpg\" /><figcaption>Dude, you’re getting a Dell … 2.0. (<a href=\"https://flickr.com/photos/orqwith/14290750405/\">Casey Marshall/Flickr</a>)</figcaption></figure><h3>Five typical naming schemes for corporate projects</h3><ol><li><strong>Leaning into the puns and metaphors.</strong> It’s not just Jack in the Box leaning into the punny turnaround project names. Companies do this all the time— <a href=\"https://www.newspapers.com/article/the-toronto-star-project-code-names-for/190972293/\">A 1991 Reuters wire story</a>, for example, describes how Bank of America named an attempted acquisition of Security Pacific “Project Sunshine,” while another attempted merger was named after the companies’ local NHL teams. More recently, Panera announced its “<a href=\"https://www.cnbc.com/2025/11/18/panera-bread-turnaround-plan.html\">Panera RISE</a>” strategy, which plays off its most popular product.</li><li><strong>Proposing an upgrade.</strong> I’ve traditionally been sort of <a href=\"https://tedium.co/2025/01/07/dell-laptop-rebranding-confusing/\">snarky about Dell</a>, a company that in my mind screams “enterprise” and “lack of creativity.” So I guess when I hear Dell once named a reorganization effort “<a href=\"https://www.informationweek.com/software-services/former-pc-industry-darling-tries-for-comeback-as-dell-2-0\">Dell 2.0</a>,” the thought that runs through my head is, “checks out.” More recently, Intel has also gone down this road with its <a href=\"https://www.intc.com/news-events/press-releases/detail/1451/intel-ceo-pat-gelsinger-announces-idm-2-0-strategy\">IDM 2.0</a> project for expanding its manufacturing—though Pat Gelsinger got booted before fully seeing it through.</li><li><strong>Dropping a strong hint.</strong> After hiring a new CEO good enough to make Howard Schultz go away, Starbucks leaned into a turnaround plan called “<a href=\"https://fortune.com/2025/07/03/starbucks-executives-6-million-stock-grants-barista-wage-increase/\">Back to Starbucks</a>,” which is what it wants customers to do. (Similarly, JCPenney’s endeavor is called “<a href=\"https://www.forbes.com/sites/pamdanziger/2025/06/27/jcpenneys-turnaround-begins-powered-by-a-subversive-new-marketing-strategy/\">Yes, JCPenney</a>.”) This also works when the goal is laying people off—as shown by Kellogg’s K-LEAN, mentioned above.</li><li><strong>Setting a deadline.</strong> Turnaround strategies are often built around significant goals. Sometimes, those goals include dates—and sometimes those dates are way out, as seen from German automaker Opel, which set a “DRIVE!2022” campaign way back in 2013. (They really wanted to get ahead of that date.) Some other examples include Air France-KLM’s “<a href=\"https://aviationnews-online.com/public/article/afi-klm-board-outlines-perform-2020-restructuring-plans\">Perform 2020</a>,” and the Trump administration’s “Project 2025.” Yes, even political parties do it.</li><li><strong>New-agey abstraction.</strong> But most notably, so many turnaround project names fall into vague, shapeless territory, not necessarily setting a goal as much as a subtle hint as to where they want to go. General Mills’ “Project Catalyst” is a great example of this, as is Red Robin’s “Operation North Star” and Amazon’s aforementioned Project Dawn. Another example is “<a href=\"https://ir.newellbrands.com/news-releases/news-release-details/newell-brands-announces-restructuring-program\">Project Phoenix</a>,” set into place by Newell Brands, the owner of the Coleman, Rubbermaid, and Yankee Candle brands. Perhaps it’s because “Project Mass Layoff” doesn’t roll off the tongue quite so easily.</li></ol></div><div class=\"redbox\"><p><blockquote class=\"quote\"></p><h3>“Simplification often feels risky because it appears to be a contraction. But in a turnaround, complexity is a liability.”</h3><p></blockquote></p><p><strong>— Daniel Schmeltz,</strong> a corporate transformation expert, <a href=\"https://fortune.com/2025/09/22/why-most-business-turnarounds-fail-layoffs-corporate-restructuring/\">writing in <em>Fortune</em></a> about why most corporate turnaround endeavors fail. In the piece, he argues that slow-going turnaround plans are typically the most unsuccessful. “Hesitation and complexity are liabilities; clarity and rapid execution are non-negotiable,” he writes. “In a time when so many companies are attempting a turnaround, by acting decisively, businesses can cut through inertia, rebuild momentum, and secure sustainable results.” If you’re going to chop off a limb or two, get it over with—perhaps with a little less creativity in the code name.</p></div><div class=\"graybox\"><p><strong>I think code names naturally engender discomfort for people,</strong> in part because of what they represent. They are often used to hide something from view, and that thing can be nefarious, even troubling.</p><p>Recently, Cleveland Guardians pitcher Emmanuel Clase has faced allegations that he was receiving money from “microbets” made on his own pitches. In other words, he was manipulating pitches to secure winning bets on himself, then gamblers were sending some of that money his way.</p><p>When talking about this with one of the betters, <a href=\"https://courthousenews.com/fowl-ball-feds-say-emmanuel-clase-used-cockfighting-lingo-to-hide-rigged-pitches/\">they reportedly hid</a> what they were doing by using coded language, like “rooster” and “chicken.” <a href=\"https://www.cleveland.com/news/2026/01/emmanuel-clase-defense-strategy-admit-torturing-roosters-in-cockfights-to-deny-gambling-charge.html\">Clase has attempted to claim</a> that they were discussing cockfighting rather than pitching, an activity Clase also gambled on. (Interesting defense strategy—I wasn’t gambling on games, I was gambling on animal abuse.)</p><p>Clase was (at least based on allegations in court records that he has denied) trying to get away with something nefarious. Broken down, the reason for the cloak-and-dagger stuff was not all that dissimilar to why Marissa Mayer did it.</p><figure><img src=\"https://proxy.tedium.co/6TYMFsNRDVe6I-PQQsy1qfnvcxs=/1000x667/filters:quality(80)/uploads/Depositphotos_81616892_S.jpg\" width=\"1000\" height=\"667\" loading=\"lazy\" alt=\"Depositphotos_81616892_S.jpg\" /><figcaption>Ah, what the hell, let’s dunk on Project Dawn one more time. (<a href=\"https://depositphotos.com/?ref=26887078&amp;utm_source=linkCopy&amp;utm_medium=referral\">DepositPhotos.com</a>)</figcaption></figure><p>One might argue that many of the above listed companies were trying to shroud their not-so-friendly plans in friendly language. You can’t quite say, “we need to lay thousands of people off,” and you <em>definitely</em> can’t say “we <em>want</em> to lay thousands of people off.” But to cloak it in “Phoenix,” “Dawn,” or “North Star,” it makes the bad news digestible. It makes room for a little compassion for the HR team as they’re delivering the bad news.</p><p>Well, unless you’re an executive for Amazon and you casually drop a doublespeak-style code name in everybody’s inbox.</p><p>--</p><p>Well, I guess I was feeling salty today! Find this one an interesting read? <a href=\"https://tedium.co/2026/02/16/corporate-turnaround-code-names-history/\">Share it with a pal</a>.</p><p>And thanks to our sponsor <a href=\"https://la-machine.fr/?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=tedium\">la machine</a>, a machine that doesn’t need a code name—because its purpose is transparent as can be.</p></div>\n    <img src=\"https://feed.tedium.co/link/15204/17277502.gif\" height=\"1\" width=\"1\"/>",
    "description": "Why do corporate restructuring plans get code names the way operating systems do? And why are the names often so bizarre?",
    "is_fulltext": true,
    "source": "Tedium: The Dull Side of the Internet.",
    "pub_date": "2026-02-16T20:39:22Z",
    "fetched_at": "2026-02-17T00:38:55.067633",
    "url_hash": "b27bca95d1572b786ea2ea338cf09792"
  },
  {
    "title": "Deep Blue: Chess vs Programming",
    "link": "https://susam.net/deep-blue.html",
    "content": "\n\n<p>\n  I remember how dismayed Kasparov was after losing the 1997 match to\n  IBM's Deep Blue, although his views on Deep Blue became more\n  balanced with time and he accepted that we had entered a new era in\n  which computers would outperform grandmasters at chess.\n</p>\n<p>\n  Still, chess players can take comfort in the fact that chess is\n  still played between humans.  Players make their name and fame by\n  beating other humans because playing against computers is no longer\n  interesting as a competition.\n</p>\n<p>\n  Many software developers would like to have similar comfort.  But\n  that comfort is harder to find, because unlike chess, building\n  prototypes or PoCs is not seen as a sport or art form.  It is mostly\n  seen as a utility.  So while brain-coding a PoC may still be\n  intellectually satisfying for the programmer, to most other people\n  it only matters that the thing works.  That means that programmers\n  do not automatically get the same protected space that chess players\n  have, where the human activity itself remains valued even after\n  machines become stronger.  The activity programmers enjoy may\n  continue but the recognition and economic value attached to it may\n  shrink.\n</p>\n<p>\n  So I think the big adjustment software developers have to make is\n  this: The craft will still exist and we will still enjoy doing it\n  but the credit and value will increasingly go to those who define\n  problems well, connect systems, make good product decisions and make\n  technology useful in messy real-world situations.  It has already\n  been this way for a while and will only become more so as time goes\n  by.\n</p>\n<hr>\n<p>\n  <em>\n    This note reproduces a recent comment I posted in a Lobsters forum\n    thread about LLM-assisted software development at\n    at <a href=\"https://lobste.rs/s/qmjejh#c_4bgez9\">lobste.rs/s/qmjejh</a>.\n  </em>\n</p>\n<p>\n  <em>\n    See also:\n    <a href=\"inverse-laws-of-robotics.html\">Three Inverse Laws of AI and Robotics</a>.\n  </em>\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/deep-blue.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/miscellaneous.html\">#miscellaneous</a>\n</p>\n\n",
    "description": "I remember how dismayed Kasparov was after losing the 1997 match to IBM's Deep Blue, although his views on Deep Blue became more balanced with time and he accepted that we had entered a new era in which computers would outperform grandmasters at chess. Still, chess players can take comfort in the fact that chess is still played between humans. Players make their name and fame by beating other humans because playing against computers is no longer interesting as a competition. Many software develo",
    "is_fulltext": true,
    "source": "Susam Pal",
    "pub_date": "Sun, 15 Feb 2026 00:00:00 +0000",
    "fetched_at": "2026-02-17T00:38:56.306526",
    "url_hash": "fbd7d0e9773d6665838217080cc7681c"
  },
  {
    "title": "1998 Ebook!",
    "link": "https://www.filfre.net/2026/02/1998-ebook/",
    "content": "<p>Hi, folks&#8230;</p>\n<p>Just a quick note to inform you that the ebook for 1998 is now available <a href=\"/the-digital-antiquarian-e-book-library/\">on the usual page</a>. I&#8217;m sorry this was so long in coming. I owe a huge thanks to my hiking buddy Stefaan Rillaert, who adapted Richard Lindner&#8217;s original scripts to run on Linux instead of Windows.</p>\n<p>We&#8217;ve elected to make the books available in .epub format only going forward. The .mobi format has been deprecated for some years now, and all but the oldest Kindle e-readers should have received software updates in 2022 to let them handle .epub files natively. If you are stuck with an extremely old Kindle, you can use <a href=\"https://calibre-ebook.com/\">Calibre</a> to convert .epub files to .mobi on your computer. I hope this won&#8217;t be too much of an inconvenience.</p>\n<p>Now that we&#8217;ve got the tool chain sorted, new ebooks should be appearing on a more timely basis. Thank you for your patience, and enjoy the 1998 book!</p>\n<hr />\n<p><code> </code><br />\n<strong>Did you enjoy this article? If so, please think about pitching in to help me make many more like it. You can pledge any amount you like.</strong></p>\n<p><a href=\"https://www.patreon.com/DigitalAntiquarian\" rel=\"attachment wp-att-5598\"><img decoding=\"async\" class=\"aligncenter wp-image-5598 size-full\" src=\"https://www.filfre.net/wp-content/uploads/2023/04/Patreon-300x133-1.png\" alt=\"\" width=\"300\" height=\"133\" /></a></p>\n<hr />\n",
    "description": "Hi, folks&#8230; Just a quick note to inform you that the ebook for 1998 is now available on the usual page. I&#8217;m sorry this was so long in coming. I owe a huge thanks to my hiking buddy Stefaan Rillaert, who adapted Richard Lindner&#8217;s original scripts to run on Linux instead of Windows. We&#8217;ve elected [&#8230;]",
    "is_fulltext": true,
    "source": "The Digital Antiquarian",
    "pub_date": "Mon, 16 Feb 2026 13:32:30 +0000",
    "fetched_at": "2026-02-17T00:39:03.318250",
    "url_hash": "b59a9b483afd84afe85b791754833949"
  },
  {
    "title": "Betere Kamerstukken, en hoe lastig innovatie is",
    "link": "https://berthub.eu/articles/posts/betere-kamerdocumenten-en-innovatie/",
    "content": "Het is 2026 en twee journalisten benaderen me met simpele vragen. Waarom kan je niet klikken op verwijzingen in Tweede Kamerstukken? En waarom kan ik de motienummers gebruikt tijdens Kamerdebatten nergens vinden?\nInnovatie is zo makkelijk nog niet. Dit is geen klacht over de Tweede Kamer: ik had deze problemen ook nog niet gespot, laat staan opgelost. Hier de twee gevallen, gevolgd door wat nabeschouwing over waarom zoiets zo lang duurt.",
    "description": "Het is 2026 en twee journalisten benaderen me met simpele vragen. Waarom kan je niet klikken op verwijzingen in Tweede Kamerstukken? En waarom kan ik de motienummers gebruikt tijdens Kamerdebatten nergens vinden? Innovatie is zo makkelijk nog niet. Dit is geen klacht over de Tweede Kamer: ik had deze problemen ook nog niet gespot, laat staan opgelost. Hier de twee gevallen, gevolgd door wat nabeschouwing over waarom zoiets zo lang duurt.",
    "is_fulltext": false,
    "source": "Bert Hubert's writings",
    "pub_date": "Mon, 16 Feb 2026 17:00:00 +0100",
    "fetched_at": "2026-02-17T00:39:12.320875",
    "url_hash": "c5dae9e7278e1c5309bcfb63c8b3ef99"
  },
  {
    "title": "Anthropic's 500 vulns are the tip of the iceberg",
    "link": "https://martinalderson.com/posts/anthropic-found-500-zero-days/?utm_source=rss",
    "content": "Anthropic's red team found 500+ critical vulnerabilities with Claude. But they focused on maintained software. The scarier problem is the long tail that nobody will ever patch.",
    "description": "Anthropic's red team found 500+ critical vulnerabilities with Claude. But they focused on maintained software. The scarier problem is the long tail that nobody will ever patch.",
    "is_fulltext": false,
    "source": "Martin Alderson",
    "pub_date": "Tue, 17 Feb 2026 00:00:00 GMT",
    "fetched_at": "2026-02-17T00:39:20.944425",
    "url_hash": "aaeea1a89a56ef908216c1e858e5b477"
  }
]